{
    "facility": "ABINGTON SURGICAL CENTER, LP",
    "data": [
        {
            "eventid": "4PH012",
            "date": "1/30/2024",
            "data": "Initial comments:This report is the result of an off-site unannounced revisit survey conducted on January 30, 2024, following a State Licensure survey completed on November 6, 2023, at Abington Surgical Center.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Ambulatory Care Facilities, Annex A, Title 28, Part IV, Subparts A and F, Chapters 551-573, November 1999. Plan of Correction: Initial comments:This report is the result of an off-site unannounced revisit survey conducted on January 30, 2024, following a State Licensure survey completed on November 6, 2023, at Abington Surgical Center.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Ambulatory Care Facilities, Annex A, Title 28, Part IV, Subparts A and F, Chapters 551-573, November 1999. Plan of Correction:"
        },
        {
            "eventid": "CHCP11",
            "date": "1/23/2024",
            "data": "Initial comments:This report is the result of an off-site occupancy survey conducted on January 23, 2024, at Abington Surgical Center, which included a replacement portable miniature c-arm x-ray equipment.  Based on the occupancy survey, it was determined the facility was in compliance with all applicable requirements of the Pennsylvania Department of Health's Rules and Regulations for Ambulatory Care Facilities, Annex A, Title 28, Part IV, Subparts A and F, Chapters 551-573, November 1999 and the current edition of the Guidelines for Design and Construction of Outpatient Facilities.   Plan of Correction: Initial comments:This report is the result of an off-site occupancy survey conducted on January 23, 2024, at Abington Surgical Center, which included a replacement portable miniature c-arm x-ray equipment.  Based on the occupancy survey, it was determined the facility was in compliance with all applicable requirements of the Pennsylvania Department of Health's Rules and Regulations for Ambulatory Care Facilities, Annex A, Title 28, Part IV, Subparts A and F, Chapters 551-573, November 1999 and the current edition of the Guidelines for Design and Construction of Outpatient Facilities.   Plan of Correction:"
        },
        {
            "eventid": "ERR611",
            "date": "1/12/2024",
            "data": "Initial comments:This report is the result of an off-site special monitoring survey completed on January 12, 2024, at Abington Surgical Center.  It was determined the facility was not in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Ambulatory Care Facilities, Annex A, Title 28, Part IV, Subparts A and F, Chapters 551-573, November 1999. Plan of Correction: Initial comments:This report is the result of an off-site special monitoring survey completed on January 12, 2024, at Abington Surgical Center.  It was determined the facility was not in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Ambulatory Care Facilities, Annex A, Title 28, Part IV, Subparts A and F, Chapters 551-573, November 1999. Plan of Correction: 51.5 (b) LICENSURE Building Occupancy:51.5. Building occupancy (b) A health care facility shall request a pre occupancy survey at least 30 days prior to the anticipated  occupancy of the facility or an  addition or remodeled part thereof.  The Department will conduct an onsite  survey of the new or remodeled portion  of the health care facility prior to granting approval for occupancy. The Department may give authorization to  occupy the new or remodeled portion of  the health care facility by an interim  written authorization. If interim  authorization for occupancy is given,  the Department will provide the health  care facility with formal  authorization within 30 days.Observations:Based on review of facility documents, and interview with staff (EMP), it was determined the facility failed to notify the Department in writing at least 30 days prior to the intended use of new or upgraded equipment for the provision of health care services on patients.Review on January 11, 2024, of facility document, email from EMP1 dated December 15, 2023, 9:03 AM, revealed,  \"Subject ...Notification-New Equipment ...THE ABINGTON SURGICAL CENTER WILL BE PURCHASING... Mini C-Arm ... This C-arm is replacing an old C-Arm ...\"Review on January 11, 2024, of facility document, email from EMP1 dated January 11, 2024, 12:44 PM revealed,  \"... we didn't start trialing until after it was seen by BioMed on 11-15-23 ...\"Review on January 12, 2024, of facility document, email from EMP1 dated January 12, 2024, 10:35 AM revealed,  \"... This C-arm has not been used except for when the rep [medical equipment representative] was at the center to trial ...\"Interview with EMP1 on January 12, 2024, at 10:42 AM confirmed the facility failed to notify the Department in writing at least 30 days prior to the intended use of new or upgraded x-ray equipment for the provision of health care services on patients. Further interview with EMP1 confirmed the facility used the new x-ray equipment on patients on November 15, 2023, and EMP1 confirmed the facility sent the notification of the new equipment to the Department on December 15, 2023.   Plan of Correction - To be completed: 03/01/2024The executive director reviewed the Center's policy for PA DOH Notification Requirements.   This policy was shared with the facility leadership team.  Additionally, this notification policy will be discussed at the patient safety committee meeting and will be included in the minutes of that meeting.  To ensure compliance with the Notification policy, for the months of February, March and April 2024 the Executive Director will audit any scheduled events that require notification to ensure that the notifications have been made within the correct timeframe.  100% compliance is expected.   Audit results will be shared with the patient safety committee.  To ensure ongoing compliance, the Executive Director will monitor the status of any event that requires notification.  The monitoring will include the description of the event and the date the notifications are sent.This plan of correction will be shared with the patient safety committee and the Board of Director. 51.5 (b) LICENSURE Building Occupancy: 51.5. Building occupancy (b) A health care facility shall request a pre occupancy survey at least 30 days prior to the anticipated  occupancy of the facility or an  addition or remodeled part thereof.  The Department will conduct an onsite  survey of the new or remodeled portion  of the health care facility prior to granting approval for occupancy. The Department may give authorization to  occupy the new or remodeled portion of  the health care facility by an interim  written authorization. If interim  authorization for occupancy is given,  the Department will provide the health  care facility with formal  authorization within 30 days. Observations:Based on review of facility documents, and interview with staff (EMP), it was determined the facility failed to notify the Department in writing at least 30 days prior to the intended use of new or upgraded equipment for the provision of health care services on patients.Review on January 11, 2024, of facility document, email from EMP1 dated December 15, 2023, 9:03 AM, revealed,  \"Subject ...Notification-New Equipment ...THE ABINGTON SURGICAL CENTER WILL BE PURCHASING... Mini C-Arm ... This C-arm is replacing an old C-Arm ...\"Review on January 11, 2024, of facility document, email from EMP1 dated January 11, 2024, 12:44 PM revealed,  \"... we didn't start trialing until after it was seen by BioMed on 11-15-23 ...\"Review on January 12, 2024, of facility document, email from EMP1 dated January 12, 2024, 10:35 AM revealed,  \"... This C-arm has not been used except for when the rep [medical equipment representative] was at the center to trial ...\"Interview with EMP1 on January 12, 2024, at 10:42 AM confirmed the facility failed to notify the Department in writing at least 30 days prior to the intended use of new or upgraded x-ray equipment for the provision of health care services on patients. Further interview with EMP1 confirmed the facility used the new x-ray equipment on patients on November 15, 2023, and EMP1 confirmed the facility sent the notification of the new equipment to the Department on December 15, 2023.   Plan of Correction - To be completed: 03/01/2024The executive director reviewed the Center's policy for PA DOH Notification Requirements.   This policy was shared with the facility leadership team.  Additionally, this notification policy will be discussed at the patient safety committee meeting and will be included in the minutes of that meeting.  To ensure compliance with the Notification policy, for the months of February, March and April 2024 the Executive Director will audit any scheduled events that require notification to ensure that the notifications have been made within the correct timeframe.  100% compliance is expected.   Audit results will be shared with the patient safety committee.  To ensure ongoing compliance, the Executive Director will monitor the status of any event that requires notification.  The monitoring will include the description of the event and the date the notifications are sent.This plan of correction will be shared with the patient safety committee and the Board of Director."
        },
        {
            "eventid": "N3U111",
            "date": "11/29/2023"
        },
        {
            "eventid": "ZMPW11",
            "date": "11/14/2023",
            "data": "Initial comments:This report is the result of an occupancy survey conducted on November 14, 2023, at Abington Surgical Center, which included an LED (light emitting diode) high power medical cold light source.  Based on the occupancy survey, it was determined the facility was in compliance with all applicable requirements of the Pennsylvania Department of Health's Rules and Regulations for Ambulatory Care Facilities, Annex A, Title 28, Part IV, Subparts A and F, Chapters 551-573, November 1999 and the current edition of the Guidelines for Design and Construction of Outpatient Facilities.   Plan of Correction: Initial comments:This report is the result of an occupancy survey conducted on November 14, 2023, at Abington Surgical Center, which included an LED (light emitting diode) high power medical cold light source.  Based on the occupancy survey, it was determined the facility was in compliance with all applicable requirements of the Pennsylvania Department of Health's Rules and Regulations for Ambulatory Care Facilities, Annex A, Title 28, Part IV, Subparts A and F, Chapters 551-573, November 1999 and the current edition of the Guidelines for Design and Construction of Outpatient Facilities.   Plan of Correction:"
        },
        {
            "eventid": "443O12",
            "date": "11/6/2023",
            "data": "Initial comments:This report is the result of an unannounced off-site revisit survey conducted on November 6, 2023, following an off-site Special Monitoring survey completed on September 29, 2023, at Abington Surgical Center.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Ambulatory Care Facilities, Annex A, Title 28, Part IV, Subparts A and F, Chapters 551-573, November 1999. Plan of Correction: Initial comments:This report is the result of an unannounced off-site revisit survey conducted on November 6, 2023, following an off-site Special Monitoring survey completed on September 29, 2023, at Abington Surgical Center.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Ambulatory Care Facilities, Annex A, Title 28, Part IV, Subparts A and F, Chapters 551-573, November 1999. Plan of Correction:"
        },
        {
            "eventid": "4PH011",
            "date": "11/6/2023",
            "data": "Initial comments:This report is the result of an on-site State licensure survey initiated on November 1, 2023 and completed off-site on November 6, 2023, at Abington Surgical Center.  It was determined the facility was not in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Ambulatory Care Facilities, Annex A, Title 28, Part IV, Subparts A and F, Chapters 551-573, November 1999.  Plan of Correction: Initial comments:This report is the result of an on-site State licensure survey initiated on November 1, 2023 and completed off-site on November 6, 2023, at Abington Surgical Center.  It was determined the facility was not in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Ambulatory Care Facilities, Annex A, Title 28, Part IV, Subparts A and F, Chapters 551-573, November 1999.  Plan of Correction: 561.21 LICENSURE Policies & Procedures - Principle:561.21    Principle \tThe scope of the pharmaceutical  service shall be consistent with the  medication needs of the patients and congruent with the licensed classification of the ASF. The  pharmaceutical policies shall include  a program for the control and accountability of drug products  throughout the ASF. If drugs are used for experimental purpose, the use thereof shall be approved by an Institutional Review Board (IRB) or an IRB shall waive review and proper consent for use shall be obtained.Observations:Based on review of facility policy and procedures, review of facility documents and interview with staff (EMP), it was determined the facility failed to follow its own established policy regarding the control and documentation of controlled substances (narcotics) used in the facility.  Findings include:Review of the facility policy  \"Narcotic Count\"  revised February 2019 revealed \"...At the beginning of each shift the Registered Nurse assigned to Pre-op/Recovery Room will perform a narcotic count with another Registered Nurse and record its accuracy in the narcotic book.  Signatures of both nurses will be placed on the narcotic count sheet to indicate [the] narcotic count [is] correct ...A narcotic count will be performed again at the end of each working day by two Registered Nurses.  Signatures by both nurses will be placed on the narcotic count sheet to indicate [the] narcotic count [is] correct ...There are two narcotic lockers, anesthesia workroom and recovery room.  Counts for these will be maintained separately for each unit ...\"Review on November 1, 2023, of facility document, Abington Surgical Center Anesthesia Inventory dated October 4, 2023, revealed, no registered nurse signatures on the documentation, further review revealed no delineation of which shift the narcotic count was performed.Review on November 1, 2023, of facility document, Abington Surgical Center Anesthesia Inventory dated October 5, 2023, revealed, no registered nurse signatures on the documentation, further review revealed no delineation of which shift the narcotic count was performed.  Review on November 1, 2023, of facility document, Abington Surgical Center Anesthesia Inventory dated October 6, 2023, revealed, no registered nurse signatures on the documentation, further review revealed no delineation of which shift the narcotic count was performed.  Review on November 1, 2023, of facility document, Abington Surgical Center Anesthesia Inventory dated October 12, 2023, revealed, no registered nurse signatures on the documentation, further review revealed no delineation of which shift the narcotic count was performed.  Review on November 1, 2023, of facility document, Abington Surgical Center Anesthesia Inventory dated October 13, 2023, revealed, no registered nurse signatures on the documentation, further review revealed no delineation of which shift the narcotic count was performed.  Interview with EMP1 on November 1, 2023, at 1:34 PM, confirmed the Anesthesia Inventory facility documentation is missing two registered nurse's signatures for the dates reviewed above.   Further interview with EMP1 confirmed there is no documentation delineating which shift each narcotic count was performed for the dates reviewed.  ______________________________________________________________________Based on review of facility policy and procedures, review of facility documents and interview with staff (EMP), it was determined the facility failed to follow its own established policy regarding the control and documentation of controlled substances (narcotics) used in the facility.  Findings include:Review of the facility policy  \"Controlled Substance-Dispensing, Storage, control and documentation\"  dated September 2015 revealed  \"An anesthesia box is signed out each day by the CRNA[certified registered nurse anesthetist] ...The documentation includes: the signature of the anesthetist returning the box and the signature of the anesthetist witnessing the count of the narcotics ...\"Review on November 1, 2023, of facility document,  \"Anesthesia Box Sign-Out\"  dated September 6, 2023, revealed, no signature in the  \"returned by:\"  section for box numbers seven (7), nine (9), and 12.Review on November 1, 2023, of facility document,  \"Anesthesia Box Sign-Out\"  dated September 7, 2023, revealed, no signature in the  \"returned by:\"  section for box number four (4).Review on November 1, 2023, of facility document,  \"Anesthesia Box\"  Sign-Out dated September 8, 2023, revealed, no signature in the  \"returned by:\"  section for box number 12.Review on November 1, 2023, of facility document,  \"Anesthesia Box Sign-Out\"  dated September 11, 2023, revealed, no signature in the  \"returned by:\"  section for box numbers one (1), and three (3).Review on November 1, 2023, of facility document,  \"Anesthesia Box Sign-Out\"  dated September 13, 2023, revealed, no signature in the  \"returned by:\"  section for box numbers five (5), and seven (7).Interview with EMP1 on November 1, 2023, at 1:36 PM, confirmed the missing signatures on the facility documents  \"Anesthesia Box Sign-Out\"  for the dates reviewed.   Plan of Correction - To be completed: 12/20/2023The Narcotic Count policy has been updated to include the narcotic count in the anesthesia workroom/pharmacy. The update includes:  Every work day the narcotic inventory in the anesthesia workroom/pharmacy will be counted twice. An initial count of the inventory in the narcotic locker will be done with two licensed professionals to assure accuracy of the Anesthesia Inventory worksheet. Signatures of both licensed professionals will be placed on the new monthly initial anesthesia inventory worksheet.The anesthesia boxes will be replenished as needed by the pharmacist or a designee and a balance of the narcotic inventory will be recorded on both the new monthly initial anesthesia worksheet inventory form and the anesthesia worksheet inventory.  Signature lines were added to the anesthesia inventory worksheet.A second count of the narcotic locker will be done with two licensed professionals to assure accuracy of the narcotic balance on anesthesia inventory worksheet. Signatures of both licensed professionals will be placed on the anesthesia inventory worksheet to assure accuracy.Two signatures of licensed professionals are required on both the monthly initial anesthesia narcotic inventory sheet and the anesthesia inventory forms. The director of nursing will audit both forms for correctness for 30 days using an anesthesia inventory audit form.  The plan of correction will be completed by 12/20/2023The executive director, director of nursing and the pharmacist are responsible for these corrections.  This deficiency and plan of correction will be reported to the patient safety committee and the board of director.Plan of Correction Part II:The anesthesia providers have been re-educated on the \"Controlled Substance-Dispensing, Storage, control and documentation\" policy and the need to both sign their anesthesia boxes out and in, and to have their count witnessed.The pharmacy director or designee will confirm on a daily basis that the boxes were properly signed out and in.The director of nursing will audit for correctness for 30 days using an anesthesia box sign out/in audit form.The plan of correction will be completed by 12/20/2023The executive director, director of nursing and the pharmacist are responsible for these corrections.  This deficiency and plan of correction will be reported to the patient safety committee and the board of director. 561.21 LICENSURE Policies & Procedures - Principle: 561.21    Principle \tThe scope of the pharmaceutical  service shall be consistent with the  medication needs of the patients and congruent with the licensed classification of the ASF. The  pharmaceutical policies shall include  a program for the control and accountability of drug products  throughout the ASF. If drugs are used for experimental purpose, the use thereof shall be approved by an Institutional Review Board (IRB) or an IRB shall waive review and proper consent for use shall be obtained. Observations:Based on review of facility policy and procedures, review of facility documents and interview with staff (EMP), it was determined the facility failed to follow its own established policy regarding the control and documentation of controlled substances (narcotics) used in the facility.  Findings include:Review of the facility policy  \"Narcotic Count\"  revised February 2019 revealed \"...At the beginning of each shift the Registered Nurse assigned to Pre-op/Recovery Room will perform a narcotic count with another Registered Nurse and record its accuracy in the narcotic book.  Signatures of both nurses will be placed on the narcotic count sheet to indicate [the] narcotic count [is] correct ...A narcotic count will be performed again at the end of each working day by two Registered Nurses.  Signatures by both nurses will be placed on the narcotic count sheet to indicate [the] narcotic count [is] correct ...There are two narcotic lockers, anesthesia workroom and recovery room.  Counts for these will be maintained separately for each unit ...\"Review on November 1, 2023, of facility document, Abington Surgical Center Anesthesia Inventory dated October 4, 2023, revealed, no registered nurse signatures on the documentation, further review revealed no delineation of which shift the narcotic count was performed.Review on November 1, 2023, of facility document, Abington Surgical Center Anesthesia Inventory dated October 5, 2023, revealed, no registered nurse signatures on the documentation, further review revealed no delineation of which shift the narcotic count was performed.  Review on November 1, 2023, of facility document, Abington Surgical Center Anesthesia Inventory dated October 6, 2023, revealed, no registered nurse signatures on the documentation, further review revealed no delineation of which shift the narcotic count was performed.  Review on November 1, 2023, of facility document, Abington Surgical Center Anesthesia Inventory dated October 12, 2023, revealed, no registered nurse signatures on the documentation, further review revealed no delineation of which shift the narcotic count was performed.  Review on November 1, 2023, of facility document, Abington Surgical Center Anesthesia Inventory dated October 13, 2023, revealed, no registered nurse signatures on the documentation, further review revealed no delineation of which shift the narcotic count was performed.  Interview with EMP1 on November 1, 2023, at 1:34 PM, confirmed the Anesthesia Inventory facility documentation is missing two registered nurse's signatures for the dates reviewed above.   Further interview with EMP1 confirmed there is no documentation delineating which shift each narcotic count was performed for the dates reviewed.  ______________________________________________________________________Based on review of facility policy and procedures, review of facility documents and interview with staff (EMP), it was determined the facility failed to follow its own established policy regarding the control and documentation of controlled substances (narcotics) used in the facility.  Findings include:Review of the facility policy  \"Controlled Substance-Dispensing, Storage, control and documentation\"  dated September 2015 revealed  \"An anesthesia box is signed out each day by the CRNA[certified registered nurse anesthetist] ...The documentation includes: the signature of the anesthetist returning the box and the signature of the anesthetist witnessing the count of the narcotics ...\"Review on November 1, 2023, of facility document,  \"Anesthesia Box Sign-Out\"  dated September 6, 2023, revealed, no signature in the  \"returned by:\"  section for box numbers seven (7), nine (9), and 12.Review on November 1, 2023, of facility document,  \"Anesthesia Box Sign-Out\"  dated September 7, 2023, revealed, no signature in the  \"returned by:\"  section for box number four (4).Review on November 1, 2023, of facility document,  \"Anesthesia Box\"  Sign-Out dated September 8, 2023, revealed, no signature in the  \"returned by:\"  section for box number 12.Review on November 1, 2023, of facility document,  \"Anesthesia Box Sign-Out\"  dated September 11, 2023, revealed, no signature in the  \"returned by:\"  section for box numbers one (1), and three (3).Review on November 1, 2023, of facility document,  \"Anesthesia Box Sign-Out\"  dated September 13, 2023, revealed, no signature in the  \"returned by:\"  section for box numbers five (5), and seven (7).Interview with EMP1 on November 1, 2023, at 1:36 PM, confirmed the missing signatures on the facility documents  \"Anesthesia Box Sign-Out\"  for the dates reviewed.   Plan of Correction - To be completed: 12/20/2023The Narcotic Count policy has been updated to include the narcotic count in the anesthesia workroom/pharmacy. The update includes:  Every work day the narcotic inventory in the anesthesia workroom/pharmacy will be counted twice. An initial count of the inventory in the narcotic locker will be done with two licensed professionals to assure accuracy of the Anesthesia Inventory worksheet. Signatures of both licensed professionals will be placed on the new monthly initial anesthesia inventory worksheet.The anesthesia boxes will be replenished as needed by the pharmacist or a designee and a balance of the narcotic inventory will be recorded on both the new monthly initial anesthesia worksheet inventory form and the anesthesia worksheet inventory.  Signature lines were added to the anesthesia inventory worksheet.A second count of the narcotic locker will be done with two licensed professionals to assure accuracy of the narcotic balance on anesthesia inventory worksheet. Signatures of both licensed professionals will be placed on the anesthesia inventory worksheet to assure accuracy.Two signatures of licensed professionals are required on both the monthly initial anesthesia narcotic inventory sheet and the anesthesia inventory forms. The director of nursing will audit both forms for correctness for 30 days using an anesthesia inventory audit form.  The plan of correction will be completed by 12/20/2023The executive director, director of nursing and the pharmacist are responsible for these corrections.  This deficiency and plan of correction will be reported to the patient safety committee and the board of director.Plan of Correction Part II:The anesthesia providers have been re-educated on the \"Controlled Substance-Dispensing, Storage, control and documentation\" policy and the need to both sign their anesthesia boxes out and in, and to have their count witnessed.The pharmacy director or designee will confirm on a daily basis that the boxes were properly signed out and in.The director of nursing will audit for correctness for 30 days using an anesthesia box sign out/in audit form.The plan of correction will be completed by 12/20/2023The executive director, director of nursing and the pharmacist are responsible for these corrections.  This deficiency and plan of correction will be reported to the patient safety committee and the board of director. 561.22 (a) LICENSURE Records:561.22   Records \t(a) Drug transactions of the pharmaceutical service shall be recorded, and those records shall be correlated with other ASF records. Records and security shall be maintained to assure the control and safe dispensing and compliance with Federal and Commonwealth statutes.Observations:Based on observation, review of policy and procedures, facility documents, and interview with staff (EMP), it was determined the facility failed to monitor and document controls governing the handling, control, and safe dispensing of controlled substances used at Abington Surgical Center.  Findings include:Review on November 1, 2023, of facility policy \"Controlled Substance-Dispensing, Storage, control and documentation\" dated September 2015, reveled  \"...Issuance of controlled substances: 1.  The anesthesia boxes will be checked and refilled on a regular basis by the Registered Pharmacist or designee.  The Daily Patient Record for Controlled Drugs will be reviewed for completeness and kept on file.  There will be a random audit assuring the drugs listed on the Daily Record for Controlled Drugs matches the drugs listed on the patient anesthesia record ...\"A request was made on November 1, 2023, at 1:25 PM to EMP1 for the random audit logs for anesthesia's controlled drugs used verses the patient's anesthesia record.  None provided.Phone interview on November 6, 2023, at 9:14 AM with EMP2 confirmed there is no documentation of random audits for controlled drugs used in the facility. Plan of Correction - To be completed: 12/20/2023The director of nursing and the pharmacist were re-educated on the Controlled Substance-Dispensing, Storage, control and documentation policy and the need to conduct random audits for controlled substance and documentation.The monthly audit sheet requires two signatures and the results of the audits will be reported to the patient safety committee quarterly.The director of nursing will audit for correctness for 30 days using the controlled substance audit audit form.The plan of correction will be completed by 12/20/2023The executive director, director of nursing and the pharmacist are responsible for these corrections.  This deficiency and plan of correction will be reported to the patient safety committee and the board of director. 561.22 (a) LICENSURE Records: 561.22   Records \t(a) Drug transactions of the pharmaceutical service shall be recorded, and those records shall be correlated with other ASF records. Records and security shall be maintained to assure the control and safe dispensing and compliance with Federal and Commonwealth statutes. Observations:Based on observation, review of policy and procedures, facility documents, and interview with staff (EMP), it was determined the facility failed to monitor and document controls governing the handling, control, and safe dispensing of controlled substances used at Abington Surgical Center.  Findings include:Review on November 1, 2023, of facility policy \"Controlled Substance-Dispensing, Storage, control and documentation\" dated September 2015, reveled  \"...Issuance of controlled substances: 1.  The anesthesia boxes will be checked and refilled on a regular basis by the Registered Pharmacist or designee.  The Daily Patient Record for Controlled Drugs will be reviewed for completeness and kept on file.  There will be a random audit assuring the drugs listed on the Daily Record for Controlled Drugs matches the drugs listed on the patient anesthesia record ...\"A request was made on November 1, 2023, at 1:25 PM to EMP1 for the random audit logs for anesthesia's controlled drugs used verses the patient's anesthesia record.  None provided.Phone interview on November 6, 2023, at 9:14 AM with EMP2 confirmed there is no documentation of random audits for controlled drugs used in the facility. Plan of Correction - To be completed: 12/20/2023The director of nursing and the pharmacist were re-educated on the Controlled Substance-Dispensing, Storage, control and documentation policy and the need to conduct random audits for controlled substance and documentation.The monthly audit sheet requires two signatures and the results of the audits will be reported to the patient safety committee quarterly.The director of nursing will audit for correctness for 30 days using the controlled substance audit audit form.The plan of correction will be completed by 12/20/2023The executive director, director of nursing and the pharmacist are responsible for these corrections.  This deficiency and plan of correction will be reported to the patient safety committee and the board of director. 567.41 LICENSURE MAINTENANCE SERVICE - Principle:567.41   Principle  \tThe ASF shall be equipped, operated and maintained to sustain its safe and sanitary characteristics and to minimize health hazards in the ASF for the protection of patients and employes.Observations:Based on observation, review of facility policies and procedures and interview with staff (EMP), it was determined the facility failed to maintain a safe and sanitary environment.Findings include:A tour on November 1, 2023, at 1:30 PM, of operating room number two (2) revealed, on the ceiling above the patient operating table, on the painted metal HVAC (heating, ventilation, and air conditioning) ventilation outlet, a reddish brown discoloration area approximately seven (7) inches long by two (2) inches wide. Review on November 1, 2023, of facility policy and procedure,  \"Environmental Cleaning in the Surgical Setting\" reviewed March 2019 revealed,  \"It is the policy of the Abington Surgical Center to provide a clean environment for surgical patients to minimize and prevent the staff and patient's exposure to any potentially infectious organism ...3. Visual Inspection of all surfaces and equipment is done prior to each procedure performed ...Any surfaces visibly soiled such as walls doors, lights, and ceiling should be spot cleaned as necessary ...Walls, flat surfaces, equipment, [and] floors are cleaned appropriately... \"An interview conducted on November 1, 2023, at 1:35 PM with EMP1 confirmed the reddish brown discoloration on the ceiling and also confirmed it should have been cleaned off.  Further interview revealed the facility did not follow its own established policy and procedure regarding environmental cleaning.   Plan of Correction - To be completed: 12/20/2023The facilities director contacted the cleaning service to clean the ceiling vents.  The discoloration on the ceiling will also be cleaned.  If cleaning does not correct the issue it will be painted.The center will contract with the cleaning service to clean the ceiling and ceiling vents on a monthly basis.The facilities director will be responsible for monitoring the cleanliness of the ceiling and ceiling vents.  The facilities director will audit the cleanliness of the ceiling and ceiling vents on a weekly basis for four weeks.    The plan of correction will be completed by 12/20/2023The executive director and facilities director are responsible for these corrections.  This deficiency and plan of correction will be reported to the patient safety committee and the board of directors. 567.41 LICENSURE MAINTENANCE SERVICE - Principle: 567.41   Principle  \tThe ASF shall be equipped, operated and maintained to sustain its safe and sanitary characteristics and to minimize health hazards in the ASF for the protection of patients and employes. Observations:Based on observation, review of facility policies and procedures and interview with staff (EMP), it was determined the facility failed to maintain a safe and sanitary environment.Findings include:A tour on November 1, 2023, at 1:30 PM, of operating room number two (2) revealed, on the ceiling above the patient operating table, on the painted metal HVAC (heating, ventilation, and air conditioning) ventilation outlet, a reddish brown discoloration area approximately seven (7) inches long by two (2) inches wide. Review on November 1, 2023, of facility policy and procedure,  \"Environmental Cleaning in the Surgical Setting\" reviewed March 2019 revealed,  \"It is the policy of the Abington Surgical Center to provide a clean environment for surgical patients to minimize and prevent the staff and patient's exposure to any potentially infectious organism ...3. Visual Inspection of all surfaces and equipment is done prior to each procedure performed ...Any surfaces visibly soiled such as walls doors, lights, and ceiling should be spot cleaned as necessary ...Walls, flat surfaces, equipment, [and] floors are cleaned appropriately... \"An interview conducted on November 1, 2023, at 1:35 PM with EMP1 confirmed the reddish brown discoloration on the ceiling and also confirmed it should have been cleaned off.  Further interview revealed the facility did not follow its own established policy and procedure regarding environmental cleaning.   Plan of Correction - To be completed: 12/20/2023The facilities director contacted the cleaning service to clean the ceiling vents.  The discoloration on the ceiling will also be cleaned.  If cleaning does not correct the issue it will be painted.The center will contract with the cleaning service to clean the ceiling and ceiling vents on a monthly basis.The facilities director will be responsible for monitoring the cleanliness of the ceiling and ceiling vents.  The facilities director will audit the cleanliness of the ceiling and ceiling vents on a weekly basis for four weeks.    The plan of correction will be completed by 12/20/2023The executive director and facilities director are responsible for these corrections.  This deficiency and plan of correction will be reported to the patient safety committee and the board of directors."
        },
        {
            "eventid": "I9HX11",
            "date": "11/1/2023",
            "data": "Initial comments:This report is the result of an offsite occupancy survey conducted on November 1, 2023, at Abington Surgical Center, which included new equipment, nerve monitoring system.  Based on the occupancy survey, it was determined the facility was in compliance with all applicable requirements of the Pennsylvania Department of Health's Rules and Regulations for Ambulatory Care Facilities, Annex A, Title 28, Part IV, Subparts A and F, Chapters 551-573, November 1999 and the current edition of the Guidelines for Design and Construction of Outpatient Facilities.   Plan of Correction: Initial comments:This report is the result of an offsite occupancy survey conducted on November 1, 2023, at Abington Surgical Center, which included new equipment, nerve monitoring system.  Based on the occupancy survey, it was determined the facility was in compliance with all applicable requirements of the Pennsylvania Department of Health's Rules and Regulations for Ambulatory Care Facilities, Annex A, Title 28, Part IV, Subparts A and F, Chapters 551-573, November 1999 and the current edition of the Guidelines for Design and Construction of Outpatient Facilities.   Plan of Correction:"
        },
        {
            "eventid": "443O11",
            "date": "9/29/2023",
            "data": "Initial comments:This report is the result of an off-site special monitoring survey completed on September 29, 2023, at Abington Surgical Center.  It was determined the facility was not in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Ambulatory Care Facilities, Annex A, Title 28, Part IV, Subparts A and F, Chapters 551-573, November 1999. Plan of Correction: Initial comments:This report is the result of an off-site special monitoring survey completed on September 29, 2023, at Abington Surgical Center.  It was determined the facility was not in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Ambulatory Care Facilities, Annex A, Title 28, Part IV, Subparts A and F, Chapters 551-573, November 1999. Plan of Correction: 51.3 (d) LICENSURE Notification:51.3 Notification (d) A health care facility shall submit to the Department architectural plans and blueprints of proposed new  construction, alteration or renovation to the facility. This material shall be submitted at least 60 days before  the initiation of construction,  alteration or renovation.  The Department will review these documents to assure compliance with  relevant life safety code and other regulatory requirements.  The Department will respond to the facility by either issuing an approval or disapproval or requesting further  information with 45 days of receipt of  the facility's submission. The  facility may not initiate construction, alteration, renovation  until it has received an approval from the Department.Observations:Based on, facility documents, and interview with staff (EMP), it was determined the facility failed to notify the Department in writing at least 60 days prior any proposed, alteration or renovation to or within the facility. Review on September 29, 2023 of facility document email from EMP1 dated July 27, 2023 at 1:43 PM revealed,  \"...We recently discovered an underground drainage pipe is leaking.  We are shutting the Center down again to do the repair as this is not a repair that can be made when the Center is open.  We are closing the Center on July 31st and August 1st for this work to be completed ...\"Review on September 29, 2023 of facility document email from EMP1 dated August 14, 2023 at 1:34 PM revealed images of the alterations to the facility, which included the area directly next to the operating/procedure rooms.  The alterations included:  removal of the scrub sink, a section of the concrete floor was removed, a trench was dug, and an old pipe was removed.  Phone interview with EMP1 on July 27, 2023, at approximately 3:00 PM confirmed the facility did not notify the Department in writing 60 days prior to the proposed renovations.  Phone interview with EMP2 on September 29, 2023, at 2:16 PM confirmed the facility began procedures on August 2, 2023 after the renovations were completed on August 1, 2023.   Plan of Correction - To be completed: 11/03/2023The executive director reviewed and revised the policy for PA DOH Notification Requirements to include all elements from the PA DOH Division of Acute and Ambulatory Care notification guidance.   This updated policy was shared with the facility leadership team.  Additionally, this updated notification policy will be discussed at the patient safety committee meeting and will be included in the minutes of that meeting.  To ensure compliance with the Notification policy, for the months of October, November and December 2023 the Executive Director will audit any scheduled events that require notification to ensure that the notifications have been made within the correct timeframe.  100% compliance is expected.   Audit results will be shared with the patient safety committee.  To ensure ongoing compliance, the Executive Director will monitor the status of any event that requires notification.  The monitoring will include the description of the event and the date the notifications are sent.This plan of correction will be shared with the patient safety committee and the Board of Director. 51.3 (d) LICENSURE Notification: 51.3 Notification (d) A health care facility shall submit to the Department architectural plans and blueprints of proposed new  construction, alteration or renovation to the facility. This material shall be submitted at least 60 days before  the initiation of construction,  alteration or renovation.  The Department will review these documents to assure compliance with  relevant life safety code and other regulatory requirements.  The Department will respond to the facility by either issuing an approval or disapproval or requesting further  information with 45 days of receipt of  the facility's submission. The  facility may not initiate construction, alteration, renovation  until it has received an approval from the Department. Observations:Based on, facility documents, and interview with staff (EMP), it was determined the facility failed to notify the Department in writing at least 60 days prior any proposed, alteration or renovation to or within the facility. Review on September 29, 2023 of facility document email from EMP1 dated July 27, 2023 at 1:43 PM revealed,  \"...We recently discovered an underground drainage pipe is leaking.  We are shutting the Center down again to do the repair as this is not a repair that can be made when the Center is open.  We are closing the Center on July 31st and August 1st for this work to be completed ...\"Review on September 29, 2023 of facility document email from EMP1 dated August 14, 2023 at 1:34 PM revealed images of the alterations to the facility, which included the area directly next to the operating/procedure rooms.  The alterations included:  removal of the scrub sink, a section of the concrete floor was removed, a trench was dug, and an old pipe was removed.  Phone interview with EMP1 on July 27, 2023, at approximately 3:00 PM confirmed the facility did not notify the Department in writing 60 days prior to the proposed renovations.  Phone interview with EMP2 on September 29, 2023, at 2:16 PM confirmed the facility began procedures on August 2, 2023 after the renovations were completed on August 1, 2023.   Plan of Correction - To be completed: 11/03/2023The executive director reviewed and revised the policy for PA DOH Notification Requirements to include all elements from the PA DOH Division of Acute and Ambulatory Care notification guidance.   This updated policy was shared with the facility leadership team.  Additionally, this updated notification policy will be discussed at the patient safety committee meeting and will be included in the minutes of that meeting.  To ensure compliance with the Notification policy, for the months of October, November and December 2023 the Executive Director will audit any scheduled events that require notification to ensure that the notifications have been made within the correct timeframe.  100% compliance is expected.   Audit results will be shared with the patient safety committee.  To ensure ongoing compliance, the Executive Director will monitor the status of any event that requires notification.  The monitoring will include the description of the event and the date the notifications are sent.This plan of correction will be shared with the patient safety committee and the Board of Director."
        },
        {
            "eventid": "4R3812",
            "date": "8/22/2023",
            "data": "Initial comments:This report is the result of an unannounced off-site revisit survey initiated on August 21, 2023, and completed on August 22, 2023, following a State Licensure survey completed on December 8, 2022, at Abington Surgical Center.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Ambulatory Care Facilities, Annex A, Title 28, Part IV, Subparts A and F, Chapters 551-573, November 1999. Plan of Correction: Initial comments:This report is the result of an unannounced off-site revisit survey initiated on August 21, 2023, and completed on August 22, 2023, following a State Licensure survey completed on December 8, 2022, at Abington Surgical Center.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Ambulatory Care Facilities, Annex A, Title 28, Part IV, Subparts A and F, Chapters 551-573, November 1999. Plan of Correction:"
        },
        {
            "eventid": "OYLK11",
            "date": "3/22/2023",
            "data": "Initial comments:This report is the result of an unannounced onsite complaint investigation CHL23075V initiated on March 17, 2023, and completed off-site on March 22, 2023, at Abington Surgical Center.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Ambulatory Care Facilities, Annex A, Title 28, Part IV, Subparts A and F, Chapters 551-573, November 1999. Plan of Correction: Initial comments:This report is the result of an unannounced onsite complaint investigation CHL23075V initiated on March 17, 2023, and completed off-site on March 22, 2023, at Abington Surgical Center.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Ambulatory Care Facilities, Annex A, Title 28, Part IV, Subparts A and F, Chapters 551-573, November 1999. Plan of Correction:"
        }
    ]
}