{
    "facility": "HELEN M. SIMPSON REHABILITATION HOSPITAL",
    "data": [
        {
            "eventid": "P61K12",
            "date": "1/3/2024",
            "data": "Initial comments:This report is the result of a follow up survey conducted on January 3, 2024, with Helen M. Simpson Rehabilitation Hospital, as the result of a previous special monitoring survey that was conducted on December 1, 2023.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 1998.   Plan of Correction: Initial comments:This report is the result of a follow up survey conducted on January 3, 2024, with Helen M. Simpson Rehabilitation Hospital, as the result of a previous special monitoring survey that was conducted on December 1, 2023.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 1998.   Plan of Correction:"
        },
        {
            "eventid": "3M6N11",
            "date": "12/1/2023",
            "data": "Initial comments:This report is the result of an occupancy survey conducted on November 28, 2023, at Helen M. Simpson Rehabilitation Hospital which included the removal of the old flooring, cove and base. The original flooring was replaced with hospital-grade LVT. The work was done over 16 phases to include all areas of the 2nd floor. Based on the occupancy survey, it was determined the facility was in compliance with all applicable requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998 and the current edition of the Guidelines for Design and Construction of Hospital and Health Care Facilities.  Plan of Correction: Initial comments:This report is the result of an occupancy survey conducted on November 28, 2023, at Helen M. Simpson Rehabilitation Hospital which included the removal of the old flooring, cove and base. The original flooring was replaced with hospital-grade LVT. The work was done over 16 phases to include all areas of the 2nd floor. Based on the occupancy survey, it was determined the facility was in compliance with all applicable requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998 and the current edition of the Guidelines for Design and Construction of Hospital and Health Care Facilities.  Plan of Correction:"
        },
        {
            "eventid": "P61K11",
            "date": "12/1/2023",
            "data": "Initial comments:This report is the result of an unannounced onsite special monitoring investigation completed on December 1, 2023, at  Helen M. Simpson Hospital.  It was determined that the facility was not in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced onsite special monitoring investigation completed on December 1, 2023, at  Helen M. Simpson Hospital.  It was determined that the facility was not in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: 51.3 (d) LICENSURE NOTIFICATION:51.3 Notification (d) A health care facility shall  \nsubmit to the Department architectural  \nplans and blueprints of proposed new  \nconstruction, alteration or renovation  \nto the facility. This material shall  \nbe submitted at least 60 days before  \nthe initiation of construction,  \nalteration or renovation.  The Department will review these  \ndocuments to assure compliance with  \nrelevant life safety code and other  \nregulatory requirements.  The Department will respond to the  \nfacility by either issuing an approval  \nor disapproval or requesting further  \ninformation with 45 days of receipt of  \nthe facility's submission.  The facility may not initiate  \nconstruction, alteration, renovation  \nuntil it has received an approval from  \nthe Department.Observations:Based on review of documents, observation, and staff interview (EMP), it was determined that the facility failed to provide the Department a 60-day notification for renovations to the facility.Findings Include:On October 25, 2023, during an onsite revisit a renovation sign was observed at the entrance with instructions on how to enter facility at a different location.During interview with EMP1 on October 25, 2023, EMP1 confirmed the facility was replacing the flooring.On October 25, 2023, a 60-day notice was requested from the facility for the renovation since none had been provided prior to the observation.Tour of facility on November 28, 2023, revealed the flooring of almost the entire facility had been replaced and was in use by the facility.  The Department still had not received a 60-day notification.On December 1, 2023, review of facility document \"Infection Control Construction Permit\" signed August 10, 2023, revealed \"Project Start Date September 11, 2023; Estimated Duration 60 days; Permit Expiration Date November 30, 2023.\"On December 1, 2023, review of facility document \"Flooring Narrative\" revealed \"This project narrative covers a floor refresh in the Helen M Simpson Rehabilitation Hospital inside OTH1, 4300 Londonderry Road, Harrisburg, PA 17109. The flooring refresh project ran from 9/11/23 - 11/17/23. The work included the removal of the old flooring and cove base and the replacement of the original flooring with hospital-grade LVT. The work was done over 16 phases to include all areas of the 2nd floor ... The project was estimated to last about 72 days although work was completed in 67 days on 11/17/23.\"Interview with EMP1 on November 28, 2023, EMP1 confirmed the facility renovation was completed without providing the Department a 60-day notification. Plan of Correction - To be completed: 12/14/2023To ensure compliance with PA 51.3 Licensure Notification (d), specifically, that the facility will provide the Department a 60 notification for all renovations, the Director of Quality Management (DQM), or designee, will take the following actions: 1.\tProvide education to leaders responsible for initiating and planning construction projects that the Department must be notified at least 60 days before the initiation of any facility renovations. DQM should be involved from the beginning of the projects. Education will be completed no later than 12/12/23.   Compliance with the above plan will be managed by the DQM, or designee, as follows:1.\tConfirm and submit Department notifications for all upcoming renovation projects at least 60 days in advance.  2.\tReport on Department notifications for any upcoming renovation projects monthly to the Quality and Safety Committee and Medical Executive Committee and quarterly to the Governing Board. The Director of Quality is ultimately responsible for ensuring the plan of correction is implemented and that compliance is achieved and maintained.The hospital will be in full compliance with the above date by 12/14/23. 51.3 (d) LICENSURE NOTIFICATION: 51.3 Notification (d) A health care facility shall  \nsubmit to the Department architectural  \nplans and blueprints of proposed new  \nconstruction, alteration or renovation  \nto the facility. This material shall  \nbe submitted at least 60 days before  \nthe initiation of construction,  \nalteration or renovation.  The Department will review these  \ndocuments to assure compliance with  \nrelevant life safety code and other  \nregulatory requirements.  The Department will respond to the  \nfacility by either issuing an approval  \nor disapproval or requesting further  \ninformation with 45 days of receipt of  \nthe facility's submission.  The facility may not initiate  \nconstruction, alteration, renovation  \nuntil it has received an approval from  \nthe Department. Observations:Based on review of documents, observation, and staff interview (EMP), it was determined that the facility failed to provide the Department a 60-day notification for renovations to the facility.Findings Include:On October 25, 2023, during an onsite revisit a renovation sign was observed at the entrance with instructions on how to enter facility at a different location.During interview with EMP1 on October 25, 2023, EMP1 confirmed the facility was replacing the flooring.On October 25, 2023, a 60-day notice was requested from the facility for the renovation since none had been provided prior to the observation.Tour of facility on November 28, 2023, revealed the flooring of almost the entire facility had been replaced and was in use by the facility.  The Department still had not received a 60-day notification.On December 1, 2023, review of facility document \"Infection Control Construction Permit\" signed August 10, 2023, revealed \"Project Start Date September 11, 2023; Estimated Duration 60 days; Permit Expiration Date November 30, 2023.\"On December 1, 2023, review of facility document \"Flooring Narrative\" revealed \"This project narrative covers a floor refresh in the Helen M Simpson Rehabilitation Hospital inside OTH1, 4300 Londonderry Road, Harrisburg, PA 17109. The flooring refresh project ran from 9/11/23 - 11/17/23. The work included the removal of the old flooring and cove base and the replacement of the original flooring with hospital-grade LVT. The work was done over 16 phases to include all areas of the 2nd floor ... The project was estimated to last about 72 days although work was completed in 67 days on 11/17/23.\"Interview with EMP1 on November 28, 2023, EMP1 confirmed the facility renovation was completed without providing the Department a 60-day notification. Plan of Correction - To be completed: 12/14/2023To ensure compliance with PA 51.3 Licensure Notification (d), specifically, that the facility will provide the Department a 60 notification for all renovations, the Director of Quality Management (DQM), or designee, will take the following actions: 1.\tProvide education to leaders responsible for initiating and planning construction projects that the Department must be notified at least 60 days before the initiation of any facility renovations. DQM should be involved from the beginning of the projects. Education will be completed no later than 12/12/23.   Compliance with the above plan will be managed by the DQM, or designee, as follows:1.\tConfirm and submit Department notifications for all upcoming renovation projects at least 60 days in advance.  2.\tReport on Department notifications for any upcoming renovation projects monthly to the Quality and Safety Committee and Medical Executive Committee and quarterly to the Governing Board. The Director of Quality is ultimately responsible for ensuring the plan of correction is implemented and that compliance is achieved and maintained.The hospital will be in full compliance with the above date by 12/14/23."
        },
        {
            "eventid": "VRS611",
            "date": "11/29/2023",
            "data": "Initial comments:This report is the result of an unannounced  complaint investigation (CHL23C797H) completed on November 29, 2023, at Helen M. Simpson Rehabilitation Hospital. It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998..   Plan of Correction: Initial comments:This report is the result of an unannounced  complaint investigation (CHL23C797H) completed on November 29, 2023, at Helen M. Simpson Rehabilitation Hospital. It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998..   Plan of Correction:"
        },
        {
            "eventid": "JDFI12",
            "date": "10/25/2023",
            "data": "Initial comments:This report is the result of a revisit survey conducted on October 25, 2023, at Helen M. Simpson Rehabilitation Hospital as the result of a previous complaint survey that was conducted on July 25, 2023.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 1998.   Plan of Correction: Initial comments:This report is the result of a revisit survey conducted on October 25, 2023, at Helen M. Simpson Rehabilitation Hospital as the result of a previous complaint survey that was conducted on July 25, 2023.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 1998.   Plan of Correction:"
        },
        {
            "eventid": "JDFI11",
            "date": "7/25/2023",
            "data": "Initial comments:This report is the result of an unannounced  complaint investigation CHL23C368H completed on July 25, 2023, at Helen Simpson Rehabilitation Hospital.  It was determined that the facility was not in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced  complaint investigation CHL23C368H completed on July 25, 2023, at Helen Simpson Rehabilitation Hospital.  It was determined that the facility was not in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: 103.22 (b)(7) LICENSURE IMPLEMENTATION: (7) The patient has the right to \ngood quality care and high \nprofessional standards that are \ncontinually maintained and reviewed.Observations:Based on review of facility documents, medical records (MR) and staff interview (EMP), it was determined that the facility failed to ensure a pressure injury was prevented by turning and repositioning a patient with mobility deficit every two hours, per policy, in one of one MR reviewed (MR1).On July 3, 2023, review of facility policy \"Pressure Injury Prevention\" issued April 1, 2023, revealed, \"Definition: The injury occurs as a result of intense and/or prolonged pressure, or pressure in combination with shear. The tolerance of soft tissue for pressure and shear may also be affected by microclimate, nutrition, perfusion, co-morbidities and condition of the soft tissue.  Prevention interventions should focus on minimizing pressure, reducing friction and shear, and managing incontinence and skin moisture. Each of the major risk factors should be addressed. The major risk factors include: 1. Mobility deficit Mobility deficit Individualize plan of care according to patient activity level. Patients that are bed bound or with limited activity should be repositioned at least every two hours.\" Review of MR1 revealed upon admission on April 11, 2023, patient was assessed by two Registered Nurses (RN's) and skin was found to be intact. Medical Issues noted the patient to have a history of multiple falls due to generalized weakness.  Physical Therapy treatment notes between April 14, 2023, and April 15, 2023, revealed the patient requires increased time and assistance due to having pain with bed mobility and transitional movements. A physical assistance level of 51%-75% was documented.  MR1 Flowsheets completed by nursing staff between April 11, 2023, and April 15, 2023, notes patient able to turn self.  No notes found indicating assistance was provided with turning or repositioning.  April 11, 2023, flowsheets note patient being in Semi-Fowler's position (lying on back with head of bed elevated 30-45 degrees) from 11:07 AM to 9:17 PM;  April 13, 2023, in Semi Fowler's position from 1:10 PM to 11:16 PM;  April 14, 2023 patient in supine postilion (lying on back) from 6:09 AM to 10:16 AM; April 15, 2023, in Semi Fowler's position 1:57 PM to 4:50PM. Further review of MR1 revealed on April 15, 2023, at 2:30 PM wound note revealed \"Pressure Injury Sacrum Posterior wound length 9 cm, Wound width 8.8 cm and wound size 79.2 cm.\"  Nursing note reveals during assessment patient found to have a dark purple open area to sacrum.  Interview with EMP1 on July 3, 2023, EMP1 confirmed all documents and information submitted is accurate. Plan of Correction - To be completed: 08/21/2023To ensure P 0352 The patient has the right to good quality care and high professional standards that are continually maintained and reviewed in accordance with WC I-1 Pressure Injury Prevention Policy the Chief Nursing Officer (CNO), or designee, will take the following steps: 1.\tProvide education to all nursing staff members on the policy to include turning and repositioning.  Education will be completed no later than 8/10/23.   As of 8/10/23 any staff that has not completed this education will do so prior to working their next scheduled shift.2.\tEnhance mattress ordering procedures to ensure all patients with Braden Scale score of 17 or lower are ordered a specialty mattress. Education provided to nursing staff for guidance on specific mattress to be ordered based on current Braden Scale score. Education performed in May 2023 following identification of opportunities internally and reinforced in August 2023, no later than 8/10/23. 3.\tEnhance monitoring procedures to ensure all patients with Braden Scale score of 17 or lower are monitored weekly and with change of condition to ensure interventions are in place as appropriate.   4.\tRegional wound nurse visit conducted to support local wound nurse by analyzing program and identifying new solutions. Regional support gave additional wound education to 2 hospital RNs to regularly assist wound nurse. Regional wound nurse visit conducted May 25-26. Compliance with the above plan will be monitored by the Chief Nursing Officer, or designee, as follows:1.\tConduct 5 patient audits per week of patient turning and repositioning documentation. 2.\tAdditional shift rounds conducted to ensure compliance with updated Braden interventions and pressure point assessments.3.\tThe audits will continue until acceptable compliance has been achieved and sustained.  The audits will be shared as a monthly report during CNO's one-on-one meetings with the CEO. The data will also be reported monthly at the Nursing Clinical Staff Meetings, Quality and Safety Committee and the Medical Executive Committee and quarterly to the Governing Board. Staff members who are noted to be non-compliant will be subject to disciplinary action, up to and including termination, per HR policies and procedures.The Chief Nursing Officer is ultimately responsible for ensuring the plan of correction is implemented and that compliance is achieved and maintained.The hospital will be in full compliance with the above date by 8/21/23.Full compliance means all action items above are complete. 103.22 (b)(7) LICENSURE IMPLEMENTATION: (7) The patient has the right to \ngood quality care and high \nprofessional standards that are \ncontinually maintained and reviewed. Observations:Based on review of facility documents, medical records (MR) and staff interview (EMP), it was determined that the facility failed to ensure a pressure injury was prevented by turning and repositioning a patient with mobility deficit every two hours, per policy, in one of one MR reviewed (MR1).On July 3, 2023, review of facility policy \"Pressure Injury Prevention\" issued April 1, 2023, revealed, \"Definition: The injury occurs as a result of intense and/or prolonged pressure, or pressure in combination with shear. The tolerance of soft tissue for pressure and shear may also be affected by microclimate, nutrition, perfusion, co-morbidities and condition of the soft tissue.  Prevention interventions should focus on minimizing pressure, reducing friction and shear, and managing incontinence and skin moisture. Each of the major risk factors should be addressed. The major risk factors include: 1. Mobility deficit Mobility deficit Individualize plan of care according to patient activity level. Patients that are bed bound or with limited activity should be repositioned at least every two hours.\" Review of MR1 revealed upon admission on April 11, 2023, patient was assessed by two Registered Nurses (RN's) and skin was found to be intact. Medical Issues noted the patient to have a history of multiple falls due to generalized weakness.  Physical Therapy treatment notes between April 14, 2023, and April 15, 2023, revealed the patient requires increased time and assistance due to having pain with bed mobility and transitional movements. A physical assistance level of 51%-75% was documented.  MR1 Flowsheets completed by nursing staff between April 11, 2023, and April 15, 2023, notes patient able to turn self.  No notes found indicating assistance was provided with turning or repositioning.  April 11, 2023, flowsheets note patient being in Semi-Fowler's position (lying on back with head of bed elevated 30-45 degrees) from 11:07 AM to 9:17 PM;  April 13, 2023, in Semi Fowler's position from 1:10 PM to 11:16 PM;  April 14, 2023 patient in supine postilion (lying on back) from 6:09 AM to 10:16 AM; April 15, 2023, in Semi Fowler's position 1:57 PM to 4:50PM. Further review of MR1 revealed on April 15, 2023, at 2:30 PM wound note revealed \"Pressure Injury Sacrum Posterior wound length 9 cm, Wound width 8.8 cm and wound size 79.2 cm.\"  Nursing note reveals during assessment patient found to have a dark purple open area to sacrum.  Interview with EMP1 on July 3, 2023, EMP1 confirmed all documents and information submitted is accurate. Plan of Correction - To be completed: 08/21/2023To ensure P 0352 The patient has the right to good quality care and high professional standards that are continually maintained and reviewed in accordance with WC I-1 Pressure Injury Prevention Policy the Chief Nursing Officer (CNO), or designee, will take the following steps: 1.\tProvide education to all nursing staff members on the policy to include turning and repositioning.  Education will be completed no later than 8/10/23.   As of 8/10/23 any staff that has not completed this education will do so prior to working their next scheduled shift.2.\tEnhance mattress ordering procedures to ensure all patients with Braden Scale score of 17 or lower are ordered a specialty mattress. Education provided to nursing staff for guidance on specific mattress to be ordered based on current Braden Scale score. Education performed in May 2023 following identification of opportunities internally and reinforced in August 2023, no later than 8/10/23. 3.\tEnhance monitoring procedures to ensure all patients with Braden Scale score of 17 or lower are monitored weekly and with change of condition to ensure interventions are in place as appropriate.   4.\tRegional wound nurse visit conducted to support local wound nurse by analyzing program and identifying new solutions. Regional support gave additional wound education to 2 hospital RNs to regularly assist wound nurse. Regional wound nurse visit conducted May 25-26. Compliance with the above plan will be monitored by the Chief Nursing Officer, or designee, as follows:1.\tConduct 5 patient audits per week of patient turning and repositioning documentation. 2.\tAdditional shift rounds conducted to ensure compliance with updated Braden interventions and pressure point assessments.3.\tThe audits will continue until acceptable compliance has been achieved and sustained.  The audits will be shared as a monthly report during CNO's one-on-one meetings with the CEO. The data will also be reported monthly at the Nursing Clinical Staff Meetings, Quality and Safety Committee and the Medical Executive Committee and quarterly to the Governing Board. Staff members who are noted to be non-compliant will be subject to disciplinary action, up to and including termination, per HR policies and procedures.The Chief Nursing Officer is ultimately responsible for ensuring the plan of correction is implemented and that compliance is achieved and maintained.The hospital will be in full compliance with the above date by 8/21/23.Full compliance means all action items above are complete."
        }
    ]
}