{
    "facility": "PENN HIGHLANDS HUNTINGDON",
    "data": [
        {
            "eventid": "1U8211",
            "date": "2/6/2024",
            "data": "Initial comments:This report is the result of a Department of Human Services, Chapter 5100 Mental Health Procedures Act Survey conducted on January 17, 2024, at Penn Highlands Huntingdon Hospital.  It was determined the facility was not in compliance with requirements of the Chapter 5100 Mental Health regulations. Plan of Correction: Initial comments:This report is the result of a Department of Human Services, Chapter 5100 Mental Health Procedures Act Survey conducted on January 17, 2024, at Penn Highlands Huntingdon Hospital.  It was determined the facility was not in compliance with requirements of the Chapter 5100 Mental Health regulations. Plan of Correction: 5100.15 (a) REQUIREMENT Treatment Plan Content and Availability:5100.15  CONTENTS OF TREATMENT PLANSActual requirement is 5100.15 (b)\t(a)  The treatment plan shall indicate what less restrictive alternatives were considered and why they were not utilized. If the plan provides for restraints, the basis for the necessity for such restraints must be stated in the plan under Chapter 13 (relating to us of restraints in treating patients/residents.)Observations:Based on review of facility documents and medical record (MR) and interview with facility staff (EMP), it was determined that the facility failed to follow their adopted policy by failing to document a behavioral health patient's seclusion event in the individualized treatment plan in one of one patient (MR1). Findings Include:  Review of facility policy and procedure dated July 2021, revealed, \"Title:  Restraint and Seclusion ... Policy Number  ADM-86 ... I.  Purpose:  To provide an organizational approach to restraint and seclusion that protects the patient's health and safety and preserves his/her dignity, rights, and well-being. ... III.  Policy:  A. Use: ... 8.  The use of restraint/seclusion is included in the patient's plan of care and/or treatment plan based on assessment and evaluation of the patient.  The plan of care/treatment plan is reviewed and updated in writing within 24 hours of the beginning of the Restraint or Seclusion. ... I.  Documentation: ... 2.  The problem requiring use of restraint/seclusion is reflected in the patient's care/treatment plan. ... .\" Review of facility policy and procedure dated February 2023, revealed, \"Title:  Patient Care:  Treatment Planning, Implementation, and Review; Monitoring & Documenting Response to Care & Services, Continuing Care Coord. ... Policy Number :  L-3A3 ... Policy:  It is the  policy of the inpatient program that each patient is provided with individualized, planned, and appropriate interventions that are designed to meet the patient's need for treatment. ... II.  Treatment Planning ... 1.  The Treatment Plan Data Base ... Note that the Problem List should be updated when appropriate.  A clinical justification must be provided for all deferred, inactive, and referred problems.  This is documented on the Treatment Plan. ... .\"  1.  Review of MR1 nursing documentation dated November 4, 2023, revealed that the physician was called and stated that the patient be placed in a seclusion room.  Continued review of MR1 15 minute observation documentation dated November 4, 2023, revealed that the patient's location from 10:15 PM until 11:15 PM was coded as \"16\" which was \"...16.  Other:  Seclusion ... .\" Further review of MR1 behavioral restraint documentation dated November 4, 2023, revealed that the restraint type was seclusion, that the patient was placed in seclusion at 10:15 PM and taken out of seclusion at 11:30 PM.  Additionally, review of MR1 Master Treatment Plan and Treatment Plan Reviews failed to reveal documented evidence of the seclusion event on November 4, 2023. Interview with EMP3 on January 17, 2024, at approximately 11:30 AM confirmed that the seclusion event on November 4, 2023, was not documented on the patient's treatment plan.   Plan of Correction - To be completed: 04/10/2024 The Chief Nursing Officer/ System Line Director of Behavioral Health have ultimate responsibility of the compliance of this plan of correction.1.\tThe Director of Behavioral Health/Designee will educate staff (registered nurses, licensed practical nurses, psychiatrists, nurse practitioners) on the following policies and procedures:a. ADM 86- Restraint Seclusion Policy b. L- 3A3 – Patient Care: Treatment Planning, implementation, and Review; Monitoring and Documenting Response to Care and Services, Continued Care Coordination.Staff (registered nurses, licensed practical nurses, psychiatrists, nurse practitioners) will be educated on all policies mentioned above by February 16th, 2024.The Director of Behavioral Health/Designee will educate staff (registered nurse, licensed practical nurses, psychiatrists nurse practitioners) on the Treatment Plan Education to ensure that staff know they must meet the following criteria for treatment plans (taken out of L-3A3 policy)1.\tCompleted based off identified patients needs as outlined in patient assessments.2.\tMaintaining continuity of care by involving a multidisciplinary group (patients, family, members, referral sources, providers)3.\tDeveloped by an interdisciplinary team led by attending psychiatrists.4.\tIs reviewed at least weekly, or when there is significant change in patient condition (placed in restraints or seclusion) This must be added to treatment plan.5.\tMust be reflected in the progress notes completed by the staff members and psychiatrists.All new hires and new agency staff (registered nurses, licensed practical nurses, psychiatrists, nurse practitioners) will be educated on the policies and procedures during their orientation period. Any noncompliant fallouts will be addressed immediately including implementations, orders or documentation will be corrected. All fallouts will be documented on the audit as they occur.Starting February 19th, 2024, the Director of the Behavioral Health/Designee will start auditing 30 Behavioral Health Charts to ensure that Treatment Plan are being updated to include the following: 1.\tEach patient is provided an individualized treatment plan.2.\tTreatment plans include planned and appropriate interventions that are designed to meet the needs of the patient.3.\tTreatment plan has an appropriately updated problem list.4.\tA clinical justification must be noted for all deferred, inactive, and referred problem within the chart.Audits will continue by reviewing up to 30 charts per month by the Director of Behavioral Health /Designee to ensure that all required documentation and interventions are being updated with the patients' treatment plans. Audit findings will be presented to the Safety Excellence Committee beginning in March 2024. The Audit findings will also be taken to the Board Quality Oversight Committee starting in April 2024. The overall targeted goal of compliance is 100%. Audits will continue until 100% compliance is met and sustained for 3 consecutive months. 5100.15 (a) REQUIREMENT Treatment Plan Content and Availability: 5100.15  CONTENTS OF TREATMENT PLANSActual requirement is 5100.15 (b)\t(a)  The treatment plan shall indicate what less restrictive alternatives were considered and why they were not utilized. If the plan provides for restraints, the basis for the necessity for such restraints must be stated in the plan under Chapter 13 (relating to us of restraints in treating patients/residents.) Observations:Based on review of facility documents and medical record (MR) and interview with facility staff (EMP), it was determined that the facility failed to follow their adopted policy by failing to document a behavioral health patient's seclusion event in the individualized treatment plan in one of one patient (MR1). Findings Include:  Review of facility policy and procedure dated July 2021, revealed, \"Title:  Restraint and Seclusion ... Policy Number  ADM-86 ... I.  Purpose:  To provide an organizational approach to restraint and seclusion that protects the patient's health and safety and preserves his/her dignity, rights, and well-being. ... III.  Policy:  A. Use: ... 8.  The use of restraint/seclusion is included in the patient's plan of care and/or treatment plan based on assessment and evaluation of the patient.  The plan of care/treatment plan is reviewed and updated in writing within 24 hours of the beginning of the Restraint or Seclusion. ... I.  Documentation: ... 2.  The problem requiring use of restraint/seclusion is reflected in the patient's care/treatment plan. ... .\" Review of facility policy and procedure dated February 2023, revealed, \"Title:  Patient Care:  Treatment Planning, Implementation, and Review; Monitoring & Documenting Response to Care & Services, Continuing Care Coord. ... Policy Number :  L-3A3 ... Policy:  It is the  policy of the inpatient program that each patient is provided with individualized, planned, and appropriate interventions that are designed to meet the patient's need for treatment. ... II.  Treatment Planning ... 1.  The Treatment Plan Data Base ... Note that the Problem List should be updated when appropriate.  A clinical justification must be provided for all deferred, inactive, and referred problems.  This is documented on the Treatment Plan. ... .\"  1.  Review of MR1 nursing documentation dated November 4, 2023, revealed that the physician was called and stated that the patient be placed in a seclusion room.  Continued review of MR1 15 minute observation documentation dated November 4, 2023, revealed that the patient's location from 10:15 PM until 11:15 PM was coded as \"16\" which was \"...16.  Other:  Seclusion ... .\" Further review of MR1 behavioral restraint documentation dated November 4, 2023, revealed that the restraint type was seclusion, that the patient was placed in seclusion at 10:15 PM and taken out of seclusion at 11:30 PM.  Additionally, review of MR1 Master Treatment Plan and Treatment Plan Reviews failed to reveal documented evidence of the seclusion event on November 4, 2023. Interview with EMP3 on January 17, 2024, at approximately 11:30 AM confirmed that the seclusion event on November 4, 2023, was not documented on the patient's treatment plan.   Plan of Correction - To be completed: 04/10/2024 The Chief Nursing Officer/ System Line Director of Behavioral Health have ultimate responsibility of the compliance of this plan of correction.1.\tThe Director of Behavioral Health/Designee will educate staff (registered nurses, licensed practical nurses, psychiatrists, nurse practitioners) on the following policies and procedures:a. ADM 86- Restraint Seclusion Policy b. L- 3A3 – Patient Care: Treatment Planning, implementation, and Review; Monitoring and Documenting Response to Care and Services, Continued Care Coordination.Staff (registered nurses, licensed practical nurses, psychiatrists, nurse practitioners) will be educated on all policies mentioned above by February 16th, 2024.The Director of Behavioral Health/Designee will educate staff (registered nurse, licensed practical nurses, psychiatrists nurse practitioners) on the Treatment Plan Education to ensure that staff know they must meet the following criteria for treatment plans (taken out of L-3A3 policy)1.\tCompleted based off identified patients needs as outlined in patient assessments.2.\tMaintaining continuity of care by involving a multidisciplinary group (patients, family, members, referral sources, providers)3.\tDeveloped by an interdisciplinary team led by attending psychiatrists.4.\tIs reviewed at least weekly, or when there is significant change in patient condition (placed in restraints or seclusion) This must be added to treatment plan.5.\tMust be reflected in the progress notes completed by the staff members and psychiatrists.All new hires and new agency staff (registered nurses, licensed practical nurses, psychiatrists, nurse practitioners) will be educated on the policies and procedures during their orientation period. Any noncompliant fallouts will be addressed immediately including implementations, orders or documentation will be corrected. All fallouts will be documented on the audit as they occur.Starting February 19th, 2024, the Director of the Behavioral Health/Designee will start auditing 30 Behavioral Health Charts to ensure that Treatment Plan are being updated to include the following: 1.\tEach patient is provided an individualized treatment plan.2.\tTreatment plans include planned and appropriate interventions that are designed to meet the needs of the patient.3.\tTreatment plan has an appropriately updated problem list.4.\tA clinical justification must be noted for all deferred, inactive, and referred problem within the chart.Audits will continue by reviewing up to 30 charts per month by the Director of Behavioral Health /Designee to ensure that all required documentation and interventions are being updated with the patients' treatment plans. Audit findings will be presented to the Safety Excellence Committee beginning in March 2024. The Audit findings will also be taken to the Board Quality Oversight Committee starting in April 2024. The overall targeted goal of compliance is 100%. Audits will continue until 100% compliance is met and sustained for 3 consecutive months. 5100.53 REQUIREMENT Bill of Rights for Patients:5100.53  BILL OF RIGHTS FOR PATIENTS\tThe following is the bill of rights for patients:\t\t- You have the right to be treated with dignity and respect\t\t- You shall retain all civil rights that have not been specifically curtailed by orders of court:\t1. Unrestricted and private communication\t2. Practice religion of your choice\t3. To keep personal possessions, unless contraband\t4. To handle your personal affairs\t5. To participate in the development and review of your treatment plan\t6. To receive less restrictive treatment\t7. Right to be discharged as soon as you no longer need care\t8. Not to be subjected to any harsh or unusual treatment\t9. Right to be discharge with stipulations              10. To be paid for workObservations:Based on review of facility documents and medical record (MR) and interview with facility staff (EMP), it was determined that the facility failed to follow adopted policy by placing a behavioral health patient in seclusion without a physician order in one of one medical record (MR1).Findings Include:Review of facility policy and procedure dated July 2021, revealed, \"Tiltle:  Restraint and Seclusion ... Policy Number  ADM-86 ... I.  Purpose:  To provide an organizational approach to restraint and seclusion that protects the patient's health and safety and preserves his/her dignity, rights, and well-being.  To provide guidelines for the appropriate and safe use of restraint and seclusion in compliance with applicable standards, law, and regulations, e.g. The Joint Commission, CMS, and DOH and to provide guidelines for staff education. ... II.  Definitions: ... Seclusion-Involuntary confinement of a patient, with violent or self-destructive behavior, in a room left alone and from which the patient is physically prevented from leaving, when all other less restrictive measures have been clinically determined to be inappropriate or insufficient to protect the patient, a staff member, or others from harm.  (A patient physically restrained alone in an unlocked room and confinement on a locked unit or ward where the patient is with others do not constitute seclusion.) ... III.  Policy:  A. Use:  1.  Penn Highlands Huntingdon is committed to preventing and reducing restraint and seclusion use, as well as striving to eliminate use in all locations and with all patients, regardless of age.  2.  Restraint or Seclusion is only imposed to ensure the immediate physical safety of the patient, a staff member, or others , and is discontinued at the earliest possible time, regardless of the length of time identified in the order.  3.  Restraint and seclusion are used when there is an order from the physician including verbal orders and are limited to situations in which there is an assessed need. ... B.  Patient Rights :  1.  All patients have the right to be free    from physical or mental abuse, and corporal punishment.  2.  All patients have the right to be free from restraint or seclusion, or any form, imposed as a means of correction, discipline, convenience, or retaliation by staff. ... F.  Physician Order  1.  An order of a physician or other LIP (Licensed Independent Practitioner) who is responsible for the care of the patient and is authorized to order restraint or seclusion is obtained prior to the application of restraint/seclusion. ... .\" 1.  Review of MR1 nursing documentation dated November 4, 2023, revealed that the behavioral health patient, following administration of PRN medcation, paced the halls, became more agitated and punched the sliding windows at the nurse's station, the physician was called and stated that the patient be placed in a seclusion room.  Continued review of MR1 physician documentation dated November 5, 2023, revealed that the day prior, the patient was very psychotic, was administered two PRN medications and was placed in seclusion due to attempts at destroying property and trying to break the window at nurse's station with fists.  Further review of MR1 15 minute observation documentation dated November 4, 2023, revealed that the patient's location from 10:15 PM until 11:15 PM was coded as \"16\" which was \"...16.  Other:  Seclusion ... .\" Additionally, review of MR1 behavioral restraint documentation dated November 4, 2023, revealed that the restraint type was seclusion, that the patient was placed in seclusion at 10:15 PM and taken out of seclusion at 11:30 PM.  Finally, review of MR1 failed to reveal documented evidence of a physician order for seclusion.  Interview with EMP1 on January 17, 2024, at approximately 10:45 AM revealed that the seclusion room would be locked if there was a patient placed in it and confirmed that MR1 failed to reveal a physician order for seclusion.   Plan of Correction - To be completed: 04/10/2024The Chief Nursing Officer/Service Line Director of Behavioral Health have ultimate responsibility of the compliance of this plan of correction.1.\tThe Director of Behavioral Health/Designee will educate staff (registered nurses, licensed practical nurses, psychiatrists, nurse practitioner) on the following policies and procedures:a. Patient Rights and Responsibilityb. ADM 86- Restraint Seclusion PolicyStaff (registered nurse) will be educated on all policies mentioned above by February 16th, 2024.The Director Behavioral Health/Designee will educate staff (registered nurses licensed practical nurses, psychiatrists, nurse practitioner) on the Cerner Restraint and Seclusion Order Sets/Documentation and Converge Event Restraint Reporting Education to ensure that staff know they must do the following tasks prior to initiating restraints. 1.\tAn order of a physician or other LIP (Licensed Independent Practitioner) who is responsible for the care of the patient and is authorized to order restraint or seclusion is obtained prior to the application of restraint/seclusion. ... .\"2.\tDocumentation and Interventions are documented appropriately per type of restraint/seclusion per policy.3.\tPlace Event Report into Converge as an infrastructure failure for all behavioral health restraint occurrences.The staff, (registered nurses licensed practical nurses, psychiatrists, nurse practitioner) will be educate by February 16th, 2024. All new hires and new agency staff will be educated on the policies and procedures during their orientation period. Any noncompliant fallouts will be addressed immediately including implementations, orders or documentation will be corrected. All fallouts will be documented on the audit as they occur. Continued noncompliance will result in disciplinary process to be executed by the Director of Behavioral Health/Designee.Starting February 19th, 2024, the Director of Behavioral Health/ Designee will investigate all restraint occurrences to ensure the appropriate order sets, documentation and interventions have been completed within the medical record by utilizing the restraint audit tool. These interventions include the following:1.\tAppropriate Restraint/Seclusion Order Placed by provider or other LIP (licensed independent practitioner)2.\tDocumentation and Interventions are documented appropriately per type of restraint/seclusion per policy.3.\tReview Event Report Placed in converge for Behavioral Health restraint occurrence. Audits will continue by reviewing all restraint charts per month by the Director of Behavioral Health/Designee to ensure that all required orders, documentation, interventions, and event reporting is being completed on every behavioral health patient per policy. Audit findings will be presented to the Safety Excellence Committee beginning in March 2024. The Audit findings will also be taken to the Board Quality Oversight Committee starting in April 2024. The overall targeted goal of compliance is 100%. Audits will continue until 100% compliance is met and sustained for 3 consecutive months. 5100.53 REQUIREMENT Bill of Rights for Patients: 5100.53  BILL OF RIGHTS FOR PATIENTS\tThe following is the bill of rights for patients:\t\t- You have the right to be treated with dignity and respect\t\t- You shall retain all civil rights that have not been specifically curtailed by orders of court:\t1. Unrestricted and private communication\t2. Practice religion of your choice\t3. To keep personal possessions, unless contraband\t4. To handle your personal affairs\t5. To participate in the development and review of your treatment plan\t6. To receive less restrictive treatment\t7. Right to be discharged as soon as you no longer need care\t8. Not to be subjected to any harsh or unusual treatment\t9. Right to be discharge with stipulations              10. To be paid for work Observations:Based on review of facility documents and medical record (MR) and interview with facility staff (EMP), it was determined that the facility failed to follow adopted policy by placing a behavioral health patient in seclusion without a physician order in one of one medical record (MR1).Findings Include:Review of facility policy and procedure dated July 2021, revealed, \"Tiltle:  Restraint and Seclusion ... Policy Number  ADM-86 ... I.  Purpose:  To provide an organizational approach to restraint and seclusion that protects the patient's health and safety and preserves his/her dignity, rights, and well-being.  To provide guidelines for the appropriate and safe use of restraint and seclusion in compliance with applicable standards, law, and regulations, e.g. The Joint Commission, CMS, and DOH and to provide guidelines for staff education. ... II.  Definitions: ... Seclusion-Involuntary confinement of a patient, with violent or self-destructive behavior, in a room left alone and from which the patient is physically prevented from leaving, when all other less restrictive measures have been clinically determined to be inappropriate or insufficient to protect the patient, a staff member, or others from harm.  (A patient physically restrained alone in an unlocked room and confinement on a locked unit or ward where the patient is with others do not constitute seclusion.) ... III.  Policy:  A. Use:  1.  Penn Highlands Huntingdon is committed to preventing and reducing restraint and seclusion use, as well as striving to eliminate use in all locations and with all patients, regardless of age.  2.  Restraint or Seclusion is only imposed to ensure the immediate physical safety of the patient, a staff member, or others , and is discontinued at the earliest possible time, regardless of the length of time identified in the order.  3.  Restraint and seclusion are used when there is an order from the physician including verbal orders and are limited to situations in which there is an assessed need. ... B.  Patient Rights :  1.  All patients have the right to be free    from physical or mental abuse, and corporal punishment.  2.  All patients have the right to be free from restraint or seclusion, or any form, imposed as a means of correction, discipline, convenience, or retaliation by staff. ... F.  Physician Order  1.  An order of a physician or other LIP (Licensed Independent Practitioner) who is responsible for the care of the patient and is authorized to order restraint or seclusion is obtained prior to the application of restraint/seclusion. ... .\" 1.  Review of MR1 nursing documentation dated November 4, 2023, revealed that the behavioral health patient, following administration of PRN medcation, paced the halls, became more agitated and punched the sliding windows at the nurse's station, the physician was called and stated that the patient be placed in a seclusion room.  Continued review of MR1 physician documentation dated November 5, 2023, revealed that the day prior, the patient was very psychotic, was administered two PRN medications and was placed in seclusion due to attempts at destroying property and trying to break the window at nurse's station with fists.  Further review of MR1 15 minute observation documentation dated November 4, 2023, revealed that the patient's location from 10:15 PM until 11:15 PM was coded as \"16\" which was \"...16.  Other:  Seclusion ... .\" Additionally, review of MR1 behavioral restraint documentation dated November 4, 2023, revealed that the restraint type was seclusion, that the patient was placed in seclusion at 10:15 PM and taken out of seclusion at 11:30 PM.  Finally, review of MR1 failed to reveal documented evidence of a physician order for seclusion.  Interview with EMP1 on January 17, 2024, at approximately 10:45 AM revealed that the seclusion room would be locked if there was a patient placed in it and confirmed that MR1 failed to reveal a physician order for seclusion.   Plan of Correction - To be completed: 04/10/2024The Chief Nursing Officer/Service Line Director of Behavioral Health have ultimate responsibility of the compliance of this plan of correction.1.\tThe Director of Behavioral Health/Designee will educate staff (registered nurses, licensed practical nurses, psychiatrists, nurse practitioner) on the following policies and procedures:a. Patient Rights and Responsibilityb. ADM 86- Restraint Seclusion PolicyStaff (registered nurse) will be educated on all policies mentioned above by February 16th, 2024.The Director Behavioral Health/Designee will educate staff (registered nurses licensed practical nurses, psychiatrists, nurse practitioner) on the Cerner Restraint and Seclusion Order Sets/Documentation and Converge Event Restraint Reporting Education to ensure that staff know they must do the following tasks prior to initiating restraints. 1.\tAn order of a physician or other LIP (Licensed Independent Practitioner) who is responsible for the care of the patient and is authorized to order restraint or seclusion is obtained prior to the application of restraint/seclusion. ... .\"2.\tDocumentation and Interventions are documented appropriately per type of restraint/seclusion per policy.3.\tPlace Event Report into Converge as an infrastructure failure for all behavioral health restraint occurrences.The staff, (registered nurses licensed practical nurses, psychiatrists, nurse practitioner) will be educate by February 16th, 2024. All new hires and new agency staff will be educated on the policies and procedures during their orientation period. Any noncompliant fallouts will be addressed immediately including implementations, orders or documentation will be corrected. All fallouts will be documented on the audit as they occur. Continued noncompliance will result in disciplinary process to be executed by the Director of Behavioral Health/Designee.Starting February 19th, 2024, the Director of Behavioral Health/ Designee will investigate all restraint occurrences to ensure the appropriate order sets, documentation and interventions have been completed within the medical record by utilizing the restraint audit tool. These interventions include the following:1.\tAppropriate Restraint/Seclusion Order Placed by provider or other LIP (licensed independent practitioner)2.\tDocumentation and Interventions are documented appropriately per type of restraint/seclusion per policy.3.\tReview Event Report Placed in converge for Behavioral Health restraint occurrence. Audits will continue by reviewing all restraint charts per month by the Director of Behavioral Health/Designee to ensure that all required orders, documentation, interventions, and event reporting is being completed on every behavioral health patient per policy. Audit findings will be presented to the Safety Excellence Committee beginning in March 2024. The Audit findings will also be taken to the Board Quality Oversight Committee starting in April 2024. The overall targeted goal of compliance is 100%. Audits will continue until 100% compliance is met and sustained for 3 consecutive months."
        },
        {
            "eventid": "Y6HP11",
            "date": "1/26/2024",
            "data": "Initial comments:This report is the result of an unannounced offsite complaint investigation CHL24C010J completed on January 26, 2024, at Penn Highlands Huntingdon.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced offsite complaint investigation CHL24C010J completed on January 26, 2024, at Penn Highlands Huntingdon.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "N2E711",
            "date": "1/26/2024",
            "data": "Initial comments:This report is the result of an unannounced onsite complaint investigation CH24C011J completed on January 26, 2024, at Penn Highlands Huntingdon.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced onsite complaint investigation CH24C011J completed on January 26, 2024, at Penn Highlands Huntingdon.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "FQNR11",
            "date": "1/25/2024",
            "data": "Initial comments:This report is the result of an occupancy survey conducted on January 25, 2024, at Penn Highlands Huntingdon which included the Pharmacy.  Based on the occupancy survey, it was determined the facility was in compliance with all applicable requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 1998 and the current edition of the Guidelines for Design and Construction of Hospital and Health Care Facilities.The Division of Safety Inspection granted approval.   Plan of Correction: Initial comments:This report is the result of an occupancy survey conducted on January 25, 2024, at Penn Highlands Huntingdon which included the Pharmacy.  Based on the occupancy survey, it was determined the facility was in compliance with all applicable requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 1998 and the current edition of the Guidelines for Design and Construction of Hospital and Health Care Facilities.The Division of Safety Inspection granted approval.   Plan of Correction:"
        },
        {
            "eventid": "73U611",
            "date": "1/20/2024",
            "data": "Initial comments:This report is the result of an unannounced onsite complaint investigation CHL23C988J completed on January 20, 2024 at Penn Highlands Huntingdon.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced onsite complaint investigation CHL23C988J completed on January 20, 2024 at Penn Highlands Huntingdon.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "QBWU11",
            "date": "1/11/2024",
            "data": "Initial comments:This report is the result of an unannounced onsite complaint investigation CHL23C767J completed on January 11, 2024, at Penn Highlands Huntingdon.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced onsite complaint investigation CHL23C767J completed on January 11, 2024, at Penn Highlands Huntingdon.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "S5XK11",
            "date": "1/8/2024",
            "data": "Initial comments:This report is for new equipment, GlucoStabilizer, beginning on November 1, 2023. The Penn Highlands Huntingdon attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is for new equipment, GlucoStabilizer, beginning on November 1, 2023. The Penn Highlands Huntingdon attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "4EIL11",
            "date": "12/28/2023",
            "data": "Initial comments:This report is for new renovations, AC1 unit/First Floor Inpatient Unit, beginning on December 18, 2023. The Penn Highlands Huntingdon attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is for new renovations, AC1 unit/First Floor Inpatient Unit, beginning on December 18, 2023. The Penn Highlands Huntingdon attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "8SV011",
            "date": "12/21/2023",
            "data": "Initial comments:This report is for the new service, C2 Coronary Shockwave IVL Therapy, beginning on December 13, 2023. The Penn Highlands Huntingdon attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is for the new service, C2 Coronary Shockwave IVL Therapy, beginning on December 13, 2023. The Penn Highlands Huntingdon attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "DSJF11",
            "date": "10/27/2023",
            "data": "Initial comments:This report is for the new service, therapeutic phlebotomy in the outpatient infusion area, beginning on September 06, 2023. The Penn Highlands Huntingdon attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is for the new service, therapeutic phlebotomy in the outpatient infusion area, beginning on September 06, 2023. The Penn Highlands Huntingdon attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "FIFH11",
            "date": "9/14/2023",
            "data": "Initial comments:This report is the result of an unannounced special monitoring visit conducted on September 12-14, 2023, at Penn Highlands Huntingdon.  It was determined that the facility was not in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 1998.   Plan of Correction: Initial comments:This report is the result of an unannounced special monitoring visit conducted on September 12-14, 2023, at Penn Highlands Huntingdon.  It was determined that the facility was not in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 1998.   Plan of Correction: Initial comments:This report is the result of an unannounced onsite special monitoring investigation Intake PA0006594  that concluded on September 14, 2023, at Penn Highlands Huntingdon. It was determined the facility was not in compliance with the requirements of 42 CFR, Title 42, Part 482-Standard:  Emergency Services Policies.   Plan of Correction: Initial comments:This report is the result of an unannounced onsite special monitoring investigation Intake PA0006594  that concluded on September 14, 2023, at Penn Highlands Huntingdon. It was determined the facility was not in compliance with the requirements of 42 CFR, Title 42, Part 482-Standard:  Emergency Services Policies.   Plan of Correction: 482.55(a)(3) STANDARD EMERGENCY SERVICES POLICIES:[If emergency services are provided at the hospital --](3) The policies and procedures governing medical care provided in the emergency service or department are established by and are a continuing responsibility of the medical staff.Observations:Based on a review of facility documents, medical records (MR), and interviews with staff (EMP), it was determined that the facility failed to follow their policy for incident report documentation after police were notified of a patient making homicidal threats to an identified individual in one of one medical records reviewed (MR1), by failing to document behavioral health patients were wanded upon admission to the Emergency Department (ED) in 12 of 21 medical records (MR1, MR3, MR4, MR6, MR7, MR8, MR9, MR12, MR13, MR17, MR20 and MR21), by failing to document behavioral health patient belongings were removed and secured in 10 of 21 medical records (MR1, MR3, MR4, MR6, MR8, MR9, MR13, MR17, MR20 and MR21), and by failing to document that the behavioral health patient was admitted to a ligature free environment in 14 of 21 medical records (MR1, MR2, MR3, MR4, MR5, MR6, MR7, MR8, MR9, MR12, MR13, MR17, MR20 and MR21).Findings Include:Review of Policy \"Patient Rights and Responsibilities\" Policy Number SB-5/ADM-39 dated February 2023, revealed, \"... I. Scope:  Applies to patients, patients legally responsibility party, and employees. I. Purpose:  As a patient or the patient's legally responsible party at Penn Highlands Huntingdon, the patient should have certain basic rights. III. Text:  Patient Rights and Responsibilities ... Your rights: ... As our patient, you have the right to safe, respectful, and dignified care at all times.  You will receive services and care that are medically suggested and within the hospital's services, its stated mission, and required law and regulation. ... Care Delivery: You have the right to:  Expect emergency procedures to be implemented without unnecessary delay. Receive care in a safe setting free from any form of abuse, harassment, and neglect. Receive kind, respectful, safe, quality care delivered by skilled staff. ... .\"Review of facility policy L-12, \"Elopement\" dated March 2023, revealed Procedure: Elopement: ... 5. If patient is 201, notification of police needs to be in form of written order from physician. If patient is 302, police will need to be contacted. A physical description of patient and clothing worn is to be given to police. In addition, if patient has made suicidal or homicidal threats, that information along with name of person homicidal threats were made about should be given to police. 6. Detailed documentation including an incident report will need done. ... .\"  Review of Policy \"Intake of the Behavioral Health Patients\" Policy P-79, last reviewed February 2023, revealed, \"... All Emotionally Ill Patients: 1. Patient presents to ED registration and is placed in the Quiet Room alerting the ED nurses of patient's arrival and security to perform metal detector wanding. 2. Patient wanded and taken to ED treatment room [preferably [sic] room 14 if medically able] and changed into paper scrubs/hospital gown and slipper socks. 3. Patient's belongings obtained and secured by security and patient wanded a second time. ... .\"Review of Policy \"Guidelines to Follow for Behavioral Health Patients Who Refuse Care\" Policy Number: P-78 dated February 2023, revealed, \"... Policy Special consideration should be given if the patient meets criteria for 302 commitment. ... The following are criteria to determine appropriateness for a 302 petition based on MH783 'Application for Involuntary Emergency Examination and Treatment-Mental Health Procedures Act of 1976, Section 302'. ... Clear and present danger to others shall be shown by establishing that within the past 30 days the person has inflicted or attempted to inflict serious bodily harm on another and that there is reasonable probability that such conduct will be repeated. A clear and present danger of harm to others may be demonstrated by proof that the person has made threats of harm and has committed acts in furtherance of the threat to commit harm: ... .\"1.  Review of MR1 dated August 15, 2023, at 8:15 PM revealed that the patient was psychotic, a threat to self, severely mentally disabled and was admitted as an involuntary commitment and the patient's \"MH-783 Application for Involuntary Emergency Examination and Treatment-Mental Health Procedures Act of 1976, Section 302\" was upheld by the ED physician. Continued review of MR1 dated August 15, 2023, revealed the homicidal patient eloped from the ED at 8:38 PM and failed to reveal documented evidence that a detailed incident report was completed after the police were notified of a patient who made homicidal threats about an identified person.2.  Interview with EMP6 on September 12, 2023 at 2:15 PM, confirmed that a detailed event report was not completed after the police were contacted regarding a patient who made homicidal threats about an identified individual.3.  Additional review of MR1 dated August 15, 2023, at 7:46 PM revealed, prior to the Emergency Department (ED) visit the patient smashed a windshield and apartment buildings circuit box causing the power to go out. MR1 revealed during the ED visit the patient was very paranoid and would not answer questions directly, had scattered thoughts and stated that he wanted to kill three people. Continued review of MR1 dated August 15, 2023, at 8:41 PM revealed, that the patient has had ongoing psychosis with anger, aggression, homicidal and suicidal threats.4. Tour of the Emergency Department on September 14, 2023, conducted with EMP1 and EMP2, revealed Room 14, with ligatures that included a patient bed, recliner and overbed table. Interview with EMP3 on September 14, 2023, confirmed Room 14 is utilized for behavioral health patients when available, that MR1 was admitted to this room and that the overbed table was allowed to remain in the room with the patient. 5.  Review of MR1, MR2, MR3, MR4, MR5, MR6, MR7, MR8, MR9, MR12, MR13, MR17, MR20, MR21 failed to reveal documented evidence of patient's being admitted in a ligature free room.Interview with EMP5 on September 14, 2023, at 11:20 AM confirmed the above findings. 6.  Review of MR1, MR3, MR4, MR6, MR8, MR9, MR13, MR17, MR20, MR21 failed to reveal documented evidence of personal belongings should have been removed by staff and secured at the nurse's station.Interview with EMP5 on September 14, 2023, at 11:20 AM confirmed the above findings. 7.  Review of MR1, MR3, MR4, MR6, MR7, MR8, MR9, MR12, MR13, MR 17, MR20, MR21 failed to reveal documented evidence that patient's were wanded prior to changing into hospital gown per hospital policy.  Interview with EMP5 on September 14, 2023, at 11:20 AM confirmed the above findings. 8.  Interview with EMP2 on September 14, 2023, confirmed the expectation for nursing would be to document behavioral health patients are wanded on admission to the ED, changed into hospital gown, with belongings collected by staff and secured at the nurse's station, and admitted to a ligature free room.  Plan of Correction - To be completed: 12/31/2023   The Chief Medical Officer has ultimate responsibility of the compliance of this plan of correction.1.\tThe Director of the Emergency Department and Medical Director of the Emergency Department will educate staff (registered nurses and providers) on the following policies and procedures:a. Patient Rights and Responsibilityb. Guidelines to Follow for Behavioral Health Patients Who Refuse Care- (This education includes proper notification to the police if an elopement occurs.)c. Elopement Policy – (This education includes proper notification to the police regarding homicidal/suicidal threats made by a behavioral health patient and how to properly document with an event report.)Staff (registered nurse) will be educated on all policies mentioned above by December 18th, 2023.The Director of Quality, Chief Nursing Officer and Director of Emergency Department met to update the Behavioral Health Policy to outline the appropriate procedures and processes to meet the standard of care and regulatory requirements.The Director of Quality will have the updated Behavioral Health Policy taken through Medical Staff Peer Review Committee and Medical Executive Committee by December 13th, 2023, for appropriate approval process.The Director of the Emergency Department and Medical Director of the Emergency Department will educate staff(registered nurses and providers) on the new Behavioral Health Patient policy starting on December 14th, 2023, in a read and sign format. Education will be completed by December 28th, 2023.The Director of the Emergency Department will re-educate the emergency department staff (registered nurses) on the Behavioral Health Checklist to ensure that staff know they must do the following tasks when identifying a behavioral health patient.1.\tSecure patient room by mitigating ligature items.2.\tWand patient with metal detection device3.\tDe-robe patient and change into ligature free clothing. 4.\tRemove patient's personal belongings and secure them in a locker within ED proper.The staff (registered nurses) were educated by the Director of the Emergency Department on September 13th, 2023, however, will be re-educated on Behavioral Health Checklist mentioned above by the Director of the Emergency Department, by December 18th, 2023. All new hires and new agency staff (registered nurses) will be educated on the policies and procedures during their orientation period.The Director of the Emergency Department will re-educate the emergency department staff (registered nurses) on the Cerner Behavioral Health Documentation to ensure that staff know the required information they must document within EMAR (Cerner) when documenting on a Behavioral Health Patients. These required details include that the nursing did the following:1.\tSecured Room and Mitigated Ligature Risk2.\tWanded patient with a metal detection device3.\tDe-robed the patient and changed them into ligature free clothing.4.\tPatient's belongings were removed and secured.The staff (registered nurses) were educated by the Director of the Emergency Department on September 13th, 2023, however, will be re-educated on Cerner Behavioral Health Documentation mentioned above by the Director of the Emergency Department, by December 18th, 2023. All new hires and new agency staff (registered nurses) will be educated on the policies and procedures during their orientation period. Any noncompliant fallouts will be addressed immediately including implementations, orders or documentation will be corrected. All fallouts will be documented on the audit as they occur.Recurrent noncompliance regarding implementation of interventions or documentation will have an incident report (Converge) entered, and the standard disciplinary process will be executed by the ED RN DirectorStarting September 13th, 2023, the Director of the Emergency Department has been monitoring all Behavioral Health Charts to ensure the appropriate documentation and interventions have been completed. These interventions include:1.\tSecured Room and Mitigated Ligature Risk2.\tWanded patient with a metal detection device3.\tDe-robed the patient and changed them into ligature free clothing.4.\tPatient's belongings were removed and secured. Audits will continue by reviewing up to 30 charts per month by the Director of the Emergency Department /Designee to ensure that all required documentation and interventions are being completed on every behavioral health patient. Audit findings will be presented to the Safety Excellence Committee beginning in December 2023. The Audit findings will also be taken to the Board Quality Oversight Committee starting in December 2023. The overall targeted goal of compliance is 100%. Audits will continue until 100% compliance is met and sustained for 3 consecutive months. 482.55(a)(3) STANDARD EMERGENCY SERVICES POLICIES: [If emergency services are provided at the hospital --](3) The policies and procedures governing medical care provided in the emergency service or department are established by and are a continuing responsibility of the medical staff. Observations:Based on a review of facility documents, medical records (MR), and interviews with staff (EMP), it was determined that the facility failed to follow their policy for incident report documentation after police were notified of a patient making homicidal threats to an identified individual in one of one medical records reviewed (MR1), by failing to document behavioral health patients were wanded upon admission to the Emergency Department (ED) in 12 of 21 medical records (MR1, MR3, MR4, MR6, MR7, MR8, MR9, MR12, MR13, MR17, MR20 and MR21), by failing to document behavioral health patient belongings were removed and secured in 10 of 21 medical records (MR1, MR3, MR4, MR6, MR8, MR9, MR13, MR17, MR20 and MR21), and by failing to document that the behavioral health patient was admitted to a ligature free environment in 14 of 21 medical records (MR1, MR2, MR3, MR4, MR5, MR6, MR7, MR8, MR9, MR12, MR13, MR17, MR20 and MR21).Findings Include:Review of Policy \"Patient Rights and Responsibilities\" Policy Number SB-5/ADM-39 dated February 2023, revealed, \"... I. Scope:  Applies to patients, patients legally responsibility party, and employees. I. Purpose:  As a patient or the patient's legally responsible party at Penn Highlands Huntingdon, the patient should have certain basic rights. III. Text:  Patient Rights and Responsibilities ... Your rights: ... As our patient, you have the right to safe, respectful, and dignified care at all times.  You will receive services and care that are medically suggested and within the hospital's services, its stated mission, and required law and regulation. ... Care Delivery: You have the right to:  Expect emergency procedures to be implemented without unnecessary delay. Receive care in a safe setting free from any form of abuse, harassment, and neglect. Receive kind, respectful, safe, quality care delivered by skilled staff. ... .\"Review of facility policy L-12, \"Elopement\" dated March 2023, revealed Procedure: Elopement: ... 5. If patient is 201, notification of police needs to be in form of written order from physician. If patient is 302, police will need to be contacted. A physical description of patient and clothing worn is to be given to police. In addition, if patient has made suicidal or homicidal threats, that information along with name of person homicidal threats were made about should be given to police. 6. Detailed documentation including an incident report will need done. ... .\"  Review of Policy \"Intake of the Behavioral Health Patients\" Policy P-79, last reviewed February 2023, revealed, \"... All Emotionally Ill Patients: 1. Patient presents to ED registration and is placed in the Quiet Room alerting the ED nurses of patient's arrival and security to perform metal detector wanding. 2. Patient wanded and taken to ED treatment room [preferably [sic] room 14 if medically able] and changed into paper scrubs/hospital gown and slipper socks. 3. Patient's belongings obtained and secured by security and patient wanded a second time. ... .\"Review of Policy \"Guidelines to Follow for Behavioral Health Patients Who Refuse Care\" Policy Number: P-78 dated February 2023, revealed, \"... Policy Special consideration should be given if the patient meets criteria for 302 commitment. ... The following are criteria to determine appropriateness for a 302 petition based on MH783 'Application for Involuntary Emergency Examination and Treatment-Mental Health Procedures Act of 1976, Section 302'. ... Clear and present danger to others shall be shown by establishing that within the past 30 days the person has inflicted or attempted to inflict serious bodily harm on another and that there is reasonable probability that such conduct will be repeated. A clear and present danger of harm to others may be demonstrated by proof that the person has made threats of harm and has committed acts in furtherance of the threat to commit harm: ... .\"1.  Review of MR1 dated August 15, 2023, at 8:15 PM revealed that the patient was psychotic, a threat to self, severely mentally disabled and was admitted as an involuntary commitment and the patient's \"MH-783 Application for Involuntary Emergency Examination and Treatment-Mental Health Procedures Act of 1976, Section 302\" was upheld by the ED physician. Continued review of MR1 dated August 15, 2023, revealed the homicidal patient eloped from the ED at 8:38 PM and failed to reveal documented evidence that a detailed incident report was completed after the police were notified of a patient who made homicidal threats about an identified person.2.  Interview with EMP6 on September 12, 2023 at 2:15 PM, confirmed that a detailed event report was not completed after the police were contacted regarding a patient who made homicidal threats about an identified individual.3.  Additional review of MR1 dated August 15, 2023, at 7:46 PM revealed, prior to the Emergency Department (ED) visit the patient smashed a windshield and apartment buildings circuit box causing the power to go out. MR1 revealed during the ED visit the patient was very paranoid and would not answer questions directly, had scattered thoughts and stated that he wanted to kill three people. Continued review of MR1 dated August 15, 2023, at 8:41 PM revealed, that the patient has had ongoing psychosis with anger, aggression, homicidal and suicidal threats.4. Tour of the Emergency Department on September 14, 2023, conducted with EMP1 and EMP2, revealed Room 14, with ligatures that included a patient bed, recliner and overbed table. Interview with EMP3 on September 14, 2023, confirmed Room 14 is utilized for behavioral health patients when available, that MR1 was admitted to this room and that the overbed table was allowed to remain in the room with the patient. 5.  Review of MR1, MR2, MR3, MR4, MR5, MR6, MR7, MR8, MR9, MR12, MR13, MR17, MR20, MR21 failed to reveal documented evidence of patient's being admitted in a ligature free room.Interview with EMP5 on September 14, 2023, at 11:20 AM confirmed the above findings. 6.  Review of MR1, MR3, MR4, MR6, MR8, MR9, MR13, MR17, MR20, MR21 failed to reveal documented evidence of personal belongings should have been removed by staff and secured at the nurse's station.Interview with EMP5 on September 14, 2023, at 11:20 AM confirmed the above findings. 7.  Review of MR1, MR3, MR4, MR6, MR7, MR8, MR9, MR12, MR13, MR 17, MR20, MR21 failed to reveal documented evidence that patient's were wanded prior to changing into hospital gown per hospital policy.  Interview with EMP5 on September 14, 2023, at 11:20 AM confirmed the above findings. 8.  Interview with EMP2 on September 14, 2023, confirmed the expectation for nursing would be to document behavioral health patients are wanded on admission to the ED, changed into hospital gown, with belongings collected by staff and secured at the nurse's station, and admitted to a ligature free room.  Plan of Correction - To be completed: 12/31/2023   The Chief Medical Officer has ultimate responsibility of the compliance of this plan of correction.1.\tThe Director of the Emergency Department and Medical Director of the Emergency Department will educate staff (registered nurses and providers) on the following policies and procedures:a. Patient Rights and Responsibilityb. Guidelines to Follow for Behavioral Health Patients Who Refuse Care- (This education includes proper notification to the police if an elopement occurs.)c. Elopement Policy – (This education includes proper notification to the police regarding homicidal/suicidal threats made by a behavioral health patient and how to properly document with an event report.)Staff (registered nurse) will be educated on all policies mentioned above by December 18th, 2023.The Director of Quality, Chief Nursing Officer and Director of Emergency Department met to update the Behavioral Health Policy to outline the appropriate procedures and processes to meet the standard of care and regulatory requirements.The Director of Quality will have the updated Behavioral Health Policy taken through Medical Staff Peer Review Committee and Medical Executive Committee by December 13th, 2023, for appropriate approval process.The Director of the Emergency Department and Medical Director of the Emergency Department will educate staff(registered nurses and providers) on the new Behavioral Health Patient policy starting on December 14th, 2023, in a read and sign format. Education will be completed by December 28th, 2023.The Director of the Emergency Department will re-educate the emergency department staff (registered nurses) on the Behavioral Health Checklist to ensure that staff know they must do the following tasks when identifying a behavioral health patient.1.\tSecure patient room by mitigating ligature items.2.\tWand patient with metal detection device3.\tDe-robe patient and change into ligature free clothing. 4.\tRemove patient's personal belongings and secure them in a locker within ED proper.The staff (registered nurses) were educated by the Director of the Emergency Department on September 13th, 2023, however, will be re-educated on Behavioral Health Checklist mentioned above by the Director of the Emergency Department, by December 18th, 2023. All new hires and new agency staff (registered nurses) will be educated on the policies and procedures during their orientation period.The Director of the Emergency Department will re-educate the emergency department staff (registered nurses) on the Cerner Behavioral Health Documentation to ensure that staff know the required information they must document within EMAR (Cerner) when documenting on a Behavioral Health Patients. These required details include that the nursing did the following:1.\tSecured Room and Mitigated Ligature Risk2.\tWanded patient with a metal detection device3.\tDe-robed the patient and changed them into ligature free clothing.4.\tPatient's belongings were removed and secured.The staff (registered nurses) were educated by the Director of the Emergency Department on September 13th, 2023, however, will be re-educated on Cerner Behavioral Health Documentation mentioned above by the Director of the Emergency Department, by December 18th, 2023. All new hires and new agency staff (registered nurses) will be educated on the policies and procedures during their orientation period. Any noncompliant fallouts will be addressed immediately including implementations, orders or documentation will be corrected. All fallouts will be documented on the audit as they occur.Recurrent noncompliance regarding implementation of interventions or documentation will have an incident report (Converge) entered, and the standard disciplinary process will be executed by the ED RN DirectorStarting September 13th, 2023, the Director of the Emergency Department has been monitoring all Behavioral Health Charts to ensure the appropriate documentation and interventions have been completed. These interventions include:1.\tSecured Room and Mitigated Ligature Risk2.\tWanded patient with a metal detection device3.\tDe-robed the patient and changed them into ligature free clothing.4.\tPatient's belongings were removed and secured. Audits will continue by reviewing up to 30 charts per month by the Director of the Emergency Department /Designee to ensure that all required documentation and interventions are being completed on every behavioral health patient. Audit findings will be presented to the Safety Excellence Committee beginning in December 2023. The Audit findings will also be taken to the Board Quality Oversight Committee starting in December 2023. The overall targeted goal of compliance is 100%. Audits will continue until 100% compliance is met and sustained for 3 consecutive months. 117.41 (a) LICENSURE EMERGENCY PATIENT CARE:117.41  Emergency patient care (a) Emergency patient care shall be guided by written policies and procedures which delineate the proper administrative and medical procedures and methods to be followed in providing emergency care. These policies and procedures shall be clear and explicit; approved by the medical staff and hospital governing body; reviewed annually, revised as necessary; and dated to indicate the date of the latest review or revision, or both.Observations:Based on a review of facility documents, medical records (MR), and interviews with staff (EMP), it was determined that the facility failed to follow their policy for incident report documentation after police were notified of a patient making homicidal threats to an identified individual in one of one medical records reviewed (MR1), by failing to document behavioral health patients were wanded upon admission to the Emergency Department (ED) in 12 of 21 medical records (MR1, MR3, MR4, MR6, MR7, MR8, MR9, MR12, MR13, MR17, MR20 and MR21), by failing to document behavioral health patient belongings were removed and secured in 10 of 21 medical records (MR1, MR3, MR4, MR6, MR8, MR9, MR13, MR17, MR20 and MR21), and by failing to document that the behavioral health patient was admitted to a ligature free environment in 14 of 21 medical records (MR1, MR2, MR3, MR4, MR5, MR6, MR7, MR8, MR9, MR12, MR13, MR17, MR20 and MR21).Findings Include:Review of Policy \"Patient Rights and Responsibilities\" Policy Number SB-5/ADM-39 dated February 2023, revealed, \"... I. Scope:  Applies to patients, patients legally responsibility party, and employees. I. Purpose:  As a patient or the patient's legally responsible party at Penn Highlands Huntingdon, the patient should have certain basic rights. III. Text:  Patient Rights and Responsibilities ... Your rights: ... As our patient, you have the right to safe, respectful, and dignified care at all times.  You will receive services and care that are medically suggested and within the hospital's services, its stated mission, and required law and regulation. ... Care Delivery: You have the right to:  Expect emergency procedures to be implemented without unnecessary delay. Receive care in a safe setting free from any form of abuse, harassment, and neglect. Receive kind, respectful, safe, quality care delivered by skilled staff. ... .\"Review of facility policy L-12, \"Elopement\" dated March 2023, revealed Procedure: Elopement: ... 5. If patient is 201, notification of police needs to be in form of written order from physician. If patient is 302, police will need to be contacted. A physical description of patient and clothing worn is to be given to police. In addition, if patient has made suicidal or homicidal threats, that information along with name of person homicidal threats were made about should be given to police. 6. Detailed documentation including an incident report will need done. ... .\"  Review of Policy \"Intake of the Behavioral Health Patients\" Policy P-79, last reviewed February 2023, revealed, \"... All Emotionally Ill Patients: 1. Patient presents to ED registration and is placed in the Quiet Room alerting the ED nurses of patient's arrival and security to perform metal detector wanding. 2. Patient wanded and taken to ED treatment room [preferably [sic] room 14 if medically able] and changed into paper scrubs/hospital gown and slipper socks. 3. Patient's belongings obtained and secured by security and patient wanded a second time. ... .\"Review of Policy \"Guidelines to Follow for Behavioral Health Patients Who Refuse Care\" Policy Number: P-78 dated February 2023, revealed, \"... Policy Special consideration should be given if the patient meets criteria for 302 commitment. ... The following are criteria to determine appropriateness for a 302 petition based on MH783 'Application for Involuntary Emergency Examination and Treatment-Mental Health Procedures Act of 1976, Section 302'. ... Clear and present danger to others shall be shown by establishing that within the past 30 days the person has inflicted or attempted to inflict serious bodily harm on another and that there is reasonable probability that such conduct will be repeated. A clear and present danger of harm to others may be demonstrated by proof that the person has made threats of harm and has committed acts in furtherance of the threat to commit harm: ... .\"1.  Review of MR1 dated August 15, 2023, at 8:15 PM revealed that the patient was psychotic, a threat to self, severely mentally disabled and was admitted as an involuntary commitment and the patient's \"MH-783 Application for Involuntary Emergency Examination and Treatment-Mental Health Procedures Act of 1976, Section 302\" was upheld by the ED physician. Continued review of MR1 dated August 15, 2023, revealed the homicidal patient eloped from the ED at 8:38 PM and failed to reveal documented evidence that a detailed incident report was completed after the police were notified of a patient who made homicidal threats about an identified person.2.  Interview with EMP6 on September 12, 2023 at 2:15 PM, confirmed that a detailed event report was not completed after the police were contacted regarding a patient who made homicidal threats about an identified individual.3.  Additional review of MR1 dated August 15, 2023, at 7:46 PM revealed, prior to the Emergency Department (ED) visit the patient smashed a windshield and apartment buildings circuit box causing the power to go out. MR1 revealed during the ED visit the patient was very paranoid and would not answer questions directly, had scattered thoughts and stated that he wanted to kill three people. Continued review of MR1 dated August 15, 2023, at 8:41 PM revealed, that the patient has had ongoing psychosis with anger, aggression, homicidal and suicidal threats.4. Tour of the Emergency Department on September 14, 2023, conducted with EMP1 and EMP2, revealed Room 14, with ligatures that included a patient bed, recliner and overbed table. Interview with EMP3 on September 14, 2023, confirmed Room 14 is utilized for behavioral health patients when available, that MR1 was admitted to this room and that the overbed table was allowed to remain in the room with the patient. 5.  Review of MR1, MR2, MR3, MR4, MR5, MR6, MR7, MR8, MR9, MR12, MR13, MR17, MR20, MR21 failed to reveal documented evidence of patient's being admitted in a ligature free room.Interview with EMP5 on September 14, 2023, at 11:20 AM confirmed the above findings. 6.  Review of MR1, MR3, MR4, MR6, MR8, MR9, MR13, MR17, MR20, MR21 failed to reveal documented evidence of personal belongings should have been removed by staff and secured at the nurse's station.Interview with EMP5 on September 14, 2023, at 11:20 AM confirmed the above findings. 7.  Review of MR1, MR3, MR4, MR6, MR7, MR8, MR9, MR12, MR13, MR 17, MR20, MR21 failed to reveal documented evidence that patient's were wanded prior to changing into hospital gown per hospital policy.  Interview with EMP5 on September 14, 2023, at 11:20 AM confirmed the above findings. 8.  Interview with EMP2 on September 14, 2023, confirmed the expectation for nursing would be to document behavioral health patients are wanded on admission to the ED, changed into hospital gown, with belongings collected by staff and secured at the nurse's station, and admitted to a ligature free room.  Plan of Correction - To be completed: 12/31/2023  The Chief Medical Officer has ultimate responsibility of the compliance of this plan of correction.1.\tThe Director of the Emergency Department and Medical Director of the Emergency Department will educate staff (registered nurses and providers) on the following policies and procedures:a. Patient Rights and Responsibilityb. Guidelines to Follow for Behavioral Health Patients Who Refuse Care- (This education includes proper notification to the police if an elopement occurs.)c. Elopement Policy – (This education includes proper notification to the police regarding homicidal/suicidal threats made by a behavioral health patient and how to properly document with an event report.)Staff (registered nurse) will be educated on all policies mentioned above by December 18th, 2023.The Director of Quality, Chief Nursing Officer and Director of Emergency Department met to update the Behavioral Health Policy to outline the appropriate procedures and processes to meet the standard of care and regulatory requirements.The Director of Quality will have the updated Behavioral Health Policy taken through Medical Staff Peer Review Committee and Medical Executive Committee by December 13th, 2023, for appropriate approval process.The Director of the Emergency Department and Medical Director of the Emergency Department will educate staff(registered nurses and providers) on the new Behavioral Health Patient policy starting on December 14th, 2023, in a read and sign format. Education will be completed by December 28th, 2023.The Director of the Emergency Department will re-educate the emergency department staff (registered nurses) on the Behavioral Health Checklist to ensure that staff know they must do the following tasks when identifying a behavioral health patient.1.\tSecure patient room by mitigating ligature items.2.\tWand patient with metal detection device3.\tDe-robe patient and change into ligature free clothing. 4.\tRemove patient's personal belongings and secure them in a locker within ED proper.The staff (registered nurses) were educated by the Director of the Emergency Department on September 13th, 2023, however, will be re-educated on Behavioral Health Checklist mentioned above by the Director of the Emergency Department, by December 18th, 2023. All new hires and new agency staff (registered nurses) will be educated on the policies and procedures during their orientation period.The Director of the Emergency Department will re-educate the emergency department staff (registered nurses) on the Cerner Behavioral Health Documentation to ensure that staff know the required information they must document within EMAR (Cerner) when documenting on a Behavioral Health Patients. These required details include that the nursing did the following:1.\tSecured Room and Mitigated Ligature Risk2.\tWanded patient with a metal detection device3.\tDe-robed the patient and changed them into ligature free clothing.4.\tPatient's belongings were removed and secured.The staff (registered nurses) were educated by the Director of the Emergency Department on September 13th, 2023, however, will be re-educated on Cerner Behavioral Health Documentation mentioned above by the Director of the Emergency Department, by December 18th, 2023. All new hires and new agency staff (registered nurses) will be educated on the policies and procedures during their orientation period. Any noncompliant fallouts will be addressed immediately including implementations, orders or documentation will be corrected. All fallouts will be documented on the audit as they occur.Recurrent noncompliance regarding implementation of interventions or documentation will have an incident report (Converge) entered, and the standard disciplinary process will be executed by the ED RN DirectorStarting September 13th, 2023, the Director of the Emergency Department has been monitoring all Behavioral Health Charts to ensure the appropriate documentation and interventions have been completed. These interventions include:1.\tSecured Room and Mitigated Ligature Risk2.\tWanded patient with a metal detection device3.\tDe-robed the patient and changed them into ligature free clothing.4.\tPatient's belongings were removed and secured. Audits will continue by reviewing up to 30 charts per month by the Director of the Emergency Department /Designee to ensure that all required documentation and interventions are being completed on every behavioral health patient. Audit findings will be presented to the Safety Excellence Committee beginning in December 2023. The Audit findings will also be taken to the Board Quality Oversight Committee starting in December 2023. The overall targeted goal of compliance is 100%. Audits will continue until 100% compliance is met and sustained for 3 consecutive months. 117.41 (a) LICENSURE EMERGENCY PATIENT CARE: 117.41  Emergency patient care (a) Emergency patient care shall be guided by written policies and procedures which delineate the proper administrative and medical procedures and methods to be followed in providing emergency care. These policies and procedures shall be clear and explicit; approved by the medical staff and hospital governing body; reviewed annually, revised as necessary; and dated to indicate the date of the latest review or revision, or both. Observations:Based on a review of facility documents, medical records (MR), and interviews with staff (EMP), it was determined that the facility failed to follow their policy for incident report documentation after police were notified of a patient making homicidal threats to an identified individual in one of one medical records reviewed (MR1), by failing to document behavioral health patients were wanded upon admission to the Emergency Department (ED) in 12 of 21 medical records (MR1, MR3, MR4, MR6, MR7, MR8, MR9, MR12, MR13, MR17, MR20 and MR21), by failing to document behavioral health patient belongings were removed and secured in 10 of 21 medical records (MR1, MR3, MR4, MR6, MR8, MR9, MR13, MR17, MR20 and MR21), and by failing to document that the behavioral health patient was admitted to a ligature free environment in 14 of 21 medical records (MR1, MR2, MR3, MR4, MR5, MR6, MR7, MR8, MR9, MR12, MR13, MR17, MR20 and MR21).Findings Include:Review of Policy \"Patient Rights and Responsibilities\" Policy Number SB-5/ADM-39 dated February 2023, revealed, \"... I. Scope:  Applies to patients, patients legally responsibility party, and employees. I. Purpose:  As a patient or the patient's legally responsible party at Penn Highlands Huntingdon, the patient should have certain basic rights. III. Text:  Patient Rights and Responsibilities ... Your rights: ... As our patient, you have the right to safe, respectful, and dignified care at all times.  You will receive services and care that are medically suggested and within the hospital's services, its stated mission, and required law and regulation. ... Care Delivery: You have the right to:  Expect emergency procedures to be implemented without unnecessary delay. Receive care in a safe setting free from any form of abuse, harassment, and neglect. Receive kind, respectful, safe, quality care delivered by skilled staff. ... .\"Review of facility policy L-12, \"Elopement\" dated March 2023, revealed Procedure: Elopement: ... 5. If patient is 201, notification of police needs to be in form of written order from physician. If patient is 302, police will need to be contacted. A physical description of patient and clothing worn is to be given to police. In addition, if patient has made suicidal or homicidal threats, that information along with name of person homicidal threats were made about should be given to police. 6. Detailed documentation including an incident report will need done. ... .\"  Review of Policy \"Intake of the Behavioral Health Patients\" Policy P-79, last reviewed February 2023, revealed, \"... All Emotionally Ill Patients: 1. Patient presents to ED registration and is placed in the Quiet Room alerting the ED nurses of patient's arrival and security to perform metal detector wanding. 2. Patient wanded and taken to ED treatment room [preferably [sic] room 14 if medically able] and changed into paper scrubs/hospital gown and slipper socks. 3. Patient's belongings obtained and secured by security and patient wanded a second time. ... .\"Review of Policy \"Guidelines to Follow for Behavioral Health Patients Who Refuse Care\" Policy Number: P-78 dated February 2023, revealed, \"... Policy Special consideration should be given if the patient meets criteria for 302 commitment. ... The following are criteria to determine appropriateness for a 302 petition based on MH783 'Application for Involuntary Emergency Examination and Treatment-Mental Health Procedures Act of 1976, Section 302'. ... Clear and present danger to others shall be shown by establishing that within the past 30 days the person has inflicted or attempted to inflict serious bodily harm on another and that there is reasonable probability that such conduct will be repeated. A clear and present danger of harm to others may be demonstrated by proof that the person has made threats of harm and has committed acts in furtherance of the threat to commit harm: ... .\"1.  Review of MR1 dated August 15, 2023, at 8:15 PM revealed that the patient was psychotic, a threat to self, severely mentally disabled and was admitted as an involuntary commitment and the patient's \"MH-783 Application for Involuntary Emergency Examination and Treatment-Mental Health Procedures Act of 1976, Section 302\" was upheld by the ED physician. Continued review of MR1 dated August 15, 2023, revealed the homicidal patient eloped from the ED at 8:38 PM and failed to reveal documented evidence that a detailed incident report was completed after the police were notified of a patient who made homicidal threats about an identified person.2.  Interview with EMP6 on September 12, 2023 at 2:15 PM, confirmed that a detailed event report was not completed after the police were contacted regarding a patient who made homicidal threats about an identified individual.3.  Additional review of MR1 dated August 15, 2023, at 7:46 PM revealed, prior to the Emergency Department (ED) visit the patient smashed a windshield and apartment buildings circuit box causing the power to go out. MR1 revealed during the ED visit the patient was very paranoid and would not answer questions directly, had scattered thoughts and stated that he wanted to kill three people. Continued review of MR1 dated August 15, 2023, at 8:41 PM revealed, that the patient has had ongoing psychosis with anger, aggression, homicidal and suicidal threats.4. Tour of the Emergency Department on September 14, 2023, conducted with EMP1 and EMP2, revealed Room 14, with ligatures that included a patient bed, recliner and overbed table. Interview with EMP3 on September 14, 2023, confirmed Room 14 is utilized for behavioral health patients when available, that MR1 was admitted to this room and that the overbed table was allowed to remain in the room with the patient. 5.  Review of MR1, MR2, MR3, MR4, MR5, MR6, MR7, MR8, MR9, MR12, MR13, MR17, MR20, MR21 failed to reveal documented evidence of patient's being admitted in a ligature free room.Interview with EMP5 on September 14, 2023, at 11:20 AM confirmed the above findings. 6.  Review of MR1, MR3, MR4, MR6, MR8, MR9, MR13, MR17, MR20, MR21 failed to reveal documented evidence of personal belongings should have been removed by staff and secured at the nurse's station.Interview with EMP5 on September 14, 2023, at 11:20 AM confirmed the above findings. 7.  Review of MR1, MR3, MR4, MR6, MR7, MR8, MR9, MR12, MR13, MR 17, MR20, MR21 failed to reveal documented evidence that patient's were wanded prior to changing into hospital gown per hospital policy.  Interview with EMP5 on September 14, 2023, at 11:20 AM confirmed the above findings. 8.  Interview with EMP2 on September 14, 2023, confirmed the expectation for nursing would be to document behavioral health patients are wanded on admission to the ED, changed into hospital gown, with belongings collected by staff and secured at the nurse's station, and admitted to a ligature free room.  Plan of Correction - To be completed: 12/31/2023  The Chief Medical Officer has ultimate responsibility of the compliance of this plan of correction.1.\tThe Director of the Emergency Department and Medical Director of the Emergency Department will educate staff (registered nurses and providers) on the following policies and procedures:a. Patient Rights and Responsibilityb. Guidelines to Follow for Behavioral Health Patients Who Refuse Care- (This education includes proper notification to the police if an elopement occurs.)c. Elopement Policy – (This education includes proper notification to the police regarding homicidal/suicidal threats made by a behavioral health patient and how to properly document with an event report.)Staff (registered nurse) will be educated on all policies mentioned above by December 18th, 2023.The Director of Quality, Chief Nursing Officer and Director of Emergency Department met to update the Behavioral Health Policy to outline the appropriate procedures and processes to meet the standard of care and regulatory requirements.The Director of Quality will have the updated Behavioral Health Policy taken through Medical Staff Peer Review Committee and Medical Executive Committee by December 13th, 2023, for appropriate approval process.The Director of the Emergency Department and Medical Director of the Emergency Department will educate staff(registered nurses and providers) on the new Behavioral Health Patient policy starting on December 14th, 2023, in a read and sign format. Education will be completed by December 28th, 2023.The Director of the Emergency Department will re-educate the emergency department staff (registered nurses) on the Behavioral Health Checklist to ensure that staff know they must do the following tasks when identifying a behavioral health patient.1.\tSecure patient room by mitigating ligature items.2.\tWand patient with metal detection device3.\tDe-robe patient and change into ligature free clothing. 4.\tRemove patient's personal belongings and secure them in a locker within ED proper.The staff (registered nurses) were educated by the Director of the Emergency Department on September 13th, 2023, however, will be re-educated on Behavioral Health Checklist mentioned above by the Director of the Emergency Department, by December 18th, 2023. All new hires and new agency staff (registered nurses) will be educated on the policies and procedures during their orientation period.The Director of the Emergency Department will re-educate the emergency department staff (registered nurses) on the Cerner Behavioral Health Documentation to ensure that staff know the required information they must document within EMAR (Cerner) when documenting on a Behavioral Health Patients. These required details include that the nursing did the following:1.\tSecured Room and Mitigated Ligature Risk2.\tWanded patient with a metal detection device3.\tDe-robed the patient and changed them into ligature free clothing.4.\tPatient's belongings were removed and secured.The staff (registered nurses) were educated by the Director of the Emergency Department on September 13th, 2023, however, will be re-educated on Cerner Behavioral Health Documentation mentioned above by the Director of the Emergency Department, by December 18th, 2023. All new hires and new agency staff (registered nurses) will be educated on the policies and procedures during their orientation period. Any noncompliant fallouts will be addressed immediately including implementations, orders or documentation will be corrected. All fallouts will be documented on the audit as they occur.Recurrent noncompliance regarding implementation of interventions or documentation will have an incident report (Converge) entered, and the standard disciplinary process will be executed by the ED RN DirectorStarting September 13th, 2023, the Director of the Emergency Department has been monitoring all Behavioral Health Charts to ensure the appropriate documentation and interventions have been completed. These interventions include:1.\tSecured Room and Mitigated Ligature Risk2.\tWanded patient with a metal detection device3.\tDe-robed the patient and changed them into ligature free clothing.4.\tPatient's belongings were removed and secured. Audits will continue by reviewing up to 30 charts per month by the Director of the Emergency Department /Designee to ensure that all required documentation and interventions are being completed on every behavioral health patient. Audit findings will be presented to the Safety Excellence Committee beginning in December 2023. The Audit findings will also be taken to the Board Quality Oversight Committee starting in December 2023. The overall targeted goal of compliance is 100%. Audits will continue until 100% compliance is met and sustained for 3 consecutive months."
        },
        {
            "eventid": "U52Z12",
            "date": "9/7/2023",
            "data": "Initial comments:This report is the result of a follow up survey conducted on September 7, 2023, with Penn Highlands Huntingdon, as the result of a complaint investigation survey that was conducted on May 10, 2023.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 1998.   Plan of Correction: Initial comments:This report is the result of a follow up survey conducted on September 7, 2023, with Penn Highlands Huntingdon, as the result of a complaint investigation survey that was conducted on May 10, 2023.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 1998.   Plan of Correction:"
        },
        {
            "eventid": "JVN711",
            "date": "8/10/2023",
            "data": "Initial comments:This report is the result of an unannounced offsite complaint investigation CHL23C49IJ completed on August 10, 2023 at Penn Highlands Huntingdon Hospital.  It was determined that the facility WAS in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced offsite complaint investigation CHL23C49IJ completed on August 10, 2023 at Penn Highlands Huntingdon Hospital.  It was determined that the facility WAS in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "ZVXZ11",
            "date": "8/9/2023",
            "data": "Initial comments:This report is the result of an unannounced offsite complaint investigation CHL23C449J completed on August 9, 2023, at Penn Highlands Huntingdon Hospital.  At the time of the investigation, the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced offsite complaint investigation CHL23C449J completed on August 9, 2023, at Penn Highlands Huntingdon Hospital.  At the time of the investigation, the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "1NHL11",
            "date": "7/24/2023",
            "data": "Initial comments:This report is the result of an unannounced offsite complaint investigation CHL23C415J completed on July 24, 2023, at Penn Highlands Huntingdon.  It was determined that the facility WAS in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced offsite complaint investigation CHL23C415J completed on July 24, 2023, at Penn Highlands Huntingdon.  It was determined that the facility WAS in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "L59F11",
            "date": "6/23/2023",
            "data": "Initial comments:This report is for replacement equipment, Omnicell XT Automated Dispensing Cabinets, beginning on June 7, 2023. The Penn Highlands Huntingdon attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is for replacement equipment, Omnicell XT Automated Dispensing Cabinets, beginning on June 7, 2023. The Penn Highlands Huntingdon attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "KZGV11",
            "date": "6/22/2023",
            "data": "Initial comments:This report is the result of an occupancy survey conducted on June 21, 2023, at Penn Highlands Huntingdon-Pinecroft which included Family Medicine, Rehabilitation Center, Ear, Nose and Throat services.   Based on the occupancy survey, it was determined the facility was in compliance with all applicable requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 1998 and the current edition of the Guidelines for Design and Construction of Hospital and Health Care Facilities. Plan of Correction: Initial comments:This report is the result of an occupancy survey conducted on June 21, 2023, at Penn Highlands Huntingdon-Pinecroft which included Family Medicine, Rehabilitation Center, Ear, Nose and Throat services.   Based on the occupancy survey, it was determined the facility was in compliance with all applicable requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 1998 and the current edition of the Guidelines for Design and Construction of Hospital and Health Care Facilities. Plan of Correction:"
        },
        {
            "eventid": "Y74B11",
            "date": "6/20/2023",
            "data": "Initial comments:This report is the result of an occupancy survey conducted on June 15, 2023, at Penn Highlands Huntingdon which the included Family Medicine/Qcare Services.  Based on the occupancy survey, it was determined the facility was in compliance with all applicable requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 1998 and the current edition of the Guidelines for Design and Construction of Hospital and Health Care Facilities. Plan of Correction: Initial comments:This report is the result of an occupancy survey conducted on June 15, 2023, at Penn Highlands Huntingdon which the included Family Medicine/Qcare Services.  Based on the occupancy survey, it was determined the facility was in compliance with all applicable requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 1998 and the current edition of the Guidelines for Design and Construction of Hospital and Health Care Facilities. Plan of Correction:"
        },
        {
            "eventid": "WBLC11",
            "date": "6/14/2023",
            "data": "Initial comments:This report is the result of an unannounced offsite complaint investigation CHL23C309J completed on June 14, 2023, at Penn Highlands Huntingdon.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced offsite complaint investigation CHL23C309J completed on June 14, 2023, at Penn Highlands Huntingdon.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "J05I11",
            "date": "6/7/2023",
            "data": "Initial comments:This report is the result of an unannounced onsite complaint investigation CHL23C186J completed on May 15, 2023, at Penn Highlands Huntingdon.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced onsite complaint investigation CHL23C186J completed on May 15, 2023, at Penn Highlands Huntingdon.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "0Y6A11",
            "date": "5/31/2023",
            "data": "Initial comments:This report is the result of an Occupancy survey concluding on January 25, 2023, at Penn Highlands Huntingdon, which included Penn Highlands Huntingdon Family Medicine, 478 Seminary Road., Cassville, PA.  Based on the Occupancy survey, it was determined the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for  for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998, and the current edition of the Guidelines for Design and Construction of Hospital and Health Care Facilities.  Plan of Correction: Initial comments:This report is the result of an Occupancy survey concluding on January 25, 2023, at Penn Highlands Huntingdon, which included Penn Highlands Huntingdon Family Medicine, 478 Seminary Road., Cassville, PA.  Based on the Occupancy survey, it was determined the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for  for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998, and the current edition of the Guidelines for Design and Construction of Hospital and Health Care Facilities.  Plan of Correction:"
        },
        {
            "eventid": "W9L211",
            "date": "5/24/2023",
            "data": "Initial comments:This report is the result of an unannounced offsite complaint investigation CHL23C170J completed on May 24, 2023, at Penn Highlands Huntingdon.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced offsite complaint investigation CHL23C170J completed on May 24, 2023, at Penn Highlands Huntingdon.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "1H9U11",
            "date": "5/24/2023",
            "data": "Initial comments:This report is the result of an occupancy survey conducted on May 15, 2023, at Penn Highlands Huntingdon which the included Behavioral Health Unit.  Based on the occupancy survey, it was determined the facility was in compliance with all applicable requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 1998 and the current edition of the Guidelines for Design and Construction of Hospital and Health Care Facilities. Plan of Correction: Initial comments:This report is the result of an occupancy survey conducted on May 15, 2023, at Penn Highlands Huntingdon which the included Behavioral Health Unit.  Based on the occupancy survey, it was determined the facility was in compliance with all applicable requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 1998 and the current edition of the Guidelines for Design and Construction of Hospital and Health Care Facilities. Plan of Correction:"
        },
        {
            "eventid": "W7YN11",
            "date": "5/24/2023",
            "data": "Initial comments:This report is the result of an occupancy survey conducted on May 15, 2023, at Penn Highlands Huntingdon which the included the outpatient Infusion Clinic.  Based on the occupancy survey, it was determined the facility was in compliance with all applicable requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 1998 and the current edition of the Guidelines for Design and Construction of Hospital and Health Care Facilities. Plan of Correction: Initial comments:This report is the result of an occupancy survey conducted on May 15, 2023, at Penn Highlands Huntingdon which the included the outpatient Infusion Clinic.  Based on the occupancy survey, it was determined the facility was in compliance with all applicable requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 1998 and the current edition of the Guidelines for Design and Construction of Hospital and Health Care Facilities. Plan of Correction:"
        },
        {
            "eventid": "FWZI11",
            "date": "3/27/2023",
            "data": "Initial comments:This report is the result of an unannounced offsite complaint investigation CHL23CII8J completed on March 27, 2023, at Penn Highlands Huntingdon.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced offsite complaint investigation CHL23CII8J completed on March 27, 2023, at Penn Highlands Huntingdon.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "TCFU11",
            "date": "3/5/2023",
            "data": "Initial comments:This report is the result of an unannounced onsite complaint investigation CHL22C898J completed on March 5, 2023, at Penn Highlands Huntingdon.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced onsite complaint investigation CHL22C898J completed on March 5, 2023, at Penn Highlands Huntingdon.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "U52Z11",
            "date": "2/28/2023",
            "data": "Initial comments:This report is the result of a special monitoring investigation (CHL22C901J) concluding on February 28, 2023, at Penn Highlands Huntingdon.  It was determined that the facility was not in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of a special monitoring investigation (CHL22C901J) concluding on February 28, 2023, at Penn Highlands Huntingdon.  It was determined that the facility was not in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: 117.41 (a) LICENSURE EMERGENCY PATIENT CARE:117.41  Emergency patient care (a) Emergency patient care shall be guided by written policies and procedures which delineate the proper administrative and medical procedures and methods to be followed in providing emergency care. These policies and procedures shall be clear and explicit; approved by the medical staff and hospital governing body; reviewed annually, revised as necessary; and dated to indicate the date of the latest review or revision, or both.Observations:Based on review of facility documents and medical records (MR1), it was determined that the facility failed to ensure that a patient presenting to the Emergency Department (ED), with chest pain was immediately taken to the treatment area/resuscitation room  for one of one medical records reviewed. (MR1) Findings include: Review of policy entitled \"Chest Pain/Cardiac Emergencies\" dated April 9, 2010, revealed,\"Patients presenting to the ED with current complaint or recent history of dyspnea, chest pain or discomfort, associated symptoms of angina, arm, jaw pain, exertional SOB, diaphoresis, N/V associated with chest pain or discomfort, past medical history of MI, CABG/Valve replacement and symptomatic will be:  Guidelines Notify Physician immediately and evaluate together when possible 1.  Take immediately to treatment area/resuscitation room ... .\" 1.  During a telephone interview with EMP1, EMP2, and EMP3 on November 10, 2022, EMP2 stated that  PT1 registered at 1633 (September 6, 2022), and PT1 had mild chest pain and pain in right shoulder, and was noted to be non-alert at 1643 in the ED waiting room.  2. Review of the ED Log, revealed the patient (PT1) associated with MR1 was placed on the log on September 6, 2022, at 1633 with complaint of mild chest and right arm pain. 3. Review of MR1 revealed physician documentation dated September 6, 2022, which stated PT1 presents to the ED complaining of chest pain and slight pain in the right arm, and that while in waiting room, patient was noted to be unresponsive, was pulseless and PT1 brought  into the department to code. Continued review of MR1 revealed a Code Blue record dated September 6, 2022, which documented Room number as WR (waiting room), and documented time of arrest as 1645.  Plan of Correction - To be completed: 05/10/2023The ED director will provide educational materials to ED registration, ED Nursing Staff, and ED providers describing the following process related to patients arriving with chest pain and associated cardiac symptoms. This education will begin April 24th, 2023 and be completed by May 10th, 2023. This education will include the process as noted below. ED Nursing and ED Provider staff will also sign off on a review of the EMR Chest Pain order set for their understanding of the protocol. 1.\tThe ED registration clerk calls the ED charge/triage nurse upon arrival of an ED patient to registration while simultaneously adding the patient to the registry. The Ed Registration clerk will log time that call was made to ED charge/triage nurse.2.\tThe ED charge/triage nurse responds directly to triage. For a chest pain (&/or cardiac associated symptoms) patient; the nurse brings the patient to an ED room or hallway bed (whichever is available). An EKG is done and immediately shown to the ED provider for review. The expectation of movement from \"ED arrival to EKG completion to ED provider review\" is a goal of 10 minutes. 3.\tED nurse completes the remainder of the triage documentation. 4.\tThe ED RN proceeds with the cardiac patient order set as indicated in the EMR and/or follows the ED provider's orders as directed based on EKG review. 5.\tStarting on May 11th 2023, the ED director will audit 50 charts per month for(numerator) ED provider signature & time on completed EKG within 10 minutes of arrival/ (denominator) total chest pain arrivals to ED. The ED Director will also review the call log and compare to results of audit. The ED director will address all patients falling out of the 10 minutes' goal with staff involved to determine the cause. Identified causes will be documented with actions to correct noted on the audit tool. Audits will continue monthly until a target of 100% compliance is achieved for three consecutive months. The target goal to achieve 100% compliance is August 2023. Starting in June 2023, The ED Director will report overall compliance of audits monthly at  the Safety Excellence Committee until compliance goal of 100% for 3 consecutive months is met. 117.41 (a) LICENSURE EMERGENCY PATIENT CARE: 117.41  Emergency patient care (a) Emergency patient care shall be guided by written policies and procedures which delineate the proper administrative and medical procedures and methods to be followed in providing emergency care. These policies and procedures shall be clear and explicit; approved by the medical staff and hospital governing body; reviewed annually, revised as necessary; and dated to indicate the date of the latest review or revision, or both. Observations:Based on review of facility documents and medical records (MR1), it was determined that the facility failed to ensure that a patient presenting to the Emergency Department (ED), with chest pain was immediately taken to the treatment area/resuscitation room  for one of one medical records reviewed. (MR1) Findings include: Review of policy entitled \"Chest Pain/Cardiac Emergencies\" dated April 9, 2010, revealed,\"Patients presenting to the ED with current complaint or recent history of dyspnea, chest pain or discomfort, associated symptoms of angina, arm, jaw pain, exertional SOB, diaphoresis, N/V associated with chest pain or discomfort, past medical history of MI, CABG/Valve replacement and symptomatic will be:  Guidelines Notify Physician immediately and evaluate together when possible 1.  Take immediately to treatment area/resuscitation room ... .\" 1.  During a telephone interview with EMP1, EMP2, and EMP3 on November 10, 2022, EMP2 stated that  PT1 registered at 1633 (September 6, 2022), and PT1 had mild chest pain and pain in right shoulder, and was noted to be non-alert at 1643 in the ED waiting room.  2. Review of the ED Log, revealed the patient (PT1) associated with MR1 was placed on the log on September 6, 2022, at 1633 with complaint of mild chest and right arm pain. 3. Review of MR1 revealed physician documentation dated September 6, 2022, which stated PT1 presents to the ED complaining of chest pain and slight pain in the right arm, and that while in waiting room, patient was noted to be unresponsive, was pulseless and PT1 brought  into the department to code. Continued review of MR1 revealed a Code Blue record dated September 6, 2022, which documented Room number as WR (waiting room), and documented time of arrest as 1645.  Plan of Correction - To be completed: 05/10/2023The ED director will provide educational materials to ED registration, ED Nursing Staff, and ED providers describing the following process related to patients arriving with chest pain and associated cardiac symptoms. This education will begin April 24th, 2023 and be completed by May 10th, 2023. This education will include the process as noted below. ED Nursing and ED Provider staff will also sign off on a review of the EMR Chest Pain order set for their understanding of the protocol. 1.\tThe ED registration clerk calls the ED charge/triage nurse upon arrival of an ED patient to registration while simultaneously adding the patient to the registry. The Ed Registration clerk will log time that call was made to ED charge/triage nurse.2.\tThe ED charge/triage nurse responds directly to triage. For a chest pain (&/or cardiac associated symptoms) patient; the nurse brings the patient to an ED room or hallway bed (whichever is available). An EKG is done and immediately shown to the ED provider for review. The expectation of movement from \"ED arrival to EKG completion to ED provider review\" is a goal of 10 minutes. 3.\tED nurse completes the remainder of the triage documentation. 4.\tThe ED RN proceeds with the cardiac patient order set as indicated in the EMR and/or follows the ED provider's orders as directed based on EKG review. 5.\tStarting on May 11th 2023, the ED director will audit 50 charts per month for(numerator) ED provider signature & time on completed EKG within 10 minutes of arrival/ (denominator) total chest pain arrivals to ED. The ED Director will also review the call log and compare to results of audit. The ED director will address all patients falling out of the 10 minutes' goal with staff involved to determine the cause. Identified causes will be documented with actions to correct noted on the audit tool. Audits will continue monthly until a target of 100% compliance is achieved for three consecutive months. The target goal to achieve 100% compliance is August 2023. Starting in June 2023, The ED Director will report overall compliance of audits monthly at  the Safety Excellence Committee until compliance goal of 100% for 3 consecutive months is met."
        },
        {
            "eventid": "WMHO11",
            "date": "1/27/2023",
            "data": "Initial comments:This report is for replacement equipment, LifePak 1000, beginning on January 13, 2023. Penn Highlands Huntingdon attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is for replacement equipment, LifePak 1000, beginning on January 13, 2023. Penn Highlands Huntingdon attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "Y60N11",
            "date": "1/18/2023",
            "data": "Initial comments:This report is for the new service, Penn Highlands Neurology & Sleep Medicine, beginning on December 19, 2022. The Penn Highlands Huntingdon attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is for the new service, Penn Highlands Neurology & Sleep Medicine, beginning on December 19, 2022. The Penn Highlands Huntingdon attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "I8Q611",
            "date": "1/15/2023",
            "data": "Initial comments:This report is for replacement equipment, Siemens CIOS Flow C-Arm, beginning on November 7, 2022. The Penn Highlands Huntingdon attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is for replacement equipment, Siemens CIOS Flow C-Arm, beginning on November 7, 2022. The Penn Highlands Huntingdon attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "MXIO11",
            "date": "1/15/2023",
            "data": "Initial comments:This report is the result of an occupancy survey concluding on January 15, 2023, at Penn Highlands Huntingdon, which included Alterations to replace Cath Lab Equipment and renovate the room on the second floor of the Main Hospital.  It was determined that the facility was  in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 1998, and the current edition of the Guidelines for Design and Construction of Hospital and Health Care Facilities.  Plan of Correction: Initial comments:This report is the result of an occupancy survey concluding on January 15, 2023, at Penn Highlands Huntingdon, which included Alterations to replace Cath Lab Equipment and renovate the room on the second floor of the Main Hospital.  It was determined that the facility was  in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 1998, and the current edition of the Guidelines for Design and Construction of Hospital and Health Care Facilities.  Plan of Correction:"
        },
        {
            "eventid": "H99N11",
            "date": "1/15/2023",
            "data": "Initial comments:This report is for replacement equipment, Echo Machine, beginning on January 11, 2023. The Penn Highlands Huntingdon attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is for replacement equipment, Echo Machine, beginning on January 11, 2023. The Penn Highlands Huntingdon attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "JUCU11",
            "date": "1/15/2023",
            "data": "Initial comments:This report is the result of an occupancy survey concluding on January 15, 2023, at Penn Highlands Huntingdon, which included New Service-Penn Highlands Gynecology and renovations to convert a soiled holding room into a soiled workroom, 1227 Warm Springs Avenue, Suite 302, Huntingdon, PA.  It was determined that the facility was  in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 1998, and the current edition of the Guidelines for Design and Construction of Hospital and Health Care Facilities.  Plan of Correction: Initial comments:This report is the result of an occupancy survey concluding on January 15, 2023, at Penn Highlands Huntingdon, which included New Service-Penn Highlands Gynecology and renovations to convert a soiled holding room into a soiled workroom, 1227 Warm Springs Avenue, Suite 302, Huntingdon, PA.  It was determined that the facility was  in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 1998, and the current edition of the Guidelines for Design and Construction of Hospital and Health Care Facilities.  Plan of Correction:"
        }
    ]
}