{
    "facility": "GOOD SHEPHERD SPECIALTY HOSPITAL",
    "data": [
        {
            "eventid": "B76W12",
            "date": "1/18/2024",
            "data": "Initial comments:This report is the result of an unannounced offsite revisit survey initiated on January 16, 2024, and completed on January 18, 2024, following an unannounced complaint investigation (CHL23C555V) initiated offsite on August 16, 2023, and completed offsite on September 14, 2023, at Good Shepherd Specialty Hospital.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced offsite revisit survey initiated on January 16, 2024, and completed on January 18, 2024, following an unannounced complaint investigation (CHL23C555V) initiated offsite on August 16, 2023, and completed offsite on September 14, 2023, at Good Shepherd Specialty Hospital.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "830U11",
            "date": "12/14/2023",
            "data": "Initial comments:This report is the result of a full on-site Medicare recertification survey initiated on December 12, 2023, to December 14, 2023, at Good Shepherd Specialty Hospital.  It was determined that the facility was not in compliance with the requirements of 42 CFR, Title 42, Part 482 - Conditions of Participation for Hospitals. Plan of Correction: Initial comments:This report is the result of a full on-site Medicare recertification survey initiated on December 12, 2023, to December 14, 2023, at Good Shepherd Specialty Hospital.  It was determined that the facility was not in compliance with the requirements of 42 CFR, Title 42, Part 482 - Conditions of Participation for Hospitals. Plan of Correction: 482.21 CONDITION QAPI:The hospital must develop, implement and maintain an effective, ongoing, hospital-wide, data-driven quality assessment and performance improvement program.The hospital's governing body must ensure that the program reflects the complexity of the hospital's organization and services; involves all hospital departments and services (including those services furnished under contract or arrangement); and focuses on indicators related to improved health outcomes and the prevention and reduction of medical errors.The hospital must maintain and demonstrate evidence of its QAPI program for review by CMS.Observations:Based on the systemic nature of the standard level deficiencies related to Quality Assessment and Performance Improvement, the facility failed to substantially comply with this condition.  Findings include:The following standards were cited and show a systemic nature of non-compliance with regards to Quality Assessment and Performance Improvement as follows:Standard: Program ScopeStandard: Performance Improvement Projects. Plan of Correction - To be completed: 02/23/2024An organized, structured and cohesive committeededicated to QAPI will meet monthly starting inJanuary, 2024. The committee will consist ofmulti-disciplinary members including, but not limited tonursing, rehabilitation therapy, respiratory therapy,case management, and leadership.   The purpose of thismeeting is to report on status of current PI projectstoward expected goals, receive feedback from thecommittee on next steps, and propose any new areasfor improvement.The framework for Good Shepherd Specialty's QAPIplan will be the PDCA model. The projects will bedeveloped from our Strategic Operations Plan, includingbut not limited to, ventilator weaning, ventilator patientmobility, returns to acute, hospital acquired pressureinjuries.The ongoing results of the PI projects will be reportedto medical executive committee on a monthly basis, Good ShepherdSpecialty Board of Directors on a quarterly basis and shared with front linestaff at a minimum of monthly. This plan will be monitored for assurance of compliance by the Good Shepherd Specialty Hospital Administrator who also will ensure sustainability by incorporating elements into the hospital strategic operations plan. 482.21 CONDITION QAPI: The hospital must develop, implement and maintain an effective, ongoing, hospital-wide, data-driven quality assessment and performance improvement program.The hospital's governing body must ensure that the program reflects the complexity of the hospital's organization and services; involves all hospital departments and services (including those services furnished under contract or arrangement); and focuses on indicators related to improved health outcomes and the prevention and reduction of medical errors.The hospital must maintain and demonstrate evidence of its QAPI program for review by CMS. Observations:Based on the systemic nature of the standard level deficiencies related to Quality Assessment and Performance Improvement, the facility failed to substantially comply with this condition.  Findings include:The following standards were cited and show a systemic nature of non-compliance with regards to Quality Assessment and Performance Improvement as follows:Standard: Program ScopeStandard: Performance Improvement Projects. Plan of Correction - To be completed: 02/23/2024An organized, structured and cohesive committeededicated to QAPI will meet monthly starting inJanuary, 2024. The committee will consist ofmulti-disciplinary members including, but not limited tonursing, rehabilitation therapy, respiratory therapy,case management, and leadership.   The purpose of thismeeting is to report on status of current PI projectstoward expected goals, receive feedback from thecommittee on next steps, and propose any new areasfor improvement.The framework for Good Shepherd Specialty's QAPIplan will be the PDCA model. The projects will bedeveloped from our Strategic Operations Plan, includingbut not limited to, ventilator weaning, ventilator patientmobility, returns to acute, hospital acquired pressureinjuries.The ongoing results of the PI projects will be reportedto medical executive committee on a monthly basis, Good ShepherdSpecialty Board of Directors on a quarterly basis and shared with front linestaff at a minimum of monthly. This plan will be monitored for assurance of compliance by the Good Shepherd Specialty Hospital Administrator who also will ensure sustainability by incorporating elements into the hospital strategic operations plan. 482.21(a), (b)(1),(b)(2)(i), (b)(3) STANDARD DATA COLLECTION & ANALYSIS:(a) Program Scope(1) The program must include, but not be limited to, an ongoing program that shows measurable improvement in indicators for which there is evidence that it will improve health outcomes ...  (2) The hospital must measure, analyze, and track quality indicators ... and other aspects of performance that assess processes of care, hospital service and operations.(b)Program Data(1) The program must incorporate quality indicator data including patient care data, and other relevant data such as data submitted to or received from Medicare quality reporting and quality performance programs, including but not limited to data related to hospital readmissions and hospital-acquired conditions.(2) The hospital must use the data collected to--     (i)  Monitor the effectiveness and safety of services and quality of care; and .... (3) The frequency and detail of data collection must be specified by the hospital's governing body.Observations:Based on review of facility policies and procedures, facility documents, and interviews with staff (EMP), it was determined the facility failed to ensure the program measured, analyzed, and tracked quality indicators for contracted services.  Findings include: Review on December 13, 2023, of the facility's \"Performance Improvement Plan Qaulity Assessment & Performance Improvement (QAPI) plan\" dated 2023, revealed \"... Design & Scope ... 2. Scope: QAPI activities will be integrated across all the care and service areas of our organization ... 3. Objectives: ... All departments and services will be involved in Performance Improvement activities ... 4. Quality Assurance: We will have a committee that will review data from areas of the organization on a monthly basis to assure systems are being monitored and maintained to achieve the highest level of quality for our organization ... Performance Improvement Projects (PIPs) 13. As part of our QAPI program, we will conduct Performance Improvement Projects ... We will document what projects are being conducted, the reason for conducting the projects and the measurable progress achieved on the projects ...\"  A request was made to EMP1 on December 13, 2023, for the facility's contracted services quality indicators.  None was provided.  Interview with EMP1 on Decmeber 13, 2023, at 11:40 AM, confirmed there is no measuring, analyzing, and tracking of quality indicators for the following contracted service areas: laboratory, radiology, dietary services, pharmaceutical services, envionmental services and dialysis services.   Plan of Correction - To be completed: 02/23/2024Program data will be collected to monitor the effectiveness,safety of services, and quality of care on a monthly basis.Data collected will be used to identify opportunities ofcontinuous and ongoing improvement as well as mechanismsfor change to improve safety and quality for patients served.Data will be collected and reported on a balanced score cardon a monthly basis, starting in January 2024.  Measures will align with the initiatives from the strategic operational plan.  Performance Improvement progress and outcomes will be shared with all staff at Town Halls, Safety Huddles, Staff Meetings, and with Senior Leadership. Process Improvement and Outcomes Oversight Committee(PIOOC) will meet monthly for three months starting onJanuary 23,2024 and then quarterly thereafter.During this meeting contracted providers of service toGood Shepherd Specialty's patients will report on theiradherence to established Key Performance Indicators.Contracted providers not meeting the Key PerformanceIndicators will come prepared to report on their actionplan to improve the delivery of service. Consistentlyunderperforming contracted providers will be escalatedto Good Shepherd Contracting for review.Contracted Providers include but not limited to:-Sodexo Food Service-Sodexo Nutritional-Crothall Environmental Services-Lehigh Valley Hospital Pharmacy-Health Network Laboratory-Lehigh Valley Radiology-Fresenius DialysisOutcomes from the PIOOC will be reported to GoodShepherd Specialty's Medical Executive Committee, GoodShepherd Specialty's Board of Directors. and ProfessionalRelations/Quality Oversight Committee.This plan will be monitored for assurance of compliance by the Good Shepherd Specialty Hospital Administrator who also will ensure sustainability by incorporating elements into the hospital strategic operations plan. 482.21(a), (b)(1),(b)(2)(i), (b)(3) STANDARD DATA COLLECTION & ANALYSIS: (a) Program Scope(1) The program must include, but not be limited to, an ongoing program that shows measurable improvement in indicators for which there is evidence that it will improve health outcomes ...  (2) The hospital must measure, analyze, and track quality indicators ... and other aspects of performance that assess processes of care, hospital service and operations.(b)Program Data(1) The program must incorporate quality indicator data including patient care data, and other relevant data such as data submitted to or received from Medicare quality reporting and quality performance programs, including but not limited to data related to hospital readmissions and hospital-acquired conditions.(2) The hospital must use the data collected to--     (i)  Monitor the effectiveness and safety of services and quality of care; and .... (3) The frequency and detail of data collection must be specified by the hospital's governing body. Observations:Based on review of facility policies and procedures, facility documents, and interviews with staff (EMP), it was determined the facility failed to ensure the program measured, analyzed, and tracked quality indicators for contracted services.  Findings include: Review on December 13, 2023, of the facility's \"Performance Improvement Plan Qaulity Assessment & Performance Improvement (QAPI) plan\" dated 2023, revealed \"... Design & Scope ... 2. Scope: QAPI activities will be integrated across all the care and service areas of our organization ... 3. Objectives: ... All departments and services will be involved in Performance Improvement activities ... 4. Quality Assurance: We will have a committee that will review data from areas of the organization on a monthly basis to assure systems are being monitored and maintained to achieve the highest level of quality for our organization ... Performance Improvement Projects (PIPs) 13. As part of our QAPI program, we will conduct Performance Improvement Projects ... We will document what projects are being conducted, the reason for conducting the projects and the measurable progress achieved on the projects ...\"  A request was made to EMP1 on December 13, 2023, for the facility's contracted services quality indicators.  None was provided.  Interview with EMP1 on Decmeber 13, 2023, at 11:40 AM, confirmed there is no measuring, analyzing, and tracking of quality indicators for the following contracted service areas: laboratory, radiology, dietary services, pharmaceutical services, envionmental services and dialysis services.   Plan of Correction - To be completed: 02/23/2024Program data will be collected to monitor the effectiveness,safety of services, and quality of care on a monthly basis.Data collected will be used to identify opportunities ofcontinuous and ongoing improvement as well as mechanismsfor change to improve safety and quality for patients served.Data will be collected and reported on a balanced score cardon a monthly basis, starting in January 2024.  Measures will align with the initiatives from the strategic operational plan.  Performance Improvement progress and outcomes will be shared with all staff at Town Halls, Safety Huddles, Staff Meetings, and with Senior Leadership. Process Improvement and Outcomes Oversight Committee(PIOOC) will meet monthly for three months starting onJanuary 23,2024 and then quarterly thereafter.During this meeting contracted providers of service toGood Shepherd Specialty's patients will report on theiradherence to established Key Performance Indicators.Contracted providers not meeting the Key PerformanceIndicators will come prepared to report on their actionplan to improve the delivery of service. Consistentlyunderperforming contracted providers will be escalatedto Good Shepherd Contracting for review.Contracted Providers include but not limited to:-Sodexo Food Service-Sodexo Nutritional-Crothall Environmental Services-Lehigh Valley Hospital Pharmacy-Health Network Laboratory-Lehigh Valley Radiology-Fresenius DialysisOutcomes from the PIOOC will be reported to GoodShepherd Specialty's Medical Executive Committee, GoodShepherd Specialty's Board of Directors. and ProfessionalRelations/Quality Oversight Committee.This plan will be monitored for assurance of compliance by the Good Shepherd Specialty Hospital Administrator who also will ensure sustainability by incorporating elements into the hospital strategic operations plan. 482.21(d) STANDARD QAPI PERFORMANCE IMPROVEMENT PROJECTS:As part of its quality assessment and performance improvement program, the hospital must conduct performance improvement projects.(1) The number and scope of distinct improvement projects conducted annually must be proportional to the scope and complexity of the hospital's services and operations. (2) A hospital may, as one of its projects, develop and implement an information technology system explicitly designed to improve patient safety and quality of care.  This project, in its initial stage of development, does not need to demonstrate measurable improvement in indicators related to health outcomes.(3) The hospital must document what quality improvement projects are being conducted, the reasons for conducting these projects, and the measurable progress achieved on these projects. (4) A hospital is not required to participate in a QIO cooperative project, but its own projects are required to be of comparable effort. Observations:Based on review of facility policies and procedures, facility documents, and interviews with staff (EMP), it was determined the facility failed to ensure it conducted performance improvement projects related to its contracted services.  Findings include: Review on December 13, 2023, of the facility's \"Performance Improvement Plan Qaulity Assessment & Performance Improvement (QAPI) plan\" dated 2023, revealed \"... Design & Scope ... 2. Scope: QAPI activities will be integrated across all the care and service areas of our organization ... 3. Objectives: ... All departments and services will be involved in Performance Improvement activities ... 4. Quality Assurance: We will have a committee that will review data from areas of the organization on a monthly basis to assure systems are being monitored and maintained to achieve the highest level of quality for our organization ... Performance Improvement Projects (PIPs) 13. As part of our QAPI program, we will conduct Performance Improvement Projects ... We will document what projects are being conducted, the reason for conducting the projects and the measurable progress achieved on the projects ...\"  A request was made to EMP1 on December 13, 2023, for the facility's performance improvement projects related to its contracted services.  None was provided.  Interview with EMP1 on Decmeber 13, 2023, at 11:40 AM, confirmed there were no performance improvement projects conducted for the following contracted service areas: laboratory, radiology, dietary services, pharmaceutical services, envionmental services and dialysis services.   Plan of Correction - To be completed: 02/23/2024Performance improvement projects will be prioritizedbased upon the current needs of the patients in ourorganization by the QAPI committee. A team will bedesigned to give opportunity to all staff in theorganization and ensure the team is interdisciplinary.Teams will follow the PDCA (Plan-Do-Check-Act) format.  Collected data allows the interdisciplinary team to evaluate effectiveness of Performance Improvement Projects and revise tactics based on outcomes.  Information about Performance Improvement Projects will be shared with the team during monthly meetings. All staff will learn of the project during monthly staff meetings and daily huddles on a regular basis.This plan will be monitored for assurance of compliance by the Good Shepherd Specialty Hospital Administrator. 482.21(d) STANDARD QAPI PERFORMANCE IMPROVEMENT PROJECTS: As part of its quality assessment and performance improvement program, the hospital must conduct performance improvement projects.(1) The number and scope of distinct improvement projects conducted annually must be proportional to the scope and complexity of the hospital's services and operations. (2) A hospital may, as one of its projects, develop and implement an information technology system explicitly designed to improve patient safety and quality of care.  This project, in its initial stage of development, does not need to demonstrate measurable improvement in indicators related to health outcomes.(3) The hospital must document what quality improvement projects are being conducted, the reasons for conducting these projects, and the measurable progress achieved on these projects. (4) A hospital is not required to participate in a QIO cooperative project, but its own projects are required to be of comparable effort. Observations:Based on review of facility policies and procedures, facility documents, and interviews with staff (EMP), it was determined the facility failed to ensure it conducted performance improvement projects related to its contracted services.  Findings include: Review on December 13, 2023, of the facility's \"Performance Improvement Plan Qaulity Assessment & Performance Improvement (QAPI) plan\" dated 2023, revealed \"... Design & Scope ... 2. Scope: QAPI activities will be integrated across all the care and service areas of our organization ... 3. Objectives: ... All departments and services will be involved in Performance Improvement activities ... 4. Quality Assurance: We will have a committee that will review data from areas of the organization on a monthly basis to assure systems are being monitored and maintained to achieve the highest level of quality for our organization ... Performance Improvement Projects (PIPs) 13. As part of our QAPI program, we will conduct Performance Improvement Projects ... We will document what projects are being conducted, the reason for conducting the projects and the measurable progress achieved on the projects ...\"  A request was made to EMP1 on December 13, 2023, for the facility's performance improvement projects related to its contracted services.  None was provided.  Interview with EMP1 on Decmeber 13, 2023, at 11:40 AM, confirmed there were no performance improvement projects conducted for the following contracted service areas: laboratory, radiology, dietary services, pharmaceutical services, envionmental services and dialysis services.   Plan of Correction - To be completed: 02/23/2024Performance improvement projects will be prioritizedbased upon the current needs of the patients in ourorganization by the QAPI committee. A team will bedesigned to give opportunity to all staff in theorganization and ensure the team is interdisciplinary.Teams will follow the PDCA (Plan-Do-Check-Act) format.  Collected data allows the interdisciplinary team to evaluate effectiveness of Performance Improvement Projects and revise tactics based on outcomes.  Information about Performance Improvement Projects will be shared with the team during monthly meetings. All staff will learn of the project during monthly staff meetings and daily huddles on a regular basis.This plan will be monitored for assurance of compliance by the Good Shepherd Specialty Hospital Administrator. 482.57 CONDITION RESPIRATORY CARE SERVICES:The hospital must meet the needs of the patients in accordance with acceptable standards of practice.  The following requirements apply if the hospital provides respiratory care services.Observations:Based on the systemic nature of the standard level deficiencies related to Respiratory Services, the facility failed to substantially comply with this condition.  Findings include:The following standards were cited and show a systemic nature of non-compliance with regards to Respiratory Services as follows:- There must be a director of respiratory care services who is a doctor of medicine or osteopathy with the knowledge, experience and capabilities to supervise and administer the service properly. The director may serve on either a full-time or part-time basis.Standard: Delivery of ServicesAll respiratory care services orders must be documented in the patient ' s medical record in accordance with the requirements at \\'a7482.24. Plan of Correction - To be completed: 02/23/2024The Medical Director of Good Shepherd Specialty Hospital, Mahesh Krishnamurthy, MD is the Physician in charge of Respiratory Therapy. A resolution adopted by the GSSH  Board of Trustees will be presented to the BOT Committee for vote and documentation. This will occur no later than 1/28/2024. This plan will be monitored for assurance of compliance by the Good Shepherd Specialty Hospital Administrator.  Once approved by the BOT the Medical Directors job description and contract will be altered to reflect this change. 482.57 CONDITION RESPIRATORY CARE SERVICES: The hospital must meet the needs of the patients in accordance with acceptable standards of practice.  The following requirements apply if the hospital provides respiratory care services. Observations:Based on the systemic nature of the standard level deficiencies related to Respiratory Services, the facility failed to substantially comply with this condition.  Findings include:The following standards were cited and show a systemic nature of non-compliance with regards to Respiratory Services as follows:- There must be a director of respiratory care services who is a doctor of medicine or osteopathy with the knowledge, experience and capabilities to supervise and administer the service properly. The director may serve on either a full-time or part-time basis.Standard: Delivery of ServicesAll respiratory care services orders must be documented in the patient ' s medical record in accordance with the requirements at \\'a7482.24. Plan of Correction - To be completed: 02/23/2024The Medical Director of Good Shepherd Specialty Hospital, Mahesh Krishnamurthy, MD is the Physician in charge of Respiratory Therapy. A resolution adopted by the GSSH  Board of Trustees will be presented to the BOT Committee for vote and documentation. This will occur no later than 1/28/2024. This plan will be monitored for assurance of compliance by the Good Shepherd Specialty Hospital Administrator.  Once approved by the BOT the Medical Directors job description and contract will be altered to reflect this change. 482.57(a)(1) STANDARD DIRECTOR OF RESPIRATORY SERVICES:There must be a director of respiratory care services who is a doctor of medicine or osteopathy with the knowledge, experience and capabilities to supervise and administer the service properly.  The director may serve on either a full-time or part-time basis.Observations:Based on review of facility documents, and interviews with staff (EMP), it was determined the facility failed to designate a director of respiratory care services who is a Doctor of Medicine or osteopathy with the knowledge, experience, and capabilities to supervise and administer the service properly.  Review on December 13, 2023, of facility document  \"Good Shepherd Specialty Hospital Medical Staff Bylaws\"  revised June 22, 2021, revealed no designation of a director of respiratory care services. A request was made on December 13, 2023, at 10:30 AM to EMP3 for the job description of director of respiratory care services.  None provided.Interview on December 13, 2023, at 11:36 AM with EMP3 confrimed the facility did not designate a director of respiratory services who is a Doctor of Medicine or osteopathy.   Plan of Correction - To be completed: 02/23/2024 The Medical Director of Good Shepherd Specialty Hospital, Mahesh Krishnamurthy, MD is the Physician in charge of Respiratory Therapy. A resolution adopted by the GSSH Board of Trustees will be presented to the BOT Committee for vote and documentation. This will occur no later than 1/28/2024.This plan will be monitored for assurance of compliance by the Good Shepherd Specialty Hospital Administrator. Once approved by the BOT the Medical Directors job description and contract will be altered to reflect this change. 482.57(a)(1) STANDARD DIRECTOR OF RESPIRATORY SERVICES: There must be a director of respiratory care services who is a doctor of medicine or osteopathy with the knowledge, experience and capabilities to supervise and administer the service properly.  The director may serve on either a full-time or part-time basis. Observations:Based on review of facility documents, and interviews with staff (EMP), it was determined the facility failed to designate a director of respiratory care services who is a Doctor of Medicine or osteopathy with the knowledge, experience, and capabilities to supervise and administer the service properly.  Review on December 13, 2023, of facility document  \"Good Shepherd Specialty Hospital Medical Staff Bylaws\"  revised June 22, 2021, revealed no designation of a director of respiratory care services. A request was made on December 13, 2023, at 10:30 AM to EMP3 for the job description of director of respiratory care services.  None provided.Interview on December 13, 2023, at 11:36 AM with EMP3 confrimed the facility did not designate a director of respiratory services who is a Doctor of Medicine or osteopathy.   Plan of Correction - To be completed: 02/23/2024 The Medical Director of Good Shepherd Specialty Hospital, Mahesh Krishnamurthy, MD is the Physician in charge of Respiratory Therapy. A resolution adopted by the GSSH Board of Trustees will be presented to the BOT Committee for vote and documentation. This will occur no later than 1/28/2024.This plan will be monitored for assurance of compliance by the Good Shepherd Specialty Hospital Administrator. Once approved by the BOT the Medical Directors job description and contract will be altered to reflect this change. 482.57(b) STANDARD RESPIRATORY CARE SERVICES POLICIES:Services must be delivered in accordance with medical staff directives.Observations:Based on review of medical records (MR), facility policy and procedures, and interviews with staff (EMP), it was determined the facility failed to adhere to its Respiratory Care Services established policies and procedures for two (2) out of five (5) respiratory medical records reviewed (MR12 and MR13). Review of MR12 on December 12, 2023, revealed tracheostomy care was documented as completed one time, at 2:10 AM, over two shifts on September 2, 2023. Review of MR13 on December 12, 2023, revealed tracheostomy care was documented as completed one time, at 3:20 AM, over two shifts on September 2, 2023. Review on December 13, 2023, of facility policy,  \" Tracheostomy Care\", dated December 2022, revealed,  \" ...C Changing Tracheostomy Tube Dressing...should be changed whenever soiled and/or every shift.\"Interview on December 12, 2023, at 1:59 PM with EMP1 confirmed MR12 did not have progress note regarding omitted tracheostomy care on September 2, 2023.Interview on December 12, 2023, at 2:07 PM with EMP1 confirmed MR13 did not have progress note regarding omitted tracheostomy care on September 2, 2023Interview on December 13, 2023, at 12:34 PM with EMP1 confirmed the Respiratory department staff work 12-hour shifts. Further interview with EMP1 confirmed that tracheostomy care should be completed and documented twice per 24-hour period.  Plan of Correction - To be completed: 02/23/2024Audit Respiratory Therapy Treatment Logs in medical records of all inpatients for  100% compliance with documentation of delivering therapies according to providers' orders. Auditing to be performed daily from 12/26/2023 to 1/09/2024, then weekly from 1/15/2024 to 2/10/2024, then monthly from 2/11/2024 until 6/30/2024 or until 3 consecutive months of 100% compliance is achievedRedesign Respiratory Therapy Treatment Log to facilitate compliance with documentation of respiratory services. Standardize language to promote proper and consistent documentation. Approve form through HIM for use. Educate 100% of   Respiratory Therapy staff on proper completion of updated Respiratory Therapy Treatment Log.  Education to be done in-person, by Webex and via learning management system. Document education of 100% of respiratory therapy staff. Educate all staff on new location of Respiratory Therapy Treatment Log in medical record. Education to be done in-person, at staff meetings, huddles, electronic messaging and learning management system. Document education of 100% of staff. Processes will be updated to reflect the changes by the respiratory therapy department director via a separate binder for respiratory medical administration record and treatment logs. Compliance will be documented and submitted monthly to hospital administrator.  The Respiratory Therapy Department Director  will  monitor for compliance as well as the continued implementation of the plan of correction. Data will be reported at monthly QAPI meeting and plan updated if needed until finalized. After initial 6 month corrective program compliance will be monitored and documented no less than quarterly. 482.57(b) STANDARD RESPIRATORY CARE SERVICES POLICIES: Services must be delivered in accordance with medical staff directives. Observations:Based on review of medical records (MR), facility policy and procedures, and interviews with staff (EMP), it was determined the facility failed to adhere to its Respiratory Care Services established policies and procedures for two (2) out of five (5) respiratory medical records reviewed (MR12 and MR13). Review of MR12 on December 12, 2023, revealed tracheostomy care was documented as completed one time, at 2:10 AM, over two shifts on September 2, 2023. Review of MR13 on December 12, 2023, revealed tracheostomy care was documented as completed one time, at 3:20 AM, over two shifts on September 2, 2023. Review on December 13, 2023, of facility policy,  \" Tracheostomy Care\", dated December 2022, revealed,  \" ...C Changing Tracheostomy Tube Dressing...should be changed whenever soiled and/or every shift.\"Interview on December 12, 2023, at 1:59 PM with EMP1 confirmed MR12 did not have progress note regarding omitted tracheostomy care on September 2, 2023.Interview on December 12, 2023, at 2:07 PM with EMP1 confirmed MR13 did not have progress note regarding omitted tracheostomy care on September 2, 2023Interview on December 13, 2023, at 12:34 PM with EMP1 confirmed the Respiratory department staff work 12-hour shifts. Further interview with EMP1 confirmed that tracheostomy care should be completed and documented twice per 24-hour period.  Plan of Correction - To be completed: 02/23/2024Audit Respiratory Therapy Treatment Logs in medical records of all inpatients for  100% compliance with documentation of delivering therapies according to providers' orders. Auditing to be performed daily from 12/26/2023 to 1/09/2024, then weekly from 1/15/2024 to 2/10/2024, then monthly from 2/11/2024 until 6/30/2024 or until 3 consecutive months of 100% compliance is achievedRedesign Respiratory Therapy Treatment Log to facilitate compliance with documentation of respiratory services. Standardize language to promote proper and consistent documentation. Approve form through HIM for use. Educate 100% of   Respiratory Therapy staff on proper completion of updated Respiratory Therapy Treatment Log.  Education to be done in-person, by Webex and via learning management system. Document education of 100% of respiratory therapy staff. Educate all staff on new location of Respiratory Therapy Treatment Log in medical record. Education to be done in-person, at staff meetings, huddles, electronic messaging and learning management system. Document education of 100% of staff. Processes will be updated to reflect the changes by the respiratory therapy department director via a separate binder for respiratory medical administration record and treatment logs. Compliance will be documented and submitted monthly to hospital administrator.  The Respiratory Therapy Department Director  will  monitor for compliance as well as the continued implementation of the plan of correction. Data will be reported at monthly QAPI meeting and plan updated if needed until finalized. After initial 6 month corrective program compliance will be monitored and documented no less than quarterly. 482.57(b)(4) STANDARD RESPIRATORY SERVICES:All respiratory care services orders must be documented in the patient's medical record in accordance with the requirements at §482.24.Observations:Based on review of medical records (MR), facility policy and procedures, and interviews with staff (EMP), it was determined the facility failed to document in the medical record of two (2) out of five (5) respiratory medical records reviewed. (MR12 and MR14)Review of MR12 on December 12, 2023, revealed breathing treatments ordered by the physician on August 28, 2023, to be administered four times per 24-hour period. Further review revealed the breathing treatments were documented three times, at 7:07 AM, 10:55 AM, and 3:10 PM, over the 24-hour period of September 1, 2023. Review of MR14 on December 12, 2023, revealed cough assist was ordered by physician on October 17, 2023, to be completed four times per 24-hour period and as needed every two hours. Further review revealed cough assist was documented as completed three times, at 7:15 AM, 11:55 AM, and 9:00 PM, over the 24-hour period of October 19, 2023. Interview on December 12, 2023, at 1:59 PM with EMP1 confirmed when a treatment is not performed, there should be a progress note explaining why it was not performed. Further interview with EMP1 confirmed MR12 did not have a progress note regarding omitted breathing treatment for the 24-hour period of September 1, 2023. Interview on December 12, 2023, at 2:11 PM with EMP1 confirmed MR14 did not have progress note regarding omitted cough assist for the 24-hour period of September 2, 2023. Plan of Correction - To be completed: 02/23/2024Audit Respiratory Therapy Treatment Log in medical records of all inpatients for presence of progress note on undelivered therapies. Auditing to be performed daily from 12/26/2023 to 1/09/2024, then weekly from 1/15/2024 to 2/10/2024, then monthly from 2/11/2024 until 6/30/2024 or until 3 consecutive months of 100% compliance is achieved.Processes will be updated to reflect the changes by the respiratory therapy department director via a separate binder for respiratory medical administration record and treatment logs. Compliance will be documented and submitted monthly to hospital administrator.  The Respiratory Therapy Department Director and/or his designees will re-educate respiratory therapy staff and monitor compliance of progress note stating respiratory therapy was not performed as ordered and reason why for any respiratory therapies unable to be delivered.  The Respiratory Therapy Department Director will be responsible for monitoring the continued implementation of the plan of correction. Data will be reported at monthly QAPI meeting and plan updated if needed until finalized. After initial 6 month corrective program compliance will be monitored and documented no less than quarterly. 482.57(b)(4) STANDARD RESPIRATORY SERVICES: All respiratory care services orders must be documented in the patient's medical record in accordance with the requirements at §482.24. Observations:Based on review of medical records (MR), facility policy and procedures, and interviews with staff (EMP), it was determined the facility failed to document in the medical record of two (2) out of five (5) respiratory medical records reviewed. (MR12 and MR14)Review of MR12 on December 12, 2023, revealed breathing treatments ordered by the physician on August 28, 2023, to be administered four times per 24-hour period. Further review revealed the breathing treatments were documented three times, at 7:07 AM, 10:55 AM, and 3:10 PM, over the 24-hour period of September 1, 2023. Review of MR14 on December 12, 2023, revealed cough assist was ordered by physician on October 17, 2023, to be completed four times per 24-hour period and as needed every two hours. Further review revealed cough assist was documented as completed three times, at 7:15 AM, 11:55 AM, and 9:00 PM, over the 24-hour period of October 19, 2023. Interview on December 12, 2023, at 1:59 PM with EMP1 confirmed when a treatment is not performed, there should be a progress note explaining why it was not performed. Further interview with EMP1 confirmed MR12 did not have a progress note regarding omitted breathing treatment for the 24-hour period of September 1, 2023. Interview on December 12, 2023, at 2:11 PM with EMP1 confirmed MR14 did not have progress note regarding omitted cough assist for the 24-hour period of September 2, 2023. Plan of Correction - To be completed: 02/23/2024Audit Respiratory Therapy Treatment Log in medical records of all inpatients for presence of progress note on undelivered therapies. Auditing to be performed daily from 12/26/2023 to 1/09/2024, then weekly from 1/15/2024 to 2/10/2024, then monthly from 2/11/2024 until 6/30/2024 or until 3 consecutive months of 100% compliance is achieved.Processes will be updated to reflect the changes by the respiratory therapy department director via a separate binder for respiratory medical administration record and treatment logs. Compliance will be documented and submitted monthly to hospital administrator.  The Respiratory Therapy Department Director and/or his designees will re-educate respiratory therapy staff and monitor compliance of progress note stating respiratory therapy was not performed as ordered and reason why for any respiratory therapies unable to be delivered.  The Respiratory Therapy Department Director will be responsible for monitoring the continued implementation of the plan of correction. Data will be reported at monthly QAPI meeting and plan updated if needed until finalized. After initial 6 month corrective program compliance will be monitored and documented no less than quarterly."
        },
        {
            "eventid": "3J7Y11",
            "date": "12/14/2023"
        },
        {
            "eventid": "QHUP11",
            "date": "9/29/2023",
            "data": "Initial comments:This report is the result of an unannounced onsite complaint investigation CHL23C519V initiated on September 27, 2023 and completed on September 29, 2023, at Good Shepherd Specialty Hospital.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced onsite complaint investigation CHL23C519V initiated on September 27, 2023 and completed on September 29, 2023, at Good Shepherd Specialty Hospital.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "T8WH11",
            "date": "9/15/2023"
        },
        {
            "eventid": "B76W11",
            "date": "9/14/2023"
        },
        {
            "eventid": "LKIP11",
            "date": "8/14/2023",
            "data": "Initial comments:This report is the result of an unannounced offsite complaint investigation (CHL23C381V) initiated on July 19, 2023, and completed offsite on August 14, 2023, at Good Shepherd Specialty Hospital.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced offsite complaint investigation (CHL23C381V) initiated on July 19, 2023, and completed offsite on August 14, 2023, at Good Shepherd Specialty Hospital.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "980U11",
            "date": "3/29/2023"
        },
        {
            "eventid": "VBIY11",
            "date": "3/29/2023",
            "data": "Initial comments:This report is for replacement equipment, B. Braun Infusomat Space Infusion Pump, beginning on May 24, 2023.  Good Shepherd Specialty Hospital attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is for replacement equipment, B. Braun Infusomat Space Infusion Pump, beginning on May 24, 2023.  Good Shepherd Specialty Hospital attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "G9RK11",
            "date": "3/16/2023",
            "data": "Initial comments:This report is for replacement equipment, Nova StatStrip Blood Glucose Monitoring System, beginning on April 7, 2023. Good Shepherd Specialty Hospital attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is for replacement equipment, Nova StatStrip Blood Glucose Monitoring System, beginning on April 7, 2023. Good Shepherd Specialty Hospital attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "S2UK12",
            "date": "2/8/2023",
            "data": "Initial comments:This report is the result of an offsite revisit initiated on February 3, 2023, and completed on Februray 8, 2023 at Good Shepherd Specialty Hospital as the result of a previous hospital relicensure survey that was concluded on November 30, 2022.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 19 Plan of Correction: Initial comments:This report is the result of an offsite revisit initiated on February 3, 2023, and completed on Februray 8, 2023 at Good Shepherd Specialty Hospital as the result of a previous hospital relicensure survey that was concluded on November 30, 2022.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 19 Plan of Correction:"
        }
    ]
}