{
    "facility": "UPMC SOMERSET",
    "data": [
        {
            "eventid": "47M211",
            "date": "1/24/2024",
            "data": "Initial comments:This report is the result of an unannounced offsite complaint investigation CHL23C891J completed on January 24, 2024 at UPMC Somerset.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced offsite complaint investigation CHL23C891J completed on January 24, 2024 at UPMC Somerset.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "9IXU11",
            "date": "1/19/2024",
            "data": "Initial comments:This report is the result of an unannounced onsite complaint investigation CHL23C829J completed on January 19, 2023, at UPMC Somerset.  At the time of the investigation, the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced onsite complaint investigation CHL23C829J completed on January 19, 2023, at UPMC Somerset.  At the time of the investigation, the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "3CX011",
            "date": "1/12/2024",
            "data": "Initial comments:This report is the result of an unannounced onsite complaint investigation CHL23C804J completed on January 12, 2023, at UPMC Somerset.  At the time of the investigation, the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced onsite complaint investigation CHL23C804J completed on January 12, 2023, at UPMC Somerset.  At the time of the investigation, the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "7RXV11",
            "date": "1/10/2024",
            "data": "Initial comments:This report is for new equipment, Stryker Precuity Inpatient beds, beginning on December 29, 2023. The UPMC Somerset attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is for new equipment, Stryker Precuity Inpatient beds, beginning on December 29, 2023. The UPMC Somerset attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "XZH911",
            "date": "1/5/2024",
            "data": "Initial comments:This report is for the new service, Telepsych, beginning on July 31, 2023. The UPMC Somerset attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is for the new service, Telepsych, beginning on July 31, 2023. The UPMC Somerset attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "WMGZ11",
            "date": "12/4/2023",
            "data": "Initial comments:This report is the result of a Department of Human Services, Chapter 5100 Mental Health Procedures Act Survey conducted on December 4, 2023, at UPMC Somerset Hospital.  It was determined the facility was in compliance with requirements of the Chapter 5100 Mental Health regulations. Plan of Correction: Initial comments:This report is the result of a Department of Human Services, Chapter 5100 Mental Health Procedures Act Survey conducted on December 4, 2023, at UPMC Somerset Hospital.  It was determined the facility was in compliance with requirements of the Chapter 5100 Mental Health regulations. Plan of Correction:"
        },
        {
            "eventid": "BZPJ11",
            "date": "11/16/2023",
            "data": "Initial comments:This report is for replacement equipment, Stryker 5th Wheel Manual Stretchers w/Scales and ComfortGel Mattresses, beginning on October 4, 2023. The UPMC Somerset attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is for replacement equipment, Stryker 5th Wheel Manual Stretchers w/Scales and ComfortGel Mattresses, beginning on October 4, 2023. The UPMC Somerset attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "FT2L11",
            "date": "11/1/2023",
            "data": "Initial comments:This report is the result of an unannounced onsite complaint investigation CHL23C768J completed on November 1, 2023, at UPMC Somerset Hospital.  At the time of the investigation, the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced onsite complaint investigation CHL23C768J completed on November 1, 2023, at UPMC Somerset Hospital.  At the time of the investigation, the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "V6GG12",
            "date": "10/20/2023",
            "data": "Initial comments:This report is the result of a follow up survey conducted on October 20, 2023, with UPMC Somerset, as the result of a special monitoring investigation that was conducted on August 03, 2023.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 1998.   Plan of Correction: Initial comments:This report is the result of a follow up survey conducted on October 20, 2023, with UPMC Somerset, as the result of a special monitoring investigation that was conducted on August 03, 2023.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 1998.   Plan of Correction: Initial comments:This report is the result of a follow up visit from an unannounced onsite special monitoring investigation completed on October 20, 2023, at UPMC Somerset.  It was determined that the facility was in substantial compliance with the requirements of 42 CFR, Title 42, Part 482-Conditions of Participation for Hospitals.  Recommendation to rescind the 90-day CMS termination tract. Plan of Correction: Initial comments:This report is the result of a follow up visit from an unannounced onsite special monitoring investigation completed on October 20, 2023, at UPMC Somerset.  It was determined that the facility was in substantial compliance with the requirements of 42 CFR, Title 42, Part 482-Conditions of Participation for Hospitals.  Recommendation to rescind the 90-day CMS termination tract. Plan of Correction:"
        },
        {
            "eventid": "TW2512",
            "date": "10/20/2023",
            "data": "Initial comments:This report is the result of a follow up survey conducted on October 20, 2023, with UPMC Somerset Hospital, as the result of a previous unannounced complaint investigation CHL22C842J that was conducted on August 29, 2023.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 1998.   Plan of Correction: Initial comments:This report is the result of a follow up survey conducted on October 20, 2023, with UPMC Somerset Hospital, as the result of a previous unannounced complaint investigation CHL22C842J that was conducted on August 29, 2023.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 Pa Code, Part IV, Subparts A and B, November 1987, as amended June 1998.   Plan of Correction:"
        },
        {
            "eventid": "V6GG11",
            "date": "9/11/2023",
            "data": "Initial comments:This report is the result of an unannounced onsite special monitoring investigation that concluded on August 3, 2023 at UPMC Somerset.  It was determined that the facility was not in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced onsite special monitoring investigation that concluded on August 3, 2023 at UPMC Somerset.  It was determined that the facility was not in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced onsite special monitoring investigation that concluded on August 3, 2023, at UPMC Somerset.  It was determined the facility was not in compliance with the requirements of 42 CFR, Title 42, Part 482-Conditions of Participation for Hospitals.An Immediate Jeopardy was called on July 31, 2023, at 11:48 AM, when it was identified that the facility failed to comply with Condition of Participation Patient Rights 482.13 [Tag A-0144].  The facility failed to provide care in a safe setting by failing to provide constant visual observation and by failing to implement high risk precautions as per physician order.The facility provided an action plan to the surveyors on July 31, 2023, at 1:50 PM, with the abatement of Immediate Jeopardy on August 1, 2023, at 2:05 PM, when the implementation of abatement plan was verified to include education material and audits, when all patients ordered constant visual observation were executed and when all patients requiring suicide precautions were implemented. Condition of Participation non-compliance remains.  Plan of Correction: Initial comments:This report is the result of an unannounced onsite special monitoring investigation that concluded on August 3, 2023, at UPMC Somerset.  It was determined the facility was not in compliance with the requirements of 42 CFR, Title 42, Part 482-Conditions of Participation for Hospitals.An Immediate Jeopardy was called on July 31, 2023, at 11:48 AM, when it was identified that the facility failed to comply with Condition of Participation Patient Rights 482.13 [Tag A-0144].  The facility failed to provide care in a safe setting by failing to provide constant visual observation and by failing to implement high risk precautions as per physician order.The facility provided an action plan to the surveyors on July 31, 2023, at 1:50 PM, with the abatement of Immediate Jeopardy on August 1, 2023, at 2:05 PM, when the implementation of abatement plan was verified to include education material and audits, when all patients ordered constant visual observation were executed and when all patients requiring suicide precautions were implemented. Condition of Participation non-compliance remains.  Plan of Correction: 482.13 CONDITION PATIENT RIGHTS:A hospital must protect and promote each patient's rights.Observations:This condition is not met as evidenced by:Based on the seriousness of the noncompliance, the facility failed to substantially comply with this condition.Based on the systemic nature of the standard-level deficiencies related to patient rights, the facility staff failed to comply with this condition. These following standards were cited and show a systemic nature of noncompliance with regards to patient rights as follows:482.13 (c)(2) Tag A-0144 The information reviewed during the survey provided evidence that personnel failed to implement constant observation of an emergency department behavioral health, suicidal patient, resulting in patient elopement, for one medical record reviewed, by failing to complete the suicide risk assessment of emergency department behavioral health patients that expressed suicidal thoughts with intent to harm self, for two medical records reviewed, by failing to obtain a physician order for observation based on suicide risk assessment score for six medical records reviewed, by failing to implement physician order for observation of emergency department behavioral health patients for two medical records reviewed, and by failing to follow security procedures to eliminate safety risks of emergency department behavioral health patients that expressed suicidal thoughts with intent to harm self for four medical records reviewed. Plan of Correction - To be completed: 09/22/2023 Beginning on August 1, 2023 the Director of Emergency Nursing, ED Clinicians and/or the ED Charge Nurse will be reviewing each shift for any patients that are identified as Behavioral Health (BH) and that they have a completed suicide risk assessment documented in their medical record. If those BH patients are determined to be at risk for suicide based on the suicide risk assessment, an order for 1:1 observation will be obtained. If the provider orders a 1:1 sitter for a patient, he/she will enter the order manually and also verbally notify the charge nurse and/or Patient Care Technician (PCT) that the patient is being ordered a 1:1 sitter, based on the suicide risk assessment. As soon as any patient is identified as a suicide risk, either the nurse or PCT will remain with the patient until a 1:1 sitter is assigned. The patient will not be alone at any time following the identification of the need for a 1:1 sitter. This process was reviewed with each ED staff member by the ED Director, ED Interim Director, ED Clinician or the ED Charge Nurse at the beginning of their next shift and was completed 8/31/2023.Following the provider order for a 1:1 sitter, when needed, The Administrator on Duty (AOD) will be notified by the Emergency Department (ED) Charge Nurse or ED Patient Care Technician (PCT) of any suicidal patients and the need for 1:1 sitter so that staffing can be adjusted. If emergency department staffing does not allow for a 1:1 to be assigned from their current staffing level, a trained Patient Care Attendant (PCA) for a 1:1 is to be assigned to the patient by the AOD. The AOD will assign a PCA trained on 1:1 from the acute care or behavioral health units to provide the 1:1 coverage in the ED. The AOD will adjust staffing as needed for the duration of the 1:1's ordered. This process was reviewed with each ED staff member by the ED Director, ED Interim Director, ED Clinician or the ED Charge Nurse at the beginning of their next shift and was completed 8/31/2023.Beginning August 1, 2023, to assure a safe room for Behavioral Health (BH) patients, there is a checklist for staff to follow. This checklist was reviewed with each ED staff member by the ED Director, ED Interim Director, ED Clinician or the ED Charge Nurse at the beginning of their next shift. This will continue until all staff have been educated on the checklist. Any new employees will be educated by leadership. All documentation of that education will be maintained as proof that this has been provided and accepted by staff members. An educational program titled \"Psychiatric & Safety Care Attendant Process Update\" has been developed and education will be implemented beginning 9/30/2023 and will be completed by 10/23/2023. Included in this educational program is a review of the Patient Rights policy HS-HD-PR01. This will be provided by the UPMC Somerset Nursing Education department who will maintain sign-off records of all staff who have completed the education.The checklist will address ligature risks and stripping down the room for mitigation of ligature risks for behavioral health (BH) patients. The checklist will also include the requirement to have all BH patients remove their street clothes and change into a BH safety gown. All belongings will be removed from the room and stored in the nurses' station. Completed checklist will be maintained on the patient's medical record. UPMC police/security will be notified by either the AOD or the ED Charge Nurse or ED PCT when the ED has identified a BH patient that is at high risk of elopement and the possibility of attempting to harm self or others.UPMC Somerset will monitor the adherence to the policy by performing audits of those medical records of BH patients each shift. These will be performed by either the ED Clinicians, ED Charge Nurse, ED Interim Director, or the Nursing AOD. If any documentation of the above plan is not found in the medical record or through observation within the ED, immediate re-education and discussion with involved staff will occur. This will be documented on the audit tool developed. The audit tool will be maintained within the ED and accessible to the Chief Nursing Officer for review as well as Nursing Leadership. This audit began 8/1/2023 and will be performed on all BH patients until there are three months of consecutive 100% compliance. After that, nursing leadership will continue with 10 audits per month ongoing for six-months of consecutive findings of 100% compliance.Any staff that are found to have patterns of non-compliance with the above process, will enter into a corrective action plan with Nursing Leadership.Results of these audits will be shared monthly at the monthly Nursing Leadership meeting beginning September 21,2023 as well as the Patient Safety Committee on September 28, 2023. Patient Safety Committee reports up to the Board Quality Committee so this will be reported monthly to Board Quality beginning October 19, 2023. 482.13 CONDITION PATIENT RIGHTS: A hospital must protect and promote each patient's rights. Observations:This condition is not met as evidenced by:Based on the seriousness of the noncompliance, the facility failed to substantially comply with this condition.Based on the systemic nature of the standard-level deficiencies related to patient rights, the facility staff failed to comply with this condition. These following standards were cited and show a systemic nature of noncompliance with regards to patient rights as follows:482.13 (c)(2) Tag A-0144 The information reviewed during the survey provided evidence that personnel failed to implement constant observation of an emergency department behavioral health, suicidal patient, resulting in patient elopement, for one medical record reviewed, by failing to complete the suicide risk assessment of emergency department behavioral health patients that expressed suicidal thoughts with intent to harm self, for two medical records reviewed, by failing to obtain a physician order for observation based on suicide risk assessment score for six medical records reviewed, by failing to implement physician order for observation of emergency department behavioral health patients for two medical records reviewed, and by failing to follow security procedures to eliminate safety risks of emergency department behavioral health patients that expressed suicidal thoughts with intent to harm self for four medical records reviewed. Plan of Correction - To be completed: 09/22/2023 Beginning on August 1, 2023 the Director of Emergency Nursing, ED Clinicians and/or the ED Charge Nurse will be reviewing each shift for any patients that are identified as Behavioral Health (BH) and that they have a completed suicide risk assessment documented in their medical record. If those BH patients are determined to be at risk for suicide based on the suicide risk assessment, an order for 1:1 observation will be obtained. If the provider orders a 1:1 sitter for a patient, he/she will enter the order manually and also verbally notify the charge nurse and/or Patient Care Technician (PCT) that the patient is being ordered a 1:1 sitter, based on the suicide risk assessment. As soon as any patient is identified as a suicide risk, either the nurse or PCT will remain with the patient until a 1:1 sitter is assigned. The patient will not be alone at any time following the identification of the need for a 1:1 sitter. This process was reviewed with each ED staff member by the ED Director, ED Interim Director, ED Clinician or the ED Charge Nurse at the beginning of their next shift and was completed 8/31/2023.Following the provider order for a 1:1 sitter, when needed, The Administrator on Duty (AOD) will be notified by the Emergency Department (ED) Charge Nurse or ED Patient Care Technician (PCT) of any suicidal patients and the need for 1:1 sitter so that staffing can be adjusted. If emergency department staffing does not allow for a 1:1 to be assigned from their current staffing level, a trained Patient Care Attendant (PCA) for a 1:1 is to be assigned to the patient by the AOD. The AOD will assign a PCA trained on 1:1 from the acute care or behavioral health units to provide the 1:1 coverage in the ED. The AOD will adjust staffing as needed for the duration of the 1:1's ordered. This process was reviewed with each ED staff member by the ED Director, ED Interim Director, ED Clinician or the ED Charge Nurse at the beginning of their next shift and was completed 8/31/2023.Beginning August 1, 2023, to assure a safe room for Behavioral Health (BH) patients, there is a checklist for staff to follow. This checklist was reviewed with each ED staff member by the ED Director, ED Interim Director, ED Clinician or the ED Charge Nurse at the beginning of their next shift. This will continue until all staff have been educated on the checklist. Any new employees will be educated by leadership. All documentation of that education will be maintained as proof that this has been provided and accepted by staff members. An educational program titled \"Psychiatric & Safety Care Attendant Process Update\" has been developed and education will be implemented beginning 9/30/2023 and will be completed by 10/23/2023. Included in this educational program is a review of the Patient Rights policy HS-HD-PR01. This will be provided by the UPMC Somerset Nursing Education department who will maintain sign-off records of all staff who have completed the education.The checklist will address ligature risks and stripping down the room for mitigation of ligature risks for behavioral health (BH) patients. The checklist will also include the requirement to have all BH patients remove their street clothes and change into a BH safety gown. All belongings will be removed from the room and stored in the nurses' station. Completed checklist will be maintained on the patient's medical record. UPMC police/security will be notified by either the AOD or the ED Charge Nurse or ED PCT when the ED has identified a BH patient that is at high risk of elopement and the possibility of attempting to harm self or others.UPMC Somerset will monitor the adherence to the policy by performing audits of those medical records of BH patients each shift. These will be performed by either the ED Clinicians, ED Charge Nurse, ED Interim Director, or the Nursing AOD. If any documentation of the above plan is not found in the medical record or through observation within the ED, immediate re-education and discussion with involved staff will occur. This will be documented on the audit tool developed. The audit tool will be maintained within the ED and accessible to the Chief Nursing Officer for review as well as Nursing Leadership. This audit began 8/1/2023 and will be performed on all BH patients until there are three months of consecutive 100% compliance. After that, nursing leadership will continue with 10 audits per month ongoing for six-months of consecutive findings of 100% compliance.Any staff that are found to have patterns of non-compliance with the above process, will enter into a corrective action plan with Nursing Leadership.Results of these audits will be shared monthly at the monthly Nursing Leadership meeting beginning September 21,2023 as well as the Patient Safety Committee on September 28, 2023. Patient Safety Committee reports up to the Board Quality Committee so this will be reported monthly to Board Quality beginning October 19, 2023. 482.13(c)(2) STANDARD PATIENT RIGHTS: CARE IN SAFE SETTING:The patient has the right to receive care in a safe setting.Observations:Based on review of facility documents and medical records (MR) and interview with facility staff (EMP), it was determined that the facility failed to provide care in a safe setting by failing to complete the suicide risk assessment of emergency department behavioral health patients that expressed suicidal thoughts with intent to harm self in two of twenty medical records reviewed (MR12 and MR14), by failing to obtain a physician order for observation based on suicide risk assessment score in six of twenty medical records reviewed (MR2, MR5, MR7, MR12, MR13 and MR14), by failing to implement physician order for observation of emergency department behavioral health patients in two of twenty medical records (MR1 and MR18), and by failing to follow security procedures to eliminate safety risks of emergency department behavioral health patients that expressed suicidal thoughts with intent to harm self, in four of twenty medical records reviewed (MR1, MR5, MR13 and MR18).Findings include: \"UPMC Policy and Procedure Manual ... Policy:  HS-HD-PR-01* ... Subject:  Patients'  Notice and Bill of Rights and Responsibilities\" policy and procedure manual dated January 4, 2021, revealed, \"I.  Policy It is the policy of the UPMC to promote the interests and well-being of patients served in its United States based locations and to protect the interests of patients by the adoption of a Patients' Notice and Bill of Rights and Patient Responsibilities. ... Staff and Environment  You have the right to:  1.  Receive respectful care given by competent personnel in a setting that:  a.  is safe and promotes your dignity, positive self-image and comfort; ... V.  Patients' Notice and Bill of Rights Behavioral  Health Addendum  You have the right to be treated with dignity and respect. ... .\" \"UPMC Policy Safety Management Date: January 1, 2023, ... Policy Statement:  The Emergency Department will maintain standards to ensure the safety of patients, visitors, and employees in the emergency care area. ... Patients who have demonstrated a danger to themselves or others should be attended at all times by a security guard, police officer, MH/MR worker, NPU staff person, or Emergency Department staff person. ... Safety pre-cautions for patients with mental health/suicide emergencies Therapeutic interventions Provide for patient's safety and security. Assess risk for suicide. Undress the patient and remove any items from the environment that may pose a danger. The patient should be visible and within close proximity to the nurses station. ... .\"Review of \"UPMC Policy Nursing Subject: Care Attendant Utilization and Observation of Patients Date: May 24, 2023. I. Policy It is the policy of UPMC to provide for safe and therapeutic observation of patients according to individual patient needs. UPMC will utilize Care Attendants when necessary to provide observation for patients on inpatient nursing units and in emergency departments, in accordance with established standards. ... IV Definitions: Safety Care Attendant: Provides patient care, support and constant observation in accordance with established policies and procedures under the direction of the RN/LPN physician, or provider with prescriptive authority. Routinely performs the UPMC patient care core responsibilities for Safety Care Attendants which includes, but is not limited to constant observation, activities of daily such as hygiene (bath and oral care), bed making, transfer and ambulation assistance, and patient comfort measures. Psychiatric Care Attendant: Provides constant observation or special constant observation to assigned suicidal or behavioral health patients under the direction of the RN/LPN, physician, or provider with prescriptive authority. The Psychiatric Care Attendant will have limited direct responsibilities so that the patient remains in direct eyesight or, as ordered, within arm's reach at all times. As a result, the Psychiatric Care Attendant may not complete other care or ADLs for the patient that would require the Psychiatric Care Attendant to leave the room (such as going into patient's bathroom) or turn their back on the patient. Staff functioning in the Psychiatric Care Attendant role will be informed of the reason that the patient requires a Psychiatric Care Attendant by the assigned RN/LPN. Psychiatric Care Attendants may be used in non-behavioral health departments and hospitals. Constant Observation (CO): Whereby the staff continuously observes and may interact individually with he patient while keeping the patient in sight at all times. ... Patients on CO status may have issues that jeopardize their safety or the safety of others. They may exhibit behaviors or voice thoughts of suicidal, homicidal, or self-injurious intent that require staff or a Care Attendant to be observing them at all times to ensure their safety. ... V. Procedure Safety Care Attendant 1. The constant observation by Safety Care Attendant is a nurse driven intervention based on nursing judgement after alternative measures have proven ineffective. A physician's order is not required to initiate or discontinue a Safety Care Attendant. ...3. Constant Observation or Special Constant Observation in initiated by a registered nurse based on an appropriate assessment of the patient which is corroborated by the Unit Director (or designee) and/or nursing supervisor. ... Care Attendant 1. The request for a Psychiatric Care Attendant for suicidal or behavioral health patients requires the order of a physician. Nurses may initiate Constant Observation or Special Constant Observation of a patient for the safety of a patient until an order is secured. Discontinuation of a Psychiatric Care Attendant can only be completed with a physician's order. 2. Constant Observation or Special Constant Observation is to be maintained without disruption, and thus, the Psychiatric Care Attendant may have limited duties or care responsibilities, so the patient is in direct eyesight at all times. General Guidelines for Care Attendants 1. Care Attendants resources will be reasonably allocated and prioritized based on overall safety considerations in the following order: a. For patients with a positive suicidal/homicidal screening with or without a civil commitment (201 or above in PA) - a Psychiatric Care Attendant is required and ordered by the provider.  i. In lieu of a Psychiatric Care Attendant, a tele-sitter (video monitoring) may be used for patients assessed at Moderate or Low risk for suicide. Patients assessed for High risk for suicide should be assigned a Psychiatric Care Attendant. B. For patients on a civil commitment (for example, 201 or above in PA) who are not suicidal/homicidal, the need for psychiatric care attendant may be determined by a licensed provider based on assessment of a patient's individual risk and protective factors, in collaboration with a psychiatric clinicians if available ... 5. Care Attendant responsibilities include, but are not limited to: a. Ensuring constant observation or special constant observation, providing protection to keep a patient from harming self or others, maintaining the patient's room in a neat and orderly fashion, and immediately report any changes in mental status and/or physical status to the RN/LPN caring for the patient. ... 2. Psychiatric Care Attendant - Their other assigned duties may be limited to ensure the patient is in eyesight (CO) or within arm's distance (SCO) at all times per the physician order. ... .\" \"UPMC Policy Nursing Screening and Care of the Suicidal Patient: Purpose: The purpose of this policy to provide the steps that Somerset Hospital will use to screen patients at risk for suicide and ensure their safety while in the care of our services, as well as, to ensure identified patients have the appropriate resources to maintain safety after discharge ... Healthcare organizations should have measures in place to assess for and detect suicidal ideations, as well as, have plans in place to care for individuals who have been deemed at risk. ... Procedure:  All patients seeking care will be screened for suicide ideation. If through screening, a patient is found to be at risk for suicide a more comprehensive risk assessment will be completed.  The results of the risk assessment will determine level of supervision required, and interventions needed to ensure safety of the patient. ... previous suicide attempts, ... feelings of hopelessness ... Initial Assessment During initial assessments of patients the registered nurse will complete Columbia Suicide Patient Safety Screener consisting of 3 to 6 questions. Patient Safety Screener (suicide screen) ... The screener is completed by the unit who first contacts the patient. ... levels of Supervision:  Patient assessed as at risk-yes to questions 1 & 2 includes patients that have expressed suicide ideation, the patient is placed on constant observation by staff, suicide precautions are implemented, add event report into safety portal and notify supervisor, for patients identified as a risk a notification of the physician and behavioral health is completed. Patient assessed as high risk-yes to questions 3 through 6: Include patients that have had a suicide attempt, or have expressed clear intent. The patient is placed on constant observation by staff. Suicide precautions are implemented. ... For patients identified as a risk a notification of the physician and behavioral health is completed. The attending physician shall be made aware of the risk assessment findings and level of supervision required. An order is generated based on screening criteria. ... Patients who screen as at risk still require constant observation to mitigate environmental risk factors. ... Patients with identified Suicide Risk: For any patient that is identified as a suicidal risk and admitted in the emergency department or general medical floors the following shall be instituted for suicide precautions.  Removal of harmful objects from the room. No pens, or sharp objects. Removal of garbage cans, contact housekeeping for alternative trash collection containers. Removal of non-essential furniture and equipment. ... Inventory of patient belongings for potential harmful items. Patient clothing must be removed and patient placed into a gown. Special gowns with no strings should be used.  Patients shall be accompanied to the restroom and may not be left unattended. ... The patient must be visible to the responsible observer at all times. ... For patients in constant observation, sitters will never leave patients unattended.  Even when visitors or family is present, sitter must remain in the room. ... .\" 1.  Review of MR1 revealed that the patient presented to UPMC Somerset Emergency Department on July 5, 2023, at 5:55 PM following a clinic appointment where the patient was found in the bathroom by a counselor after cutting both both wrists with a three inch folding knife.  MR1 Suicide Safety Screen conducted at 6:04 PM confirmed \"High Suicide Precaution Orders  High Risk-Constant Observation.\"   MR1 revealed a physican order for a \"1:1 Sitter Suicide-Constant Observation\" on July 5, 2023, at 7:13 PM.  MR1 nursing documentation revealed that at 7:20 PM the patient came out of room and headed toward the ambulance bay doors and was told to return to room.  Further documentation of MR1 revealed that the patient eloped at approximately 8:00 PM. 2. Tour of the Emergency Department on July 31, 2023, was conducted with EMP5 and revealed four Emergency Department patient bays (rooms 2, 3-Cardiac Room, 8 and 9), two on either side of the nurse's station, any of which could be occupied by a patient that requires constant visual observation.  Further observation of patient bays revealed that a patient in room 2, 3-Cardiac Room, 8, and/or 9 would not be visualized from the nurses station. Review of MR1 revealed that the patient was admitted to room 3-Cardiac Room.3.  Interview with  EMP4 on July 31, 2023, at approximately 11:00 AM confirmed that the patient was not changed into a hospital gown, that the patient had attempted to leave prior to actual elopement, and that according to hospital policy the patient should have been placed in a hospital gown, and belongings should have been collected by staff and secured at the nurse's station. 4.  Telephone interview with EMP6 on August 3, 2023, confirmed that 1:1's are not typically ordered because the facility does not have the staff to sit with a patient. EMP6 also confirmed that the patient related to this investigation, MR1, was never changed into a hospital gown, personal belongings were never removed from the patient and the cardiac room was not ligature risk free. 5.  Review of MR12 and MR14 failed to reveal documented evidence of a suicide risk assessment.Review of facility electronic documentation dated August 3, 2023, from EMP1 confirmed the above finding. 6.  Review of MR2, MR5, MR7, MR12, MR 13 and MR14 failed to review documented evidence of a physician order for observation based on suicide risk assessment score-High Suicide Risk.   Review of facility electronic documentation dated August 3, 2023, from EMP1 confirmed the above finding. 7.  Review of MR1 and MR18 failed to reveal documented evidence of implementation of physician's order for Constant Observation. Review of facility electronic documentation dated August 3, 2023, from EMP1 confirmed the above finding. 8.  Review of MR1, MR5, MR13 and MR18 failed to reveal documented evidence that security procedures were conducted to eliminate safety risks.Review of facility electronic documentation dated August 3, 2023, from EMP1 confirmed the above finding.   Plan of Correction - To be completed: 09/22/2023Beginning on August 1, 2023 the Director of Emergency Nursing, ED Clinicians and/or the ED Charge Nurse will be reviewing each shift for any patients that are identified as Behavioral Health (BH) and that they have a completed suicide risk assessment documented in their medical record. If those BH patients are determined to be at risk for suicide based on the suicide risk assessment, an order for 1:1 observation will be obtained. If the provider orders a 1:1 sitter for a patient, he/she will enter the order manually and also verbally notify the charge nurse and/or Patient Care Technician (PCT) that the patient is being ordered a 1:1 sitter, based on the suicide risk assessment.  As soon as any patient is identified as a suicide risk, either the nurse or PCT will remain with the patient until a 1:1 sitter is assigned. The patient will not be alone at any time following the identification of the need for a 1:1 sitter. This process was reviewed with each ED staff member by the ED Director, ED Interim Director, ED Clinician or the ED Charge Nurse at the beginning of their next shift and was completed 8/31/2023.  Following the provider order for a 1:1 sitter, when needed, The Administrator on Duty (AOD) will be notified by the Emergency Department (ED) Charge Nurse or ED Patient Care Technician (PCT) of any suicidal patients and the need for 1:1 sitter so that staffing can be adjusted. If emergency department staffing does not allow for a 1:1 to be assigned from their current staffing level, a trained Patient Care Attendant (PCA) for a 1:1 is to be assigned to the patient by the AOD. The AOD will assign a PCA trained on 1:1 from the acute care or behavioral health units to provide the 1:1 coverage in the ED. The AOD will adjust staffing as needed for the duration of the 1:1's ordered. This process was reviewed with each ED staff member by the ED Director, ED Interim Director, ED Clinician or the ED Charge Nurse at the beginning of their next shift and was completed 8/31/2023.  Beginning August 1, 2023, to assure a safe room for Behavioral Health (BH) patients, there is a checklist for staff to follow. This checklist was reviewed with each ED staff member by the ED Director, ED Interim Director, ED Clinician or the ED Charge Nurse at the beginning of their next shift. This will continue until all staff have been educated on the checklist.  Any new employees will be educated by leadership. All documentation of that education will be maintained as proof that this has been provided and accepted by staff members.  An educational program titled \"Psychiatric & Safety Care Attendant Process Update\" has been developed and education will be implemented beginning 9/30/2023 and will be completed by 10/23/2023. Included in this educational program is a review of the Patient Rights policy HS-HD-PR01. This will be provided by the UPMC Somerset Nursing Education department who will maintain sign-off records of all staff who have completed the education.  The checklist will address ligature risks and stripping down the room for mitigation of ligature risks for behavioral health (BH) patients.  The checklist will also include the requirement to have all BH patients remove their street clothes and change into a BH safety gown.  All belongings will be removed from the room and stored in the nurses' station.  Completed checklist will be maintained on the patient's medical record. UPMC police/security will be notified by either the AOD or the ED Charge Nurse or ED PCT when the ED has identified a BH patient that is at high risk of elopement and the possibility of attempting to harm self or others. UPMC Somerset will monitor the adherence to the policy by performing audits of those medical records of BH patients each shift. These will be performed by either the ED Clinicians, ED Charge Nurse, ED Interim Director, or the Nursing AOD. If any documentation of the above plan is not found in the medical record or through observation within the ED, immediate re-education and discussion with involved staff will occur. This will be documented on the audit tool developed. The audit tool will be maintained within the ED and accessible to the Chief Nursing Officer for review as well as Nursing Leadership. This audit began 8/1/2023 and will be performed on all BH patients until there are three months of consecutive 100% compliance. After that, nursing leadership will continue with 10 audits per month ongoing for six-months of consecutive findings of 100% compliance. Any staff that are found to have patterns of non-compliance with the above process, will enter into a corrective action plan with Nursing Leadership. Results of these audits will be shared monthly at the monthly Nursing Leadership meeting beginning September 21,2023 as well as the Patient Safety Committee on September 28, 2023. Patient Safety Committee reports up to the Board Quality Committee so this will be reported monthly to Board Quality beginning October 19, 2023. 482.13(c)(2) STANDARD PATIENT RIGHTS: CARE IN SAFE SETTING: The patient has the right to receive care in a safe setting. Observations:Based on review of facility documents and medical records (MR) and interview with facility staff (EMP), it was determined that the facility failed to provide care in a safe setting by failing to complete the suicide risk assessment of emergency department behavioral health patients that expressed suicidal thoughts with intent to harm self in two of twenty medical records reviewed (MR12 and MR14), by failing to obtain a physician order for observation based on suicide risk assessment score in six of twenty medical records reviewed (MR2, MR5, MR7, MR12, MR13 and MR14), by failing to implement physician order for observation of emergency department behavioral health patients in two of twenty medical records (MR1 and MR18), and by failing to follow security procedures to eliminate safety risks of emergency department behavioral health patients that expressed suicidal thoughts with intent to harm self, in four of twenty medical records reviewed (MR1, MR5, MR13 and MR18).Findings include: \"UPMC Policy and Procedure Manual ... Policy:  HS-HD-PR-01* ... Subject:  Patients'  Notice and Bill of Rights and Responsibilities\" policy and procedure manual dated January 4, 2021, revealed, \"I.  Policy It is the policy of the UPMC to promote the interests and well-being of patients served in its United States based locations and to protect the interests of patients by the adoption of a Patients' Notice and Bill of Rights and Patient Responsibilities. ... Staff and Environment  You have the right to:  1.  Receive respectful care given by competent personnel in a setting that:  a.  is safe and promotes your dignity, positive self-image and comfort; ... V.  Patients' Notice and Bill of Rights Behavioral  Health Addendum  You have the right to be treated with dignity and respect. ... .\" \"UPMC Policy Safety Management Date: January 1, 2023, ... Policy Statement:  The Emergency Department will maintain standards to ensure the safety of patients, visitors, and employees in the emergency care area. ... Patients who have demonstrated a danger to themselves or others should be attended at all times by a security guard, police officer, MH/MR worker, NPU staff person, or Emergency Department staff person. ... Safety pre-cautions for patients with mental health/suicide emergencies Therapeutic interventions Provide for patient's safety and security. Assess risk for suicide. Undress the patient and remove any items from the environment that may pose a danger. The patient should be visible and within close proximity to the nurses station. ... .\"Review of \"UPMC Policy Nursing Subject: Care Attendant Utilization and Observation of Patients Date: May 24, 2023. I. Policy It is the policy of UPMC to provide for safe and therapeutic observation of patients according to individual patient needs. UPMC will utilize Care Attendants when necessary to provide observation for patients on inpatient nursing units and in emergency departments, in accordance with established standards. ... IV Definitions: Safety Care Attendant: Provides patient care, support and constant observation in accordance with established policies and procedures under the direction of the RN/LPN physician, or provider with prescriptive authority. Routinely performs the UPMC patient care core responsibilities for Safety Care Attendants which includes, but is not limited to constant observation, activities of daily such as hygiene (bath and oral care), bed making, transfer and ambulation assistance, and patient comfort measures. Psychiatric Care Attendant: Provides constant observation or special constant observation to assigned suicidal or behavioral health patients under the direction of the RN/LPN, physician, or provider with prescriptive authority. The Psychiatric Care Attendant will have limited direct responsibilities so that the patient remains in direct eyesight or, as ordered, within arm's reach at all times. As a result, the Psychiatric Care Attendant may not complete other care or ADLs for the patient that would require the Psychiatric Care Attendant to leave the room (such as going into patient's bathroom) or turn their back on the patient. Staff functioning in the Psychiatric Care Attendant role will be informed of the reason that the patient requires a Psychiatric Care Attendant by the assigned RN/LPN. Psychiatric Care Attendants may be used in non-behavioral health departments and hospitals. Constant Observation (CO): Whereby the staff continuously observes and may interact individually with he patient while keeping the patient in sight at all times. ... Patients on CO status may have issues that jeopardize their safety or the safety of others. They may exhibit behaviors or voice thoughts of suicidal, homicidal, or self-injurious intent that require staff or a Care Attendant to be observing them at all times to ensure their safety. ... V. Procedure Safety Care Attendant 1. The constant observation by Safety Care Attendant is a nurse driven intervention based on nursing judgement after alternative measures have proven ineffective. A physician's order is not required to initiate or discontinue a Safety Care Attendant. ...3. Constant Observation or Special Constant Observation in initiated by a registered nurse based on an appropriate assessment of the patient which is corroborated by the Unit Director (or designee) and/or nursing supervisor. ... Care Attendant 1. The request for a Psychiatric Care Attendant for suicidal or behavioral health patients requires the order of a physician. Nurses may initiate Constant Observation or Special Constant Observation of a patient for the safety of a patient until an order is secured. Discontinuation of a Psychiatric Care Attendant can only be completed with a physician's order. 2. Constant Observation or Special Constant Observation is to be maintained without disruption, and thus, the Psychiatric Care Attendant may have limited duties or care responsibilities, so the patient is in direct eyesight at all times. General Guidelines for Care Attendants 1. Care Attendants resources will be reasonably allocated and prioritized based on overall safety considerations in the following order: a. For patients with a positive suicidal/homicidal screening with or without a civil commitment (201 or above in PA) - a Psychiatric Care Attendant is required and ordered by the provider.  i. In lieu of a Psychiatric Care Attendant, a tele-sitter (video monitoring) may be used for patients assessed at Moderate or Low risk for suicide. Patients assessed for High risk for suicide should be assigned a Psychiatric Care Attendant. B. For patients on a civil commitment (for example, 201 or above in PA) who are not suicidal/homicidal, the need for psychiatric care attendant may be determined by a licensed provider based on assessment of a patient's individual risk and protective factors, in collaboration with a psychiatric clinicians if available ... 5. Care Attendant responsibilities include, but are not limited to: a. Ensuring constant observation or special constant observation, providing protection to keep a patient from harming self or others, maintaining the patient's room in a neat and orderly fashion, and immediately report any changes in mental status and/or physical status to the RN/LPN caring for the patient. ... 2. Psychiatric Care Attendant - Their other assigned duties may be limited to ensure the patient is in eyesight (CO) or within arm's distance (SCO) at all times per the physician order. ... .\" \"UPMC Policy Nursing Screening and Care of the Suicidal Patient: Purpose: The purpose of this policy to provide the steps that Somerset Hospital will use to screen patients at risk for suicide and ensure their safety while in the care of our services, as well as, to ensure identified patients have the appropriate resources to maintain safety after discharge ... Healthcare organizations should have measures in place to assess for and detect suicidal ideations, as well as, have plans in place to care for individuals who have been deemed at risk. ... Procedure:  All patients seeking care will be screened for suicide ideation. If through screening, a patient is found to be at risk for suicide a more comprehensive risk assessment will be completed.  The results of the risk assessment will determine level of supervision required, and interventions needed to ensure safety of the patient. ... previous suicide attempts, ... feelings of hopelessness ... Initial Assessment During initial assessments of patients the registered nurse will complete Columbia Suicide Patient Safety Screener consisting of 3 to 6 questions. Patient Safety Screener (suicide screen) ... The screener is completed by the unit who first contacts the patient. ... levels of Supervision:  Patient assessed as at risk-yes to questions 1 & 2 includes patients that have expressed suicide ideation, the patient is placed on constant observation by staff, suicide precautions are implemented, add event report into safety portal and notify supervisor, for patients identified as a risk a notification of the physician and behavioral health is completed. Patient assessed as high risk-yes to questions 3 through 6: Include patients that have had a suicide attempt, or have expressed clear intent. The patient is placed on constant observation by staff. Suicide precautions are implemented. ... For patients identified as a risk a notification of the physician and behavioral health is completed. The attending physician shall be made aware of the risk assessment findings and level of supervision required. An order is generated based on screening criteria. ... Patients who screen as at risk still require constant observation to mitigate environmental risk factors. ... Patients with identified Suicide Risk: For any patient that is identified as a suicidal risk and admitted in the emergency department or general medical floors the following shall be instituted for suicide precautions.  Removal of harmful objects from the room. No pens, or sharp objects. Removal of garbage cans, contact housekeeping for alternative trash collection containers. Removal of non-essential furniture and equipment. ... Inventory of patient belongings for potential harmful items. Patient clothing must be removed and patient placed into a gown. Special gowns with no strings should be used.  Patients shall be accompanied to the restroom and may not be left unattended. ... The patient must be visible to the responsible observer at all times. ... For patients in constant observation, sitters will never leave patients unattended.  Even when visitors or family is present, sitter must remain in the room. ... .\" 1.  Review of MR1 revealed that the patient presented to UPMC Somerset Emergency Department on July 5, 2023, at 5:55 PM following a clinic appointment where the patient was found in the bathroom by a counselor after cutting both both wrists with a three inch folding knife.  MR1 Suicide Safety Screen conducted at 6:04 PM confirmed \"High Suicide Precaution Orders  High Risk-Constant Observation.\"   MR1 revealed a physican order for a \"1:1 Sitter Suicide-Constant Observation\" on July 5, 2023, at 7:13 PM.  MR1 nursing documentation revealed that at 7:20 PM the patient came out of room and headed toward the ambulance bay doors and was told to return to room.  Further documentation of MR1 revealed that the patient eloped at approximately 8:00 PM. 2. Tour of the Emergency Department on July 31, 2023, was conducted with EMP5 and revealed four Emergency Department patient bays (rooms 2, 3-Cardiac Room, 8 and 9), two on either side of the nurse's station, any of which could be occupied by a patient that requires constant visual observation.  Further observation of patient bays revealed that a patient in room 2, 3-Cardiac Room, 8, and/or 9 would not be visualized from the nurses station. Review of MR1 revealed that the patient was admitted to room 3-Cardiac Room.3.  Interview with  EMP4 on July 31, 2023, at approximately 11:00 AM confirmed that the patient was not changed into a hospital gown, that the patient had attempted to leave prior to actual elopement, and that according to hospital policy the patient should have been placed in a hospital gown, and belongings should have been collected by staff and secured at the nurse's station. 4.  Telephone interview with EMP6 on August 3, 2023, confirmed that 1:1's are not typically ordered because the facility does not have the staff to sit with a patient. EMP6 also confirmed that the patient related to this investigation, MR1, was never changed into a hospital gown, personal belongings were never removed from the patient and the cardiac room was not ligature risk free. 5.  Review of MR12 and MR14 failed to reveal documented evidence of a suicide risk assessment.Review of facility electronic documentation dated August 3, 2023, from EMP1 confirmed the above finding. 6.  Review of MR2, MR5, MR7, MR12, MR 13 and MR14 failed to review documented evidence of a physician order for observation based on suicide risk assessment score-High Suicide Risk.   Review of facility electronic documentation dated August 3, 2023, from EMP1 confirmed the above finding. 7.  Review of MR1 and MR18 failed to reveal documented evidence of implementation of physician's order for Constant Observation. Review of facility electronic documentation dated August 3, 2023, from EMP1 confirmed the above finding. 8.  Review of MR1, MR5, MR13 and MR18 failed to reveal documented evidence that security procedures were conducted to eliminate safety risks.Review of facility electronic documentation dated August 3, 2023, from EMP1 confirmed the above finding.   Plan of Correction - To be completed: 09/22/2023Beginning on August 1, 2023 the Director of Emergency Nursing, ED Clinicians and/or the ED Charge Nurse will be reviewing each shift for any patients that are identified as Behavioral Health (BH) and that they have a completed suicide risk assessment documented in their medical record. If those BH patients are determined to be at risk for suicide based on the suicide risk assessment, an order for 1:1 observation will be obtained. If the provider orders a 1:1 sitter for a patient, he/she will enter the order manually and also verbally notify the charge nurse and/or Patient Care Technician (PCT) that the patient is being ordered a 1:1 sitter, based on the suicide risk assessment.  As soon as any patient is identified as a suicide risk, either the nurse or PCT will remain with the patient until a 1:1 sitter is assigned. The patient will not be alone at any time following the identification of the need for a 1:1 sitter. This process was reviewed with each ED staff member by the ED Director, ED Interim Director, ED Clinician or the ED Charge Nurse at the beginning of their next shift and was completed 8/31/2023.  Following the provider order for a 1:1 sitter, when needed, The Administrator on Duty (AOD) will be notified by the Emergency Department (ED) Charge Nurse or ED Patient Care Technician (PCT) of any suicidal patients and the need for 1:1 sitter so that staffing can be adjusted. If emergency department staffing does not allow for a 1:1 to be assigned from their current staffing level, a trained Patient Care Attendant (PCA) for a 1:1 is to be assigned to the patient by the AOD. The AOD will assign a PCA trained on 1:1 from the acute care or behavioral health units to provide the 1:1 coverage in the ED. The AOD will adjust staffing as needed for the duration of the 1:1's ordered. This process was reviewed with each ED staff member by the ED Director, ED Interim Director, ED Clinician or the ED Charge Nurse at the beginning of their next shift and was completed 8/31/2023.  Beginning August 1, 2023, to assure a safe room for Behavioral Health (BH) patients, there is a checklist for staff to follow. This checklist was reviewed with each ED staff member by the ED Director, ED Interim Director, ED Clinician or the ED Charge Nurse at the beginning of their next shift. This will continue until all staff have been educated on the checklist.  Any new employees will be educated by leadership. All documentation of that education will be maintained as proof that this has been provided and accepted by staff members.  An educational program titled \"Psychiatric & Safety Care Attendant Process Update\" has been developed and education will be implemented beginning 9/30/2023 and will be completed by 10/23/2023. Included in this educational program is a review of the Patient Rights policy HS-HD-PR01. This will be provided by the UPMC Somerset Nursing Education department who will maintain sign-off records of all staff who have completed the education.  The checklist will address ligature risks and stripping down the room for mitigation of ligature risks for behavioral health (BH) patients.  The checklist will also include the requirement to have all BH patients remove their street clothes and change into a BH safety gown.  All belongings will be removed from the room and stored in the nurses' station.  Completed checklist will be maintained on the patient's medical record. UPMC police/security will be notified by either the AOD or the ED Charge Nurse or ED PCT when the ED has identified a BH patient that is at high risk of elopement and the possibility of attempting to harm self or others. UPMC Somerset will monitor the adherence to the policy by performing audits of those medical records of BH patients each shift. These will be performed by either the ED Clinicians, ED Charge Nurse, ED Interim Director, or the Nursing AOD. If any documentation of the above plan is not found in the medical record or through observation within the ED, immediate re-education and discussion with involved staff will occur. This will be documented on the audit tool developed. The audit tool will be maintained within the ED and accessible to the Chief Nursing Officer for review as well as Nursing Leadership. This audit began 8/1/2023 and will be performed on all BH patients until there are three months of consecutive 100% compliance. After that, nursing leadership will continue with 10 audits per month ongoing for six-months of consecutive findings of 100% compliance. Any staff that are found to have patterns of non-compliance with the above process, will enter into a corrective action plan with Nursing Leadership. Results of these audits will be shared monthly at the monthly Nursing Leadership meeting beginning September 21,2023 as well as the Patient Safety Committee on September 28, 2023. Patient Safety Committee reports up to the Board Quality Committee so this will be reported monthly to Board Quality beginning October 19, 2023. 103.22 (a) LICENSURE IMPLEMENTATION:103.22  Implementation (a) The hospital governing body \nshall establish a Patient's Bill of \nRights not less in substance and \ncoverage that the  minimal Patient's \nBill of Rights provided by subsection \n(b) of this sectionObservations:Based on review of facility documents and medical records (MR) and interview with facility staff (EMP), it was determined that the facility failed to provide care in a safe setting by failing to complete the suicide risk assessment of emergency department behavioral health patients that expressed suicidal thoughts with intent to harm self in two of twenty medical records reviewed (MR12 and MR14), by failing to obtain a physician order for observation based on suicide risk assessment score in six of twenty medical records reviewed (MR2, MR5, MR7, MR12, MR13 and MR14), by failing to implement physician order for observation of emergency department behavioral health patients in two of twenty medical records (MR1 and MR18), and by failing to follow security procedures to eliminate safety risks of emergency department behavioral health patients that expressed suicidal thoughts with intent to harm self, in four of twenty medical records reviewed (MR1, MR5, MR13 and MR18).Findings include: \"UPMC Policy and Procedure Manual ... Policy:  HS-HD-PR-01* ... Subject:  Patients'  Notice and Bill of Rights and Responsibilities\" policy and procedure manual dated January 4, 2021, revealed, \"I.  Policy It is the policy of the UPMC to promote the interests and well-being of patients served in its United States based locations and to protect the interests of patients by the adoption of a Patients' Notice and Bill of Rights and Patient Responsibilities. ... Staff and Environment  You have the right to:  1.  Receive respectful care given by competent personnel in a setting that:  a.  is safe and promotes your dignity, positive self-image and comfort; ... V.  Patients' Notice and Bill of Rights Behavioral  Health Addendum  You have the right to be treated with dignity and respect. ... .\" \"UPMC Policy Safety Management Date: January 1, 2023, ... Policy Statement:  The Emergency Department will maintain standards to ensure the safety of patients, visitors, and employees in the emergency care area. ... Patients who have demonstrated a danger to themselves or others should be attended at all times by a security guard, police officer, MH/MR worker, NPU staff person, or Emergency Department staff person. ... Safety pre-cautions for patients with mental health/suicide emergencies Therapeutic interventions Provide for patient's safety and security. Assess risk for suicide. Undress the patient and remove any items from the environment that may pose a danger. The patient should be visible and within close proximity to the nurses station. ... .\"Review of \"UPMC Policy Nursing Subject: Care Attendant Utilization and Observation of Patients Date: May 24, 2023. I. Policy It is the policy of UPMC to provide for safe and therapeutic observation of patients according to individual patient needs. UPMC will utilize Care Attendants when necessary to provide observation for patients on inpatient nursing units and in emergency departments, in accordance with established standards. ... IV Definitions: Safety Care Attendant: Provides patient care, support and constant observation in accordance with established policies and procedures under the direction of the RN/LPN physician, or provider with prescriptive authority. Routinely performs the UPMC patient care core responsibilities for Safety Care Attendants which includes, but is not limited to constant observation, activities of daily such as hygiene (bath and oral care), bed making, transfer and ambulation assistance, and patient comfort measures. Psychiatric Care Attendant: Provides constant observation or special constant observation to assigned suicidal or behavioral health patients under the direction of the RN/LPN, physician, or provider with prescriptive authority. The Psychiatric Care Attendant will have limited direct responsibilities so that the patient remains in direct eyesight or, as ordered, within arm's reach at all times. As a result, the Psychiatric Care Attendant may not complete other care or ADLs for the patient that would require the Psychiatric Care Attendant to leave the room (such as going into patient's bathroom) or turn their back on the patient. Staff functioning in the Psychiatric Care Attendant role will be informed of the reason that the patient requires a Psychiatric Care Attendant by the assigned RN/LPN. Psychiatric Care Attendants may be used in non-behavioral health departments and hospitals. Constant Observation (CO): Whereby the staff continuously observes and may interact individually with he patient while keeping the patient in sight at all times. ... Patients on CO status may have issues that jeopardize their safety or the safety of others. They may exhibit behaviors or voice thoughts of suicidal, homicidal, or self-injurious intent that require staff or a Care Attendant to be observing them at all times to ensure their safety. ... V. Procedure Safety Care Attendant 1. The constant observation by Safety Care Attendant is a nurse driven intervention based on nursing judgement after alternative measures have proven ineffective. A physician's order is not required to initiate or discontinue a Safety Care Attendant. ...3. Constant Observation or Special Constant Observation in initiated by a registered nurse based on an appropriate assessment of the patient which is corroborated by the Unit Director (or designee) and/or nursing supervisor. ... Care Attendant 1. The request for a Psychiatric Care Attendant for suicidal or behavioral health patients requires the order of a physician. Nurses may initiate Constant Observation or Special Constant Observation of a patient for the safety of a patient until an order is secured. Discontinuation of a Psychiatric Care Attendant can only be completed with a physician's order. 2. Constant Observation or Special Constant Observation is to be maintained without disruption, and thus, the Psychiatric Care Attendant may have limited duties or care responsibilities, so the patient is in direct eyesight at all times. General Guidelines for Care Attendants 1. Care Attendants resources will be reasonably allocated and prioritized based on overall safety considerations in the following order: a. For patients with a positive suicidal/homicidal screening with or without a civil commitment (201 or above in PA) - a Psychiatric Care Attendant is required and ordered by the provider.  i. In lieu of a Psychiatric Care Attendant, a tele-sitter (video monitoring) may be used for patients assessed at Moderate or Low risk for suicide. Patients assessed for High risk for suicide should be assigned a Psychiatric Care Attendant. B. For patients on a civil commitment (for example, 201 or above in PA) who are not suicidal/homicidal, the need for psychiatric care attendant may be determined by a licensed provider based on assessment of a patient's individual risk and protective factors, in collaboration with a psychiatric clinicians if available ... 5. Care Attendant responsibilities include, but are not limited to: a. Ensuring constant observation or special constant observation, providing protection to keep a patient from harming self or others, maintaining the patient's room in a neat and orderly fashion, and immediately report any changes in mental status and/or physical status to the RN/LPN caring for the patient. ... 2. Psychiatric Care Attendant - Their other assigned duties may be limited to ensure the patient is in eyesight (CO) or within arm's distance (SCO) at all times per the physician order. ... .\" \"UPMC Policy Nursing Screening and Care of the Suicidal Patient: Purpose: The purpose of this policy to provide the steps that Somerset Hospital will use to screen patients at risk for suicide and ensure their safety while in the care of our services, as well as, to ensure identified patients have the appropriate resources to maintain safety after discharge ... Healthcare organizations should have measures in place to assess for and detect suicidal ideations, as well as, have plans in place to care for individuals who have been deemed at risk. ... Procedure:  All patients seeking care will be screened for suicide ideation. If through screening, a patient is found to be at risk for suicide a more comprehensive risk assessment will be completed.  The results of the risk assessment will determine level of supervision required, and interventions needed to ensure safety of the patient. ... previous suicide attempts, ... feelings of hopelessness ... Initial Assessment During initial assessments of patients the registered nurse will complete Columbia Suicide Patient Safety Screener consisting of 3 to 6 questions. Patient Safety Screener (suicide screen) ... The screener is completed by the unit who first contacts the patient. ... levels of Supervision:  Patient assessed as at risk-yes to questions 1 & 2 includes patients that have expressed suicide ideation, the patient is placed on constant observation by staff, suicide precautions are implemented, add event report into safety portal and notify supervisor, for patients identified as a risk a notification of the physician and behavioral health is completed. Patient assessed as high risk-yes to questions 3 through 6: Include patients that have had a suicide attempt, or have expressed clear intent. The patient is placed on constant observation by staff. Suicide precautions are implemented. ... For patients identified as a risk a notification of the physician and behavioral health is completed. The attending physician shall be made aware of the risk assessment findings and level of supervision required. An order is generated based on screening criteria. ... Patients who screen as at risk still require constant observation to mitigate environmental risk factors. ... Patients with identified Suicide Risk: For any patient that is identified as a suicidal risk and admitted in the emergency department or general medical floors the following shall be instituted for suicide precautions.  Removal of harmful objects from the room. No pens, or sharp objects. Removal of garbage cans, contact housekeeping for alternative trash collection containers. Removal of non-essential furniture and equipment. ... Inventory of patient belongings for potential harmful items. Patient clothing must be removed and patient placed into a gown. Special gowns with no strings should be used.  Patients shall be accompanied to the restroom and may not be left unattended. ... The patient must be visible to the responsible observer at all times. ... For patients in constant observation, sitters will never leave patients unattended.  Even when visitors or family is present, sitter must remain in the room. ... .\" 1.  Review of MR1 revealed that the patient presented to UPMC Somerset Emergency Department on July 5, 2023, at 5:55 PM following a clinic appointment where the patient was found in the bathroom by a counselor after cutting both both wrists with a three inch folding knife.  MR1 Suicide Safety Screen conducted at 6:04 PM confirmed \"High Suicide Precaution Orders  High Risk-Constant Observation.\"   MR1 revealed a physican order for a \"1:1 Sitter Suicide-Constant Observation\" on July 5, 2023, at 7:13 PM.  MR1 nursing documentation revealed that at 7:20 PM the patient came out of room and headed toward the ambulance bay doors and was told to return to room.  Further documentation of MR1 revealed that the patient eloped at approximately 8:00 PM. 2. Tour of the Emergency Department on July 31, 2023, was conducted with EMP5 and revealed four Emergency Department patient bays (rooms 2, 3-Cardiac Room, 8 and 9), two on either side of the nurse's station, any of which could be occupied by a patient that requires constant visual observation.  Further observation of patient bays revealed that a patient in room 2, 3-Cardiac Room, 8, and/or 9 would not be visualized from the nurses station. Review of MR1 revealed that the patient was admitted to room 3-Cardiac Room.3.  Interview with  EMP4 on July 31, 2023, at approximately 11:00 AM confirmed that the patient was not changed into a hospital gown, that the patient had attempted to leave prior to actual elopement, and that according to hospital policy the patient should have been placed in a hospital gown, and belongings should have been collected by staff and secured at the nurse's station. 4.  Telephone interview with EMP6 on August 3, 2023, confirmed that 1:1's are not typically ordered because the facility does not have the staff to sit with a patient. EMP6 also confirmed that the patient related to this investigation, MR1, was never changed into a hospital gown, personal belongings were never removed from the patient and the cardiac room was not ligature risk free. 5.  Review of MR12 and MR14 failed to reveal documented evidence of a suicide risk assessment.Review of facility electronic documentation dated August 3, 2023, from EMP1 confirmed the above finding. 6.  Review of MR2, MR5, MR7, MR12, MR 13 and MR14 failed to review documented evidence of a physician order for observation based on suicide risk assessment score-High Suicide Risk.   Review of facility electronic documentation dated August 3, 2023, from EMP1 confirmed the above finding. 7.  Review of MR1 and MR18 failed to reveal documented evidence of implementation of physician's order for Constant Observation. Review of facility electronic documentation dated August 3, 2023, from EMP1 confirmed the above finding. 8.  Review of MR1, MR5, MR13 and MR18 failed to reveal documented evidence that security procedures were conducted to eliminate safety risks.Review of facility electronic documentation dated August 3, 2023, from EMP1 confirmed the above finding.  Plan of Correction - To be completed: 09/22/2023Beginning on August 1, 2023 the Director of Emergency Nursing, ED Clinicians and/or the ED Charge Nurse will be reviewing each shift for any patients that are identified as Behavioral Health (BH) and that they have a completed suicide risk assessment documented in their medical record. If those BH patients are determined to be at risk for suicide based on the suicide risk assessment, an order for 1:1 observation will be obtained. If the provider orders a 1:1 sitter for a patient, he/she will enter the order manually and also verbally notify the charge nurse and/or Patient Care Technician (PCT) that the patient is being ordered a 1:1 sitter, based on the suicide risk assessment. As soon as any patient is identified as a suicide risk, either the nurse or PCT will remain with the patient until a 1:1 sitter is assigned. The patient will not be alone at any time following the identification of the need for a 1:1 sitter. This process was reviewed with each ED staff member by the ED Director, ED Interim Director, ED Clinician or the ED Charge Nurse at the beginning of their next shift and was completed 8/31/2023.Following the provider order for a 1:1 sitter, when needed, The Administrator on Duty (AOD) will be notified by the Emergency Department (ED) Charge Nurse or ED Patient Care Technician (PCT) of any suicidal patients and the need for 1:1 sitter so that staffing can be adjusted. If emergency department staffing does not allow for a 1:1 to be assigned from their current staffing level, a trained Patient Care Attendant (PCA) for a 1:1 is to be assigned to the patient by the AOD. The AOD will assign a PCA trained on 1:1 from the acute care or behavioral health units to provide the 1:1 coverage in the ED. The AOD will adjust staffing as needed for the duration of the 1:1's ordered. This process was reviewed with each ED staff member by the ED Director, ED Interim Director, ED Clinician or the ED Charge Nurse at the beginning of their next shift and was completed 8/31/2023.Beginning August 1, 2023, to assure a safe room for Behavioral Health (BH) patients, there is a checklist for staff to follow. This checklist was reviewed with each ED staff member by the ED Director, ED Interim Director, ED Clinician or the ED Charge Nurse at the beginning of their next shift. This will continue until all staff have been educated on the checklist. Any new employees will be educated by leadership. All documentation of that education will be maintained as proof that this has been provided and accepted by staff members. An educational program titled \"Psychiatric & Safety Care Attendant Process Update\" has been developed and education will be implemented beginning 9/30/2023 and will be completed by 10/23/2023. Included in this educational program is a review of the Patient Rights policy HS-HD-PR01. This will be provided by the UPMC Somerset Nursing Education department who will maintain sign-off records of all staff who have completed the education.The checklist will address ligature risks and stripping down the room for mitigation of ligature risks for behavioral health (BH) patients. The checklist will also include the requirement to have all BH patients remove their street clothes and change into a BH safety gown. All belongings will be removed from the room and stored in the nurses' station. Completed checklist will be maintained on the patient's medical record. UPMC police/security will be notified by either the AOD or the ED Charge Nurse or ED PCT when the ED has identified a BH patient that is at high risk of elopement and the possibility of attempting to harm self or others.UPMC Somerset will monitor the adherence to the policy by performing audits of those medical records of BH patients each shift. These will be performed by either the ED Clinicians, ED Charge Nurse, ED Interim Director, or the Nursing AOD. If any documentation of the above plan is not found in the medical record or through observation within the ED, immediate re-education and discussion with involved staff will occur. This will be documented on the audit tool developed. The audit tool will be maintained within the ED and accessible to the Chief Nursing Officer for review as well as Nursing Leadership. This audit began 8/1/2023 and will be performed on all BH patients until there are three months of consecutive 100% compliance. After that, nursing leadership will continue with 10 audits per month ongoing for six-months of consecutive findings of 100% compliance.Any staff that are found to have patterns of non-compliance with the above process, will enter into a corrective action plan with Nursing Leadership.Results of these audits will be shared monthly at the monthly Nursing Leadership meeting beginning September 21,2023 as well as the Patient Safety Committee on September 28, 2023. Patient Safety Committee reports up to the Board Quality Committee so this will be reported monthly to Board Quality beginning October 19, 2023. 103.22 (a) LICENSURE IMPLEMENTATION: 103.22  Implementation (a) The hospital governing body \nshall establish a Patient's Bill of \nRights not less in substance and \ncoverage that the  minimal Patient's \nBill of Rights provided by subsection \n(b) of this section Observations:Based on review of facility documents and medical records (MR) and interview with facility staff (EMP), it was determined that the facility failed to provide care in a safe setting by failing to complete the suicide risk assessment of emergency department behavioral health patients that expressed suicidal thoughts with intent to harm self in two of twenty medical records reviewed (MR12 and MR14), by failing to obtain a physician order for observation based on suicide risk assessment score in six of twenty medical records reviewed (MR2, MR5, MR7, MR12, MR13 and MR14), by failing to implement physician order for observation of emergency department behavioral health patients in two of twenty medical records (MR1 and MR18), and by failing to follow security procedures to eliminate safety risks of emergency department behavioral health patients that expressed suicidal thoughts with intent to harm self, in four of twenty medical records reviewed (MR1, MR5, MR13 and MR18).Findings include: \"UPMC Policy and Procedure Manual ... Policy:  HS-HD-PR-01* ... Subject:  Patients'  Notice and Bill of Rights and Responsibilities\" policy and procedure manual dated January 4, 2021, revealed, \"I.  Policy It is the policy of the UPMC to promote the interests and well-being of patients served in its United States based locations and to protect the interests of patients by the adoption of a Patients' Notice and Bill of Rights and Patient Responsibilities. ... Staff and Environment  You have the right to:  1.  Receive respectful care given by competent personnel in a setting that:  a.  is safe and promotes your dignity, positive self-image and comfort; ... V.  Patients' Notice and Bill of Rights Behavioral  Health Addendum  You have the right to be treated with dignity and respect. ... .\" \"UPMC Policy Safety Management Date: January 1, 2023, ... Policy Statement:  The Emergency Department will maintain standards to ensure the safety of patients, visitors, and employees in the emergency care area. ... Patients who have demonstrated a danger to themselves or others should be attended at all times by a security guard, police officer, MH/MR worker, NPU staff person, or Emergency Department staff person. ... Safety pre-cautions for patients with mental health/suicide emergencies Therapeutic interventions Provide for patient's safety and security. Assess risk for suicide. Undress the patient and remove any items from the environment that may pose a danger. The patient should be visible and within close proximity to the nurses station. ... .\"Review of \"UPMC Policy Nursing Subject: Care Attendant Utilization and Observation of Patients Date: May 24, 2023. I. Policy It is the policy of UPMC to provide for safe and therapeutic observation of patients according to individual patient needs. UPMC will utilize Care Attendants when necessary to provide observation for patients on inpatient nursing units and in emergency departments, in accordance with established standards. ... IV Definitions: Safety Care Attendant: Provides patient care, support and constant observation in accordance with established policies and procedures under the direction of the RN/LPN physician, or provider with prescriptive authority. Routinely performs the UPMC patient care core responsibilities for Safety Care Attendants which includes, but is not limited to constant observation, activities of daily such as hygiene (bath and oral care), bed making, transfer and ambulation assistance, and patient comfort measures. Psychiatric Care Attendant: Provides constant observation or special constant observation to assigned suicidal or behavioral health patients under the direction of the RN/LPN, physician, or provider with prescriptive authority. The Psychiatric Care Attendant will have limited direct responsibilities so that the patient remains in direct eyesight or, as ordered, within arm's reach at all times. As a result, the Psychiatric Care Attendant may not complete other care or ADLs for the patient that would require the Psychiatric Care Attendant to leave the room (such as going into patient's bathroom) or turn their back on the patient. Staff functioning in the Psychiatric Care Attendant role will be informed of the reason that the patient requires a Psychiatric Care Attendant by the assigned RN/LPN. Psychiatric Care Attendants may be used in non-behavioral health departments and hospitals. Constant Observation (CO): Whereby the staff continuously observes and may interact individually with he patient while keeping the patient in sight at all times. ... Patients on CO status may have issues that jeopardize their safety or the safety of others. They may exhibit behaviors or voice thoughts of suicidal, homicidal, or self-injurious intent that require staff or a Care Attendant to be observing them at all times to ensure their safety. ... V. Procedure Safety Care Attendant 1. The constant observation by Safety Care Attendant is a nurse driven intervention based on nursing judgement after alternative measures have proven ineffective. A physician's order is not required to initiate or discontinue a Safety Care Attendant. ...3. Constant Observation or Special Constant Observation in initiated by a registered nurse based on an appropriate assessment of the patient which is corroborated by the Unit Director (or designee) and/or nursing supervisor. ... Care Attendant 1. The request for a Psychiatric Care Attendant for suicidal or behavioral health patients requires the order of a physician. Nurses may initiate Constant Observation or Special Constant Observation of a patient for the safety of a patient until an order is secured. Discontinuation of a Psychiatric Care Attendant can only be completed with a physician's order. 2. Constant Observation or Special Constant Observation is to be maintained without disruption, and thus, the Psychiatric Care Attendant may have limited duties or care responsibilities, so the patient is in direct eyesight at all times. General Guidelines for Care Attendants 1. Care Attendants resources will be reasonably allocated and prioritized based on overall safety considerations in the following order: a. For patients with a positive suicidal/homicidal screening with or without a civil commitment (201 or above in PA) - a Psychiatric Care Attendant is required and ordered by the provider.  i. In lieu of a Psychiatric Care Attendant, a tele-sitter (video monitoring) may be used for patients assessed at Moderate or Low risk for suicide. Patients assessed for High risk for suicide should be assigned a Psychiatric Care Attendant. B. For patients on a civil commitment (for example, 201 or above in PA) who are not suicidal/homicidal, the need for psychiatric care attendant may be determined by a licensed provider based on assessment of a patient's individual risk and protective factors, in collaboration with a psychiatric clinicians if available ... 5. Care Attendant responsibilities include, but are not limited to: a. Ensuring constant observation or special constant observation, providing protection to keep a patient from harming self or others, maintaining the patient's room in a neat and orderly fashion, and immediately report any changes in mental status and/or physical status to the RN/LPN caring for the patient. ... 2. Psychiatric Care Attendant - Their other assigned duties may be limited to ensure the patient is in eyesight (CO) or within arm's distance (SCO) at all times per the physician order. ... .\" \"UPMC Policy Nursing Screening and Care of the Suicidal Patient: Purpose: The purpose of this policy to provide the steps that Somerset Hospital will use to screen patients at risk for suicide and ensure their safety while in the care of our services, as well as, to ensure identified patients have the appropriate resources to maintain safety after discharge ... Healthcare organizations should have measures in place to assess for and detect suicidal ideations, as well as, have plans in place to care for individuals who have been deemed at risk. ... Procedure:  All patients seeking care will be screened for suicide ideation. If through screening, a patient is found to be at risk for suicide a more comprehensive risk assessment will be completed.  The results of the risk assessment will determine level of supervision required, and interventions needed to ensure safety of the patient. ... previous suicide attempts, ... feelings of hopelessness ... Initial Assessment During initial assessments of patients the registered nurse will complete Columbia Suicide Patient Safety Screener consisting of 3 to 6 questions. Patient Safety Screener (suicide screen) ... The screener is completed by the unit who first contacts the patient. ... levels of Supervision:  Patient assessed as at risk-yes to questions 1 & 2 includes patients that have expressed suicide ideation, the patient is placed on constant observation by staff, suicide precautions are implemented, add event report into safety portal and notify supervisor, for patients identified as a risk a notification of the physician and behavioral health is completed. Patient assessed as high risk-yes to questions 3 through 6: Include patients that have had a suicide attempt, or have expressed clear intent. The patient is placed on constant observation by staff. Suicide precautions are implemented. ... For patients identified as a risk a notification of the physician and behavioral health is completed. The attending physician shall be made aware of the risk assessment findings and level of supervision required. An order is generated based on screening criteria. ... Patients who screen as at risk still require constant observation to mitigate environmental risk factors. ... Patients with identified Suicide Risk: For any patient that is identified as a suicidal risk and admitted in the emergency department or general medical floors the following shall be instituted for suicide precautions.  Removal of harmful objects from the room. No pens, or sharp objects. Removal of garbage cans, contact housekeeping for alternative trash collection containers. Removal of non-essential furniture and equipment. ... Inventory of patient belongings for potential harmful items. Patient clothing must be removed and patient placed into a gown. Special gowns with no strings should be used.  Patients shall be accompanied to the restroom and may not be left unattended. ... The patient must be visible to the responsible observer at all times. ... For patients in constant observation, sitters will never leave patients unattended.  Even when visitors or family is present, sitter must remain in the room. ... .\" 1.  Review of MR1 revealed that the patient presented to UPMC Somerset Emergency Department on July 5, 2023, at 5:55 PM following a clinic appointment where the patient was found in the bathroom by a counselor after cutting both both wrists with a three inch folding knife.  MR1 Suicide Safety Screen conducted at 6:04 PM confirmed \"High Suicide Precaution Orders  High Risk-Constant Observation.\"   MR1 revealed a physican order for a \"1:1 Sitter Suicide-Constant Observation\" on July 5, 2023, at 7:13 PM.  MR1 nursing documentation revealed that at 7:20 PM the patient came out of room and headed toward the ambulance bay doors and was told to return to room.  Further documentation of MR1 revealed that the patient eloped at approximately 8:00 PM. 2. Tour of the Emergency Department on July 31, 2023, was conducted with EMP5 and revealed four Emergency Department patient bays (rooms 2, 3-Cardiac Room, 8 and 9), two on either side of the nurse's station, any of which could be occupied by a patient that requires constant visual observation.  Further observation of patient bays revealed that a patient in room 2, 3-Cardiac Room, 8, and/or 9 would not be visualized from the nurses station. Review of MR1 revealed that the patient was admitted to room 3-Cardiac Room.3.  Interview with  EMP4 on July 31, 2023, at approximately 11:00 AM confirmed that the patient was not changed into a hospital gown, that the patient had attempted to leave prior to actual elopement, and that according to hospital policy the patient should have been placed in a hospital gown, and belongings should have been collected by staff and secured at the nurse's station. 4.  Telephone interview with EMP6 on August 3, 2023, confirmed that 1:1's are not typically ordered because the facility does not have the staff to sit with a patient. EMP6 also confirmed that the patient related to this investigation, MR1, was never changed into a hospital gown, personal belongings were never removed from the patient and the cardiac room was not ligature risk free. 5.  Review of MR12 and MR14 failed to reveal documented evidence of a suicide risk assessment.Review of facility electronic documentation dated August 3, 2023, from EMP1 confirmed the above finding. 6.  Review of MR2, MR5, MR7, MR12, MR 13 and MR14 failed to review documented evidence of a physician order for observation based on suicide risk assessment score-High Suicide Risk.   Review of facility electronic documentation dated August 3, 2023, from EMP1 confirmed the above finding. 7.  Review of MR1 and MR18 failed to reveal documented evidence of implementation of physician's order for Constant Observation. Review of facility electronic documentation dated August 3, 2023, from EMP1 confirmed the above finding. 8.  Review of MR1, MR5, MR13 and MR18 failed to reveal documented evidence that security procedures were conducted to eliminate safety risks.Review of facility electronic documentation dated August 3, 2023, from EMP1 confirmed the above finding.  Plan of Correction - To be completed: 09/22/2023Beginning on August 1, 2023 the Director of Emergency Nursing, ED Clinicians and/or the ED Charge Nurse will be reviewing each shift for any patients that are identified as Behavioral Health (BH) and that they have a completed suicide risk assessment documented in their medical record. If those BH patients are determined to be at risk for suicide based on the suicide risk assessment, an order for 1:1 observation will be obtained. If the provider orders a 1:1 sitter for a patient, he/she will enter the order manually and also verbally notify the charge nurse and/or Patient Care Technician (PCT) that the patient is being ordered a 1:1 sitter, based on the suicide risk assessment. As soon as any patient is identified as a suicide risk, either the nurse or PCT will remain with the patient until a 1:1 sitter is assigned. The patient will not be alone at any time following the identification of the need for a 1:1 sitter. This process was reviewed with each ED staff member by the ED Director, ED Interim Director, ED Clinician or the ED Charge Nurse at the beginning of their next shift and was completed 8/31/2023.Following the provider order for a 1:1 sitter, when needed, The Administrator on Duty (AOD) will be notified by the Emergency Department (ED) Charge Nurse or ED Patient Care Technician (PCT) of any suicidal patients and the need for 1:1 sitter so that staffing can be adjusted. If emergency department staffing does not allow for a 1:1 to be assigned from their current staffing level, a trained Patient Care Attendant (PCA) for a 1:1 is to be assigned to the patient by the AOD. The AOD will assign a PCA trained on 1:1 from the acute care or behavioral health units to provide the 1:1 coverage in the ED. The AOD will adjust staffing as needed for the duration of the 1:1's ordered. This process was reviewed with each ED staff member by the ED Director, ED Interim Director, ED Clinician or the ED Charge Nurse at the beginning of their next shift and was completed 8/31/2023.Beginning August 1, 2023, to assure a safe room for Behavioral Health (BH) patients, there is a checklist for staff to follow. This checklist was reviewed with each ED staff member by the ED Director, ED Interim Director, ED Clinician or the ED Charge Nurse at the beginning of their next shift. This will continue until all staff have been educated on the checklist. Any new employees will be educated by leadership. All documentation of that education will be maintained as proof that this has been provided and accepted by staff members. An educational program titled \"Psychiatric & Safety Care Attendant Process Update\" has been developed and education will be implemented beginning 9/30/2023 and will be completed by 10/23/2023. Included in this educational program is a review of the Patient Rights policy HS-HD-PR01. This will be provided by the UPMC Somerset Nursing Education department who will maintain sign-off records of all staff who have completed the education.The checklist will address ligature risks and stripping down the room for mitigation of ligature risks for behavioral health (BH) patients. The checklist will also include the requirement to have all BH patients remove their street clothes and change into a BH safety gown. All belongings will be removed from the room and stored in the nurses' station. Completed checklist will be maintained on the patient's medical record. UPMC police/security will be notified by either the AOD or the ED Charge Nurse or ED PCT when the ED has identified a BH patient that is at high risk of elopement and the possibility of attempting to harm self or others.UPMC Somerset will monitor the adherence to the policy by performing audits of those medical records of BH patients each shift. These will be performed by either the ED Clinicians, ED Charge Nurse, ED Interim Director, or the Nursing AOD. If any documentation of the above plan is not found in the medical record or through observation within the ED, immediate re-education and discussion with involved staff will occur. This will be documented on the audit tool developed. The audit tool will be maintained within the ED and accessible to the Chief Nursing Officer for review as well as Nursing Leadership. This audit began 8/1/2023 and will be performed on all BH patients until there are three months of consecutive 100% compliance. After that, nursing leadership will continue with 10 audits per month ongoing for six-months of consecutive findings of 100% compliance.Any staff that are found to have patterns of non-compliance with the above process, will enter into a corrective action plan with Nursing Leadership.Results of these audits will be shared monthly at the monthly Nursing Leadership meeting beginning September 21,2023 as well as the Patient Safety Committee on September 28, 2023. Patient Safety Committee reports up to the Board Quality Committee so this will be reported monthly to Board Quality beginning October 19, 2023."
        },
        {
            "eventid": "TQEJ11",
            "date": "8/18/2023",
            "data": "Initial comments:This report is for new equipment, Smartablate System, CardioLab System beginning on September 15, 2023. The UPMC Somerset Hospital attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998.This report is for the new service, Electrophysiology, beginning on September 15, 2023. The UPMC Somerset Hospital attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is for new equipment, Smartablate System, CardioLab System beginning on September 15, 2023. The UPMC Somerset Hospital attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998.This report is for the new service, Electrophysiology, beginning on September 15, 2023. The UPMC Somerset Hospital attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "PNOT11",
            "date": "7/19/2023",
            "data": "Initial comments:This report is the result of an unannounced offsite complaint investigation CHL23C461J completed on July 19, 2023, at UPMC Somerset.  It was determined that the facility WAS  in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced offsite complaint investigation CHL23C461J completed on July 19, 2023, at UPMC Somerset.  It was determined that the facility WAS  in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "0Y5J11",
            "date": "6/29/2023",
            "data": "Initial comments:This report is the result of an unannounced offsite complaint investigation CHL23C352J completed on June 29, 2023, at UPMC Somerset.  It was determined that the facility WAS  in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced offsite complaint investigation CHL23C352J completed on June 29, 2023, at UPMC Somerset.  It was determined that the facility WAS  in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "XGHY11",
            "date": "4/28/2023",
            "data": "Initial comments:This report is for replacement equipment, Servo U ventilators, beginning on March 1, 2023. UPMC Somerset attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is for replacement equipment, Servo U ventilators, beginning on March 1, 2023. UPMC Somerset attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "TW2511",
            "date": "4/19/2023",
            "data": "Initial comments:This report is the result of an unannounced onsite complaint investigation (CHL22C842J) completed on April 19, 2023, at UPMC Somerset.  It was determined that the facility was not in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced onsite complaint investigation (CHL22C842J) completed on April 19, 2023, at UPMC Somerset.  It was determined that the facility was not in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: 117.41 (a) LICENSURE EMERGENCY PATIENT CARE:117.41  Emergency patient care (a) Emergency patient care shall be guided by written policies and procedures which delineate the proper administrative and medical procedures and methods to be followed in providing emergency care. These policies and procedures shall be clear and explicit; approved by the medical staff and hospital governing body; reviewed annually, revised as necessary; and dated to indicate the date of the latest review or revision, or both.Observations:Based on review of facility documents, medical records (MR) and interview with facility staff (EMP), it was determined that the facility failed to follow their adopted Emergency Department (ED) policy by failing to ensure that a provider examination was conducted timely in relation to the patient's assigned triage class scale in 9 of 10 medical records reviewed (MR1, MR2, MR3,MR4, MR5, MR6, MR7, MR8 and MR10).   Findings Include:  Review of UPMC Somerset Policy HS-HD-PR-01 \"Patient Rights\" Last Revised January 2021, revealed \"... I. Policy: It is the policy of the UPMC to promote the interests and well-being of patients served in its United States based locations and to protect the interests of patients by the adoption of a Patients' Notice and Bill of Rights and Patient Responsibilities. ... Purpose:  The Patients' Notice and Bill of Rights and Patient Responsibilities is made available to patients, their family members and representatives via patient information materials and postings ... Other Healthcare Services: You have a right to: 1. Emergency procedures to be implemented without unnecessary delay. ...\"  Review of UPMC Somerset Policy Stat ID# 10063883 \"Triage\" Last Approved June 2022, revealed \"... Associated Policies/Cross References: N/A Policy Statement:  To ensure appropriate priority of care for Emergency Department patients the Emergency Department screens each patient presenting to the Emergency Department to determine priority of treatment according to the Emergency Severity Index.  Procedure: Guidelines for Patients being treated/tested/seen by and MD/PA:  Triage: class 1:  Stability of vital signs: unstable Severe pain/distress: Yes Examples: cardiac arrest, intubated trauma, severe overdose  Maximum wait time to be seen by MD/PA after triage: immediate  class 2:  Stability of vital signs: threatened Severe pain/distress: Yes Examples: most chest pains, stable traumas, difficulty breathing, altered mental status, active seizures, overdose w/patent airway, stroke symptoms, behavioral problems w/potential for violence  Maximum wait time to be seen by MD/PA after triage:  15 minutes  class 3:  Stability of vital signs: stable Severe pain/distress: No Examples: seizure history arrives awake, severe pain (6-10) as in a kidney stone, asthma attack w/good air exchange and sp02 > 93, suspected threatened abortion, most abdominal pains, cooperative mental health patients, general nursing home workup for >24 hour complaints  Maximum wait time to be seen by MD/PA after triage:  30 minutes  class 4:  Stability of vital signs: stable Severe pain/distress: No Examples: Fever > 102, headaches w/o neurological signs, chest pain in children or young adult w/o history, lacerations that require plastics or are complex, animal bite, constipation, simple fractures, corneal abrasions  Maximum wait time to be seen by MD/PA after triage:  60 minutes  class 5:  Stability of vital signs: stable Severe pain/distress: No  Examples:  Convenience visits (requests for testing), extremity injuries >12 hours old, fever <102 on admission, sore throats, flu symptoms, rashes, URI symptoms, UTI symptoms, conjunctivitis, minor lacerations or burns,   immunizations shots, tooth pain Maximum wait time to be seen by MD/PA after triage:  90 minutes  An experienced Charge RN is assigned to dedicated triage duty 24 hours a day.  Patients are triaged and assigned, by the charge nurse, an Emergency Severity Index, based on a 1-5 category-based triage system.  The triage note is entered by the Charge nurse into the EDM tracker board.  Vital signs, including temperature, blood pressure, pulse oximetry, height and weight, and pain score will be taken and recorded in EDM computer triage program.  The physician will be informed by the RN regarding patient's condition and directed to the patient having first priority. ...\"Review of UPMC Somerset PolicyStat ID 11865740 \"Medical Screening Examination\" Last Approved  October 2022, revealed \"... Policy Statement:  Somerset Hospital, Department of Emergency of Emergency Medicine has a standardized process to ensure that patients presenting for medical care receive an appropriate medical screening examination by a qualified medical person. ... Procedure:  Triage is the process by which a quick determination is made as to how quickly and how extensive the ED resources should be used to provide patient treatment.  Triage is not the same as a medical screening examination.  Triage is a process which determines when a patient is seen by a physician, not whether he is seen.  The Emergency Department physician, nurse practitioner, or physician assistant on duty is regarded as qualified medical personnel and responsible for providing each patient with an appropriate medical screening examination. ...\" 1.  Review of MR1 dated September 15, 2022, revealed the patient was triaged, Acuity 3 Urgent, at 3:05 PM with a chief complaint of postoperative complications from skin lesions removed from the right arm two days ago with bleeding still noted.  Continued review of MR1 revealed that the patient eloped at 7:24 PM.  MR1 revealed no documented evidence that the patient was seen by MD/PA within 30 minutes following triage.  2.  Review of MR2 dated September 1, 2022, revealed the patient was triaged,  Acuity 3 Urgent, at 10:33 AM with a chief complaint of headache and shortness of breath for a few days.  Continued review of MR2 revealed that the patient eloped at 1:06 PM.  Provider entered documentation at 1:07 PM that patient had testing done through triage, was never brought back to the ER and was not seen by a provider.   MR2 revealed no documented evidence that the patient was seen by MD/PA within 30 minutes following triage.  3.  Review of MR3 dated September 1, 2022, revealed the patient was triaged, Acuity 3 Urgent, at 2:28 PM with a chief complaint of abdominal pain. Continued review of MR3 revealed that the patient eloped at 5:39 PM.  Provider entered documentation at 5:45 PM that the patient was triaged but was never seen by a provider.  MR3 revealed no documented evidence that the patient was seen by MD/PA within 30 minutes following triage.  4.  Review of MR4 dated September 29, 2022, revealed the patient was triaged, Acuity 4 Less urgent at 5:37 PM with a chief complaint of periorbital pain. Continued review of MR4 revealed that the patient eloped at 8:26 PM.  MR4 revealed no documented evidence that the patient was seen by MD/PA within 60 minutes following triage. 5. Review of MR5 dated September 06, 2022, revealed the patient was triaged, Acuity 4 Less urgent at 11:42 AM with a chief complaint of shortness of breath. Continued review of MR5 revealed that the patient eloped 2:53 PM. MR5 revealed no documented evidence that the patient was seen by MD/PA within 60 minutes following triage. 6.  Review of MR6 dated September 06, 2022 revealed the patient was triaged, Acuity 4 less urgent at 12:17 PM with a chief complaint of shortness of breath.  Continued review of MR6 revealed that the patient eloped at 2:55 PM. MR6 revealed no documented evidence that the patient was seen by MD/PA within 60 minutes following triage. 7.  Review of MR7 dated September 12, 2022, revealed the patient was triaged, Acuity 4 less urgent at 11:02 PM with a chief complaint of upper extremity injury.  Continued review of MR7 revealed that the patient eloped at 11:51 PM.  MR7 revealed no documented evidence that the patient was seen by MD/PA within 60 minutes following triage. 8.  Review of MR8 dated September 14, 2022, revealed the patient was triaged, Acuity 3 urgent at 4:21 PM with a chief complaint of choking.  Continued review of MR8 revealed that the patient eloped at 9:51 PM.  MR8 revealed no documented evidence that the patient was seen by MD/PA within 30 minutes following triage. 9.  Review of MR10 dated September 19, 2022, revealed the patient was triaged Acuity 3at 3:12 PM with a chief complaint of chest pain.  Continued review of MR10 revealed that the patient eloped at 5:59 PM.  MR10 revealed no documented evidence that the patient was seen by MD/PA within 30 minutes following triage. Interview on April 18, 2023, at approximately 11:15 AM with EMP2 confirmed the above findings.   Plan of Correction - To be completed: 05/24/2023UPMC Somerset will implement the following changes to meet the expectations of UPMC Somerset Policy HS-HD-PR01 \"Patient Rights\". Education will begin on 5/15/2023 with the UPMC Somerset policy for EMTALA HS-LE0007. Leadership from Patient Access and Emergency Department will have all care providers and registrars within the UPMC Somerset Emergency Department and UPMC Patient Access review the EMTALA policy and sign off as completed by May 30, 2023. EMTALA education, which is required bi-annually, will be completed October 2023, with all safety education that is provided by the UPMC system to every employee as a required education.  UPMC Somerset will be adopting a UPMC system related policy named \"Assessment/Reassessment\" that will take the place of our current Triage Policy (Policy Stat ID #10063883) and Medical Screening Examination Policy (Policy Stat ID #11865740) following the closure of the Plan of Correction. This new policy will be adopted by June 14, 2023 and the two previous referenced policies will be retired. This policy will include the following: Patients will be reassessed in the ED Based on ESI assigned, or more frequently as patient condition warrants.  The new Assessment/Reassessment Policy will be presented and approved at the Medical Executive Committee meeting to be held on June 14, 2023 by the Patient Safety Officer. Following adoption of this policy, education of all Emergency Department staff will be completed by June 30, 2023  UPMC Somerset Emergency Department has added a Patient Care Technician (PCT) in the registration area during peak times or when there is an influx of multiple patients presenting to the Emergency Department for care. The PCT will monitor the area by doing rounds, provide updates to patients or support persons about wait time, and identify any urgent changes in conditions. This is active as of April 1, 2023.  UPMC Somerset Emergency Department has ordered signage for the Emergency Department waiting area to explain that patients are taken in order of their acuity.  UPMC Somerset Emergency Department Nursing Leadership will pull 5 (five) random emergency department medical records per day to review the documentation to ensure that patients presenting for medical care receive an appropriate medical screening examination by a qualified medical person based on their presentation, condition, complaints and acuity. An excel spreadsheet of all records reviewed will be maintained and will begin July 1, 2023 (following completion of previous mentioned education) and conclude July 31, 2023. Audits completed in July will be reviewed at the August 17, 2023 Board Quality Committee. Any records found to not meet the guidelines of our current policies will be reviewed with those staff involved in the care of the patient by the Director of Emergency Services. If there is low compliance, Nursing Leadership will continue to monitor until August 31, 2023 and reevaluate compliance at that time. Any further audits from August (if needed) 2023 will be reviewed at the September 21, 2023 Board Quality Committee meeting. 117.41 (a) LICENSURE EMERGENCY PATIENT CARE: 117.41  Emergency patient care (a) Emergency patient care shall be guided by written policies and procedures which delineate the proper administrative and medical procedures and methods to be followed in providing emergency care. These policies and procedures shall be clear and explicit; approved by the medical staff and hospital governing body; reviewed annually, revised as necessary; and dated to indicate the date of the latest review or revision, or both. Observations:Based on review of facility documents, medical records (MR) and interview with facility staff (EMP), it was determined that the facility failed to follow their adopted Emergency Department (ED) policy by failing to ensure that a provider examination was conducted timely in relation to the patient's assigned triage class scale in 9 of 10 medical records reviewed (MR1, MR2, MR3,MR4, MR5, MR6, MR7, MR8 and MR10).   Findings Include:  Review of UPMC Somerset Policy HS-HD-PR-01 \"Patient Rights\" Last Revised January 2021, revealed \"... I. Policy: It is the policy of the UPMC to promote the interests and well-being of patients served in its United States based locations and to protect the interests of patients by the adoption of a Patients' Notice and Bill of Rights and Patient Responsibilities. ... Purpose:  The Patients' Notice and Bill of Rights and Patient Responsibilities is made available to patients, their family members and representatives via patient information materials and postings ... Other Healthcare Services: You have a right to: 1. Emergency procedures to be implemented without unnecessary delay. ...\"  Review of UPMC Somerset Policy Stat ID# 10063883 \"Triage\" Last Approved June 2022, revealed \"... Associated Policies/Cross References: N/A Policy Statement:  To ensure appropriate priority of care for Emergency Department patients the Emergency Department screens each patient presenting to the Emergency Department to determine priority of treatment according to the Emergency Severity Index.  Procedure: Guidelines for Patients being treated/tested/seen by and MD/PA:  Triage: class 1:  Stability of vital signs: unstable Severe pain/distress: Yes Examples: cardiac arrest, intubated trauma, severe overdose  Maximum wait time to be seen by MD/PA after triage: immediate  class 2:  Stability of vital signs: threatened Severe pain/distress: Yes Examples: most chest pains, stable traumas, difficulty breathing, altered mental status, active seizures, overdose w/patent airway, stroke symptoms, behavioral problems w/potential for violence  Maximum wait time to be seen by MD/PA after triage:  15 minutes  class 3:  Stability of vital signs: stable Severe pain/distress: No Examples: seizure history arrives awake, severe pain (6-10) as in a kidney stone, asthma attack w/good air exchange and sp02 > 93, suspected threatened abortion, most abdominal pains, cooperative mental health patients, general nursing home workup for >24 hour complaints  Maximum wait time to be seen by MD/PA after triage:  30 minutes  class 4:  Stability of vital signs: stable Severe pain/distress: No Examples: Fever > 102, headaches w/o neurological signs, chest pain in children or young adult w/o history, lacerations that require plastics or are complex, animal bite, constipation, simple fractures, corneal abrasions  Maximum wait time to be seen by MD/PA after triage:  60 minutes  class 5:  Stability of vital signs: stable Severe pain/distress: No  Examples:  Convenience visits (requests for testing), extremity injuries >12 hours old, fever <102 on admission, sore throats, flu symptoms, rashes, URI symptoms, UTI symptoms, conjunctivitis, minor lacerations or burns,   immunizations shots, tooth pain Maximum wait time to be seen by MD/PA after triage:  90 minutes  An experienced Charge RN is assigned to dedicated triage duty 24 hours a day.  Patients are triaged and assigned, by the charge nurse, an Emergency Severity Index, based on a 1-5 category-based triage system.  The triage note is entered by the Charge nurse into the EDM tracker board.  Vital signs, including temperature, blood pressure, pulse oximetry, height and weight, and pain score will be taken and recorded in EDM computer triage program.  The physician will be informed by the RN regarding patient's condition and directed to the patient having first priority. ...\"Review of UPMC Somerset PolicyStat ID 11865740 \"Medical Screening Examination\" Last Approved  October 2022, revealed \"... Policy Statement:  Somerset Hospital, Department of Emergency of Emergency Medicine has a standardized process to ensure that patients presenting for medical care receive an appropriate medical screening examination by a qualified medical person. ... Procedure:  Triage is the process by which a quick determination is made as to how quickly and how extensive the ED resources should be used to provide patient treatment.  Triage is not the same as a medical screening examination.  Triage is a process which determines when a patient is seen by a physician, not whether he is seen.  The Emergency Department physician, nurse practitioner, or physician assistant on duty is regarded as qualified medical personnel and responsible for providing each patient with an appropriate medical screening examination. ...\" 1.  Review of MR1 dated September 15, 2022, revealed the patient was triaged, Acuity 3 Urgent, at 3:05 PM with a chief complaint of postoperative complications from skin lesions removed from the right arm two days ago with bleeding still noted.  Continued review of MR1 revealed that the patient eloped at 7:24 PM.  MR1 revealed no documented evidence that the patient was seen by MD/PA within 30 minutes following triage.  2.  Review of MR2 dated September 1, 2022, revealed the patient was triaged,  Acuity 3 Urgent, at 10:33 AM with a chief complaint of headache and shortness of breath for a few days.  Continued review of MR2 revealed that the patient eloped at 1:06 PM.  Provider entered documentation at 1:07 PM that patient had testing done through triage, was never brought back to the ER and was not seen by a provider.   MR2 revealed no documented evidence that the patient was seen by MD/PA within 30 minutes following triage.  3.  Review of MR3 dated September 1, 2022, revealed the patient was triaged, Acuity 3 Urgent, at 2:28 PM with a chief complaint of abdominal pain. Continued review of MR3 revealed that the patient eloped at 5:39 PM.  Provider entered documentation at 5:45 PM that the patient was triaged but was never seen by a provider.  MR3 revealed no documented evidence that the patient was seen by MD/PA within 30 minutes following triage.  4.  Review of MR4 dated September 29, 2022, revealed the patient was triaged, Acuity 4 Less urgent at 5:37 PM with a chief complaint of periorbital pain. Continued review of MR4 revealed that the patient eloped at 8:26 PM.  MR4 revealed no documented evidence that the patient was seen by MD/PA within 60 minutes following triage. 5. Review of MR5 dated September 06, 2022, revealed the patient was triaged, Acuity 4 Less urgent at 11:42 AM with a chief complaint of shortness of breath. Continued review of MR5 revealed that the patient eloped 2:53 PM. MR5 revealed no documented evidence that the patient was seen by MD/PA within 60 minutes following triage. 6.  Review of MR6 dated September 06, 2022 revealed the patient was triaged, Acuity 4 less urgent at 12:17 PM with a chief complaint of shortness of breath.  Continued review of MR6 revealed that the patient eloped at 2:55 PM. MR6 revealed no documented evidence that the patient was seen by MD/PA within 60 minutes following triage. 7.  Review of MR7 dated September 12, 2022, revealed the patient was triaged, Acuity 4 less urgent at 11:02 PM with a chief complaint of upper extremity injury.  Continued review of MR7 revealed that the patient eloped at 11:51 PM.  MR7 revealed no documented evidence that the patient was seen by MD/PA within 60 minutes following triage. 8.  Review of MR8 dated September 14, 2022, revealed the patient was triaged, Acuity 3 urgent at 4:21 PM with a chief complaint of choking.  Continued review of MR8 revealed that the patient eloped at 9:51 PM.  MR8 revealed no documented evidence that the patient was seen by MD/PA within 30 minutes following triage. 9.  Review of MR10 dated September 19, 2022, revealed the patient was triaged Acuity 3at 3:12 PM with a chief complaint of chest pain.  Continued review of MR10 revealed that the patient eloped at 5:59 PM.  MR10 revealed no documented evidence that the patient was seen by MD/PA within 30 minutes following triage. Interview on April 18, 2023, at approximately 11:15 AM with EMP2 confirmed the above findings.   Plan of Correction - To be completed: 05/24/2023UPMC Somerset will implement the following changes to meet the expectations of UPMC Somerset Policy HS-HD-PR01 \"Patient Rights\". Education will begin on 5/15/2023 with the UPMC Somerset policy for EMTALA HS-LE0007. Leadership from Patient Access and Emergency Department will have all care providers and registrars within the UPMC Somerset Emergency Department and UPMC Patient Access review the EMTALA policy and sign off as completed by May 30, 2023. EMTALA education, which is required bi-annually, will be completed October 2023, with all safety education that is provided by the UPMC system to every employee as a required education.  UPMC Somerset will be adopting a UPMC system related policy named \"Assessment/Reassessment\" that will take the place of our current Triage Policy (Policy Stat ID #10063883) and Medical Screening Examination Policy (Policy Stat ID #11865740) following the closure of the Plan of Correction. This new policy will be adopted by June 14, 2023 and the two previous referenced policies will be retired. This policy will include the following: Patients will be reassessed in the ED Based on ESI assigned, or more frequently as patient condition warrants.  The new Assessment/Reassessment Policy will be presented and approved at the Medical Executive Committee meeting to be held on June 14, 2023 by the Patient Safety Officer. Following adoption of this policy, education of all Emergency Department staff will be completed by June 30, 2023  UPMC Somerset Emergency Department has added a Patient Care Technician (PCT) in the registration area during peak times or when there is an influx of multiple patients presenting to the Emergency Department for care. The PCT will monitor the area by doing rounds, provide updates to patients or support persons about wait time, and identify any urgent changes in conditions. This is active as of April 1, 2023.  UPMC Somerset Emergency Department has ordered signage for the Emergency Department waiting area to explain that patients are taken in order of their acuity.  UPMC Somerset Emergency Department Nursing Leadership will pull 5 (five) random emergency department medical records per day to review the documentation to ensure that patients presenting for medical care receive an appropriate medical screening examination by a qualified medical person based on their presentation, condition, complaints and acuity. An excel spreadsheet of all records reviewed will be maintained and will begin July 1, 2023 (following completion of previous mentioned education) and conclude July 31, 2023. Audits completed in July will be reviewed at the August 17, 2023 Board Quality Committee. Any records found to not meet the guidelines of our current policies will be reviewed with those staff involved in the care of the patient by the Director of Emergency Services. If there is low compliance, Nursing Leadership will continue to monitor until August 31, 2023 and reevaluate compliance at that time. Any further audits from August (if needed) 2023 will be reviewed at the September 21, 2023 Board Quality Committee meeting."
        },
        {
            "eventid": "T96111",
            "date": "3/27/2023",
            "data": "Initial comments:This report is for the new service, Multiple Telemedicine Services, beginning on September 1, 2020. The UPMC Somerset attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is for the new service, Multiple Telemedicine Services, beginning on September 1, 2020. The UPMC Somerset attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "LTL711",
            "date": "2/6/2023",
            "data": "Initial comments:This report is the result of an unannounced onsite complaint investigation CHL22C711J completed on November 15, 2022, at UPMC Somerset.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced onsite complaint investigation CHL22C711J completed on November 15, 2022, at UPMC Somerset.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "2MQK11",
            "date": "1/19/2023",
            "data": "Initial comments:This report is the result of an unannounced onsite complaint investigation CHL22C746J completed on January 19, 2023, at UPMC Somerset.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is the result of an unannounced onsite complaint investigation CHL22C746J completed on January 19, 2023, at UPMC Somerset.  It was determined that the facility was in compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        },
        {
            "eventid": "Y76H11",
            "date": "1/14/2023",
            "data": "Initial comments:This report is for replacement equipment, Class II Biological Safety Cabinet, beginning on January 10, 2023. The UPMC Somerset attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction: Initial comments:This report is for replacement equipment, Class II Biological Safety Cabinet, beginning on January 10, 2023. The UPMC Somerset attested they were in full compliance with the requirements of the Pennsylvania Department of Health's Rules and Regulations for Hospitals, 28 PA Code, Part IV, Subparts A and B, November 1987, as amended June 1998. Plan of Correction:"
        }
    ]
}